{
  "name": "Aaron Rodgers",
  "url": "http://jewornotjew.com/profile.jsp?ID=990",
  "verdict": "Not a Jew",
  "description": "Dear readers from Europe, Asia, Central and South America, Oceania, and Africa (Africa? Sure, why not Africa!),\n\nWe know you came to our website today expecting to see a profile of some important Jew. Or perhaps some important non-Jew. Or at least someone you've heard of.\n\nWe're sorry to disappoint you.\n\nFor this weekend, America shuts down for the second biggest holiday of the year: the Super Bowl. (Christmas still got the #1 spot. We're working on it.) The Super Bowl is the annual football championship of the United States. (American football, not what you know as \"football\". People in helmets run around the field and crush each other senseless. The ball is pointy. That pretty much describes it.)\n\nSo, during the Super Bowl, Americans, even those who don't watch football regularly (even the women!) gather around at parties (usually, at the house of whoever has the biggest TV), eat an ungodly amount of fatty foods (the potato chip industry adores this day), drink A LOT of beer (and apparently beat their wives. It's the #1 day of the year for wife beating. Classy.), and, yes, watch a little sports (and commercials. Some people watch the Super Bowl for the advertising. It's hard to explain, dear non-American readers).\n\nThis year's Super Bowl pits the Pittsburgh Steelers and the Green Bay Packers. The Steelers are led by Ben Roethlisberger, who not only won two Super Bowls already, but has also been accused of rape (he's already profiled, so you can click on his name below). The Packers are led by Aaron Rodgers, who, despite a somewhat Jewy first name, is not Jewish at all. In fact, of the 100+ players involved in this game, we're pretty sure there's not a single Jew among them.\n\nSo we apologize, dear readers from Europe, Asia, Central and South America, Oceania, and, probably, Africa. And now excuse us. The potato chips are calling.",
  "pros": null,
  "cons": null,
  "score": 990,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/a/aaron_rodgers.jpg",
  "created_at": "2025-03-29T12:53:06+02:00",
  "updated_at": "2025-03-29T12:53:06+02:00"
}