{
  "name": "Abram Goltsman",
  "url": "http://jewornotjew.com/profile.jsp?ID=2994",
  "verdict": "Jew",
  "description": "The Arctic Ocean to the north of Russia is full of uninhabited islands with whimsical names. There is Three Bears Island, surely named after Goldilocks' unwanted hosts. There are Hammer and Sickle Islands, forever sticking to their bolshevik ideals. There is the Island of the Truth of the North, which, let's be serious, can be quickly summarized: it's fucking cold. There is Dead Seal Island, which seems quite a downer. There is New Siberia Island... wait, is anyone sure we need a NEW Siberia? Moving on.\n\nAnd then there are a bunch of islands named after Nordic explorers and other important figures. (Alexander Graham Bell Island FTW!) Which brings us to the obvious question... are there any Arctic islands named after Jews?\n\nIf you remember our profile of Russian polar explorer Rudolf Samoylovich, take a bow. No, seriously, you win. In that profile, we mention that there is an island named after him. Alas, as far as Jewish Russian polar explorers go, the list pretty much begins and ends with Rudolf. So if not explorers, then...\n\nThen someone named Abram Goltsman, who has whole FIVE islands named after him! There is Big Golstman, and West Goltsman, and East Goltsman, and two islands which share the name North Goltsmans, and all together they are known as the Goltsman Islands, and holy crap, who is this Goltsman character, and what did he do to deserve such an honor?\n\nHe died. Turns out Goltsman was a politician who was in charge of Soviet aviation. In 1933, after personally being invited by Stalin to go to Crimea, he and seven others perished in an airplane crash. (Oh, the irony...) When a new archipelago was discovered later that year, it was given Goltsman's name.\n\nNot as exciting as Hercules Island, but it'll do.",
  "pros": null,
  "cons": null,
  "score": 2994,
  "category": "Politics",
  "image_url": "http://jewornotjew.com/img/people/a/abram_goltsman.jpg",
  "created_at": "2025-03-29T13:17:39+02:00",
  "updated_at": "2025-03-29T13:17:39+02:00"
}