{
  "name": "Abram Ioffe",
  "url": "http://jewornotjew.com/profile.jsp?ID=2241",
  "verdict": "Borderline Jew.",
  "description": "Remember when America decided to rename French fries as \"freedom fries\"? Sure, you do. So what does that have to do with Russian Jewish physicist Abram Ioffe? We'll get there.\n\nBelieve it or not, America is not the first place to rename things in such a way. Long before freedom fries became a thing, a similar wave swept through the good old Soviet Union. As part of dislike for things foreign, the so-called \"battle with cosmopolitanism\", many things were renamed. One of these was French bread, which became \"urban bread\". You were 60 years behind, America.\n\nYet the Soviet battle didn't end with simple renamings; \"cosmopolitanism\" went beyond the kitchen. The real battle was with these... oh, let's just call them by their right name: Jews, who were deemed \"cosmopolitan\" because of their supposed lack of Soviet patriotism. From 1948 to 1953, there was a cleansing of Jews in top Soviet posts. Those who were simply demoted or fired could consider themselves lucky, as many were arrested. Even Ioffe (see, we got to him), the man who once determined the charge of the electron, the man who put Soviet physics on the world map, the man who was asked to lead the atomic bomb effort, was tossed aside like stale bread.\n\nWhich brings us to America today. Sure, freedom fries seem like a distant joke, but dislike of foreign ideas? Escalation of brainless patriotism? Systematic hatred of ethnic and religious minorities? Don't make us long for good old Soviet days...",
  "pros": null,
  "cons": [
    "ider themselves lucky, as many were arrested. Even Ioffe (see, we got to him), the man who once determined the charge of the electron, the man who put Soviet physics on the world map, the man who was asked to lead the atomic bomb effort, was tossed aside like stale bread."
  ],
  "score": 2241,
  "category": "Religion",
  "image_url": "http://jewornotjew.com/img/people/a/abram_ioffe.jpg",
  "created_at": "2025-03-29T13:17:20+02:00",
  "updated_at": "2025-03-29T13:17:20+02:00"
}