{
  "name": "Abraham Zapruder",
  "url": "http://jewornotjew.com/profile.jsp?ID=1019",
  "verdict": "Jew",
  "description": "What is the most famous film of all time?\n\nThe Godfather, Snow White (any of those early Disneys, really), even more recent schlock like Titanic could be considered a legitimate response. And yet all of those arguably fall under the shadow of 26.6 seconds shot by a Russian Jew on Elm Street in Dallas, Texas in 1963.\n\nThe Zapruder film, named for the man who recorded it and the only video of the assassination of President John F. Kennedy: a piece of American treasure, no less important than an original copy of the Constitution. Over the years, the film has been deified, cast out, then deified again. Just as its famous subject and the event it records have been.\n\nZapruder found the recording so repulsive he could hardly speak about it, insisting that the frame of Kennedy's actual death (#313) be removed from public showings. The whole thing reflects the inherent randomness of life. IF he hadn't brought the camera. IF he had been standing somewhere else. IF. If. if....\n\nIn the end, it will be another one of those things we have to explain to the aliens when they show up. There is no story or plot, per se. The budget was the price of the camera (admittedly dear in 1963). The lighting and the set were out of anyone's control. The performers... well, there weren't any.\n\nIs it history? Is it art? Is it even a film at all? It simply is. And that is what makes it so devastating and so amazing.",
  "pros": null,
  "cons": [
    "titution. Over the years, the film has been deified, cast out, then deified again. Just as its famous subject and the event it records have been.",
    "Is it history? Is it art? Is it even a film at all? It simply is. And that is what makes it so devastating and so amazing."
  ],
  "score": 1019,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/a/abraham_zapruder.jpg",
  "created_at": "2025-03-29T13:16:48+02:00",
  "updated_at": "2025-03-29T13:16:48+02:00"
}