{
  "name": "Aflac Duck",
  "url": "http://jewornotjew.com/profile.jsp?ID=1024",
  "verdict": "Barely a Jew",
  "description": "This was going to be a funny little profile about the potential Jewishness of the advertising icon known as the Aflac Duck. We would remind you that ducks are kosher (No bacon, no shrimp, no cheeseburgers, but we do get duck?! Could be worse.), point out that the ol' Aflac quack is voiced by a Jew (Gilbert Gottfried), have a few laughs and move on. That's what this was going to be.\n\nInstead, however, we have this mishegas: It was announced recently that the voice of Mr. Duck (Gottfried, we JUST said it. Sheesh), was fired from the role for  inappropriate comments he made about the earthquake/tsunami disaster in Japan. Basically he made a few jokes (not particularly uniquely funny ones, if it must be known) on Twitter. \n\nHow many people read them, were offended, knew that Gottfried was the voice of the Aflac duck, and were turned off from the brand? The Venn diagram for people that are that culturally informed, who are also regular Gilbert Gottfried Twitter followers, and are so easily offended need not be drawn. \n\nWas it offensive? Maybe. Too offensive to make a joke about? Perhaps. Should the company maybe have been aware that this is what comedians do for a living? Yuh-huh. That Gottfried in particular is well-known in the comic community for saying things that should not be said? Ah-yup. And, honestly, are they hurting themselves more by this little tantrum they're now throwing about it? That would be an affirmative, wing man.\n\nWhatever. You've got a guy (we can say from a personal account a very good guy actually) making duck noises for your legalized extortion company (yeah, that's what it is) and he said something that, while ill-advised, was no different than anything anyone else in his profession was doing.\n\nAnd you ruined a pretty funny Jew or Not Jew profile to boot. Hope you're happy.",
  "pros": null,
  "cons": null,
  "score": 1024,
  "category": "Comedy",
  "image_url": "http://jewornotjew.com/img/people/a/aflac_duck.jpg",
  "created_at": "2025-03-29T13:16:48+02:00",
  "updated_at": "2025-03-29T13:16:48+02:00"
}