{
  "name": "Al Rosen",
  "url": "http://jewornotjew.com/profile.jsp?ID=1537",
  "verdict": "Jew",
  "description": "What is it with Jewish baseball players and their nicknames? There's the Hebrew Hammer, Hank Greenberg. Then there's the Hebrew Hammer, Ryan Braun. Of course we can't forget Shawn Green, the Hebrew Hammer. And no list would be complete without the Heb...\n\nWaitaminute. \n\nThis is really the best we can do? In a sport with such nom du bats as the Splendid Splinter, Big Poison, Mr. October, Big Train, Pronk, and the Big Hurt, we've got every Jewish slugger with the same, dumb name?\n\nAs for Al Rosen, well he may be one of the best, forgotten Jewish sluggers of all time. Rosen joined the majors for the Mistake-By-The-Lake at age 23. His career as a lieutenant in the Navy during World War II delayed his career, but by age 26 he was a star. \n\nHis career was remarkably short, just 10 years and only 7 of those really productive. But he still smashed nearly 200 HRs, made 4 All Star teams, and won an MVP award for his 1953 season, back when that award actually meant something (he batted .336/.422/.613 for 9.8 WARP, easily one of the top 100 individual seasons all time).\n\nRosen's not a Hall of Fame baseball player (nor a HOF executive despite running the Yankees, Astros, and Giants, the former and the latter to pennants), but he was a Hall of Fame Jew. He considered changing his name to make it more Jewish, just in case anyone was in doubt. When Ed Sullivan suggested Rosen was Catholic, Al demanded a full public retraction and an apology. And Rosen had his own trick for dealing with anti-semitic players and fans: \"You flatten them.\"\n\nYeah, Al Rosen was pretty darn awesome, actually. And his nickname? The Hebrew Ham...\n\nG-d dammit.",
  "pros": null,
  "cons": null,
  "score": 1537,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/a/al_rosen.jpg",
  "created_at": "2025-03-29T13:17:02+02:00",
  "updated_at": "2025-03-29T13:17:02+02:00"
}