{
  "name": "Aleksei Kapler",
  "url": "http://jewornotjew.com/profile.jsp?ID=3464",
  "verdict": "Borderline Jew.",
  "description": "As regular readers know, we love rehashing love stories, so let's take us to the Soviet Union, 1942. World War II rages on. Aleksei meets Svetlana.\n\nHe: Aleksei Kapler (born Lazar Kapler; he was encouraged to change his last name as well to avoid antisemitism, but didn't), actor, screenwriter, journalist. He is in his late 30s and has been divorced for a good decade. (He did convert to Orthodoxy prior to marriage.)\n\nShe: Svetlana (oh, crap, we have to give it away...) Stalina. Yes, Stalin's daughter. She is 16. This is not gonna end well, is it?\n\nNope! Stalin was not exactly a fan of his daughter falling for a man 20 years her senior. Being a Jew did not help either. So off to the gulag Kapler went, on the charges of \"anti-Soviet agitation\". In 1948, Kapler was released, Svetlana is already married off, so all is well...\n\nNope! Off to another gulag for Kapler. He had to wait for Stalin's death in 1953 to get out. By then, Svetlana was on husband #2.\n\nKapler eventually got rehabilitated and hosted a television program about movies, sort of like a Soviet Roger Ebert. Svetlana got out of the Soviet Union in 1966 and ended with the name Lana Peters, on husband #5.\n\nSome love story!\n\nu = document.location.href.toLowerCase();\nif (u.indexOf('tl=ru') != -1) {\n q = document.getElementById(\"quote\");\n q.innerHTML = '\u003ci\u003e'+String.fromCharCode(171)+'\u0026#1057;\u0026#1088;\u0026#1077;\u0026#1076;\u0026#1100; \u0026#1085;\u0026#1080;\u0026#1093; - \u0026#1087;\u0026#1086;\u0026#1089;\u0026#1090;\u0026#1088;\u0026#1072;\u0026#1076;\u0026#1072;\u0026#1074;\u0026#1096;\u0026#1080;\u0026#1081; \u0026#1086;\u0026#1090; \u0026#1057;\u0026#1090;\u0026#1072;\u0026#1083;\u0026#1080;\u0026#1085;\u0026#1072; \u0026#1050;\u0026#1072;\u0026#1087;\u0026#1083;\u0026#1077;\u0026#1088;...'+String.fromCharCode(187)+'\u003c/i\u003e\u003cp\u003e';\n}",
  "pros": null,
  "cons": null,
  "score": 3464,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/a/aleksei_kapler.jpg",
  "created_at": "2025-03-29T13:17:51+02:00",
  "updated_at": "2025-03-29T13:17:51+02:00"
}