{
  "name": "Alexander Berkman",
  "url": "http://jewornotjew.com/profile.jsp?ID=2176",
  "verdict": "Jew",
  "description": "Alexander Berkman was not very good at killing. In 1892, he, together with anarchist friends Emma Goldman and Modest Aronstam (all Jews), decided to assassinate anti-union magnate Henry Clay Frick. The trio believed that the assassination would trigger a workers' revolution in America. (Let's jump ahead: it didn't.)\n\nBerkman shot Frick twice and stabbed him three times. Frick survived. Berkman was apprehended at the scene.\n\nBut Frick was not Berkman's only failed target. The man Berkman tried to kill multiple times, and kept failing was... himself.\n\nAfter attempting to kill Frick, Berkman tried to chew a dynamite capsule, but a policeman stopped him. When a jail, he sharpened a spoon, but was caught. He considered other options, such as banging his head against the metal bars, and asked for a capsule to be smuggled in... none of it worked.\n\nBerkman spent 14 years in jail, resumed his anarchist ways (without overt assassination attempts), was jailed again, and then deported, together with Goldman, to Russia.\n\nFirst a fan of the Russian Revolution, Berkman quickly become disillusioned. He spent the rest of his life in France, where, in 1936, he attempted another suicide. Berkman shot himself, but did not die immediately. The bullet paralyzed him.\n\nBerkman died later that day. Finally successful?",
  "pros": null,
  "cons": [
    "Berkman spent 14 years in jail, resumed his anarchist ways (without overt assassination attempts), was jailed again, and then deported, together with Goldman, to Russia.",
    "First a fan of the Russian Revolution, Berkman quickly become disillusioned. He spent the rest of his life in France, where, in 1936, he attempted another suicide. Berkman shot himself, but did not die immediately. The bullet paralyzed him.",
    "Berkman died later that day. Finally successful?"
  ],
  "score": 2176,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/a/alexander_berkman.jpg",
  "created_at": "2025-03-29T13:17:18+02:00",
  "updated_at": "2025-03-29T13:17:18+02:00"
}