{
  "name": "ALF",
  "url": "http://jewornotjew.com/profile.jsp?ID=519",
  "verdict": "Not an Alien.",
  "description": "rating.innerHTML = '8';\nrat1.innerHTML = '2';\nrat2.innerHTML = '5';\nrat3.innerHTML = '1';\nratTitle.innerHTML = 'Alien Score:';\nbanner.src = 'img/other/alf/alien-title.gif';\nratPic1.src = 'img/other/alf/alien-2.jpg';\nratPic2.src = 'img/other/alf/alien-5.jpg';\nratPic3.src = 'img/other/alf/alien-1.jpg';\n\n\na { color:#008000; }\n.border { background-color: #008000; }\n\nAttention Earth-Hebrews.\n\nWe have infiltrated your precious Intertubes. We control the vertical. We control the horizontal. The diagonal is held by a multi-planetary corporation that we also control.\n\nDo not be alarmed. We are simply using this sophisticated and evolved (for a Human) Earth-rating device to communicate to you the following necessary information:\n\nThe creature you know as ALF, the so-called Alien Life Form, is neither alien nor life form. We understand that this may be disconcerting to you. We too were momentarily confused by his realistic movements, his craving for Earth felines (they really are quite delicious), and his sophisticated (for a Human) humor.\n\nBut alas it is not so. He is what you meat popsicles would refer to as a puppet: a particularly inventive mixture of cloth, plastic, and dead orangutan hair given the appearance of life by shoving a hand up it's tuchus. (And seriously, what the fuck is up with that?! But we digress.)\n\nPlease do not associate this ignorant, human-loving boob as a member of our clearly superior, educated, syndicated-television-watching galactic community.\n\nWe now return you to your regularly scheduled 1000-word treatise on  Corey Haim.\n\n(However, on a completely unrelated note, you can be assured that the being you know as Yoda is definitely, totally, real.)",
  "pros": null,
  "cons": null,
  "score": 519,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/a/alf.jpg",
  "created_at": "2025-03-29T12:52:55+02:00",
  "updated_at": "2025-03-29T12:52:55+02:00"
}