{
  "name": "Ali MacGraw",
  "url": "http://jewornotjew.com/profile.jsp?ID=1378",
  "verdict": "Borderline Jew.",
  "description": "Dear readers,\n\nIt's time we sat down and had a talk. That suggestion box of ours is being flooded with requests, and we just can't handle them all. Oh, sure, it was all fine at first, when we got a suggestion per week, got excited that somebody actually read our drivel, and immediately wrote up the profile. Not anymore.\n\nNow, we get dozens of suggestions every day. Suggestions ranging from terrific to downright nutty. And since we only write five profiles a week, there is just no way that everyone can be satisfied. So here are some useful tips:\n\n Do not suggest people previously profiled. You think this would be obvious, but somehow it's not.\n Do not suggest yourself, or your husband, or your best friend, or your college professor, or your dog. Exception: you/husband/friend/professor/dog are actually well-known. If we have to look them up, they're not.\n Do flatter us. We are weak like that.\n Do not suggest someone who is clearly not Jewish, and who has no link to Jewishness. Yes, we have profiled some who fall into this category, but they are far and between.\n Do not write in all caps. WE BEG YOU.\n Do not resubmit your suggestion if it hasn't been profiled already. Being persistent is not helping you here.\n Do suggest people with an interesting back story. Take actress Ali MacGraw. Her name screams goyishe, but she's actually Halachically Jewish, although her mother hid her heritage. Ali also played the original JAP in the film adaptation of Philip Roth's \"Goodbye, Columbus\". So she is a good suggestion. Country singer Tim McGraw? Not so much.\n Do keep reading. We have been known to follow up a suggestion years after the initial request.\n Do keep sending them in. Our website would be impossible without you, dear readers.",
  "pros": null,
  "cons": null,
  "score": 1378,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/a/ali_macgraw.jpg",
  "created_at": "2025-03-29T13:16:58+02:00",
  "updated_at": "2025-03-29T13:16:58+02:00"
}