{
  "name": "Allan Roth",
  "url": "http://jewornotjew.com/profile.jsp?ID=1210",
  "verdict": "Jew",
  "description": "In 1947, General Manager Branch Rickey (Not a Jew) made a personnel decision that would change sports, and the world, forever. Before this, there had been a segregation, an unwritten rule, stating that a certain kind of person was not welcome in the baseball world. That one was not to employ this type of individual;  not in secret, and certainly not in public.\n\nBut Rickey, who had also invented the farm system while working for the St. Louis Cardinals, was never one to let tradition get in the way of winning. And so he hired Allan Roth, statistician (and Jew, of course).\n\nPreviously, math was for nerds and baseball was for, well, not-nerds. But Rickey recognized that statistics — the collection of data, in the case of baseball, the collection of data to successfully measure contributions to a win — could give him an edge over his competition. And they did: Rickey was an early proponent of both on-base percentage and the usefulness of platooning players (having lefties face righties and vice versa) thanks to the data provided him by his new statistical director.\n\nRoth was the first of his ilk to be hired by a professional baseball team. He was not the last. Today, almost every professional team has a so-called sabremetrician (it's a fancy word for baseball stat guy) on its staff. High profile GMs Theo Epstein, Billy Beane, Jed Hoyer, Josh Byrnes, Brian Cashman, Jon Daniels, Sandy Alderson, and Andrew Friedman all come from a data-based background.\n\nTruly, anyone who works with numbers in any capacity owes Allan Roth an amazing debt for breaking down the barriers between what we think we see with our eyes and what the data tells us we know. \n\nWhat, you thought we were going to talk about Jackie Robinson? Come on, you know he's not Jewish!",
  "pros": null,
  "cons": null,
  "score": 1210,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/a/allan_roth.jpg",
  "created_at": "2025-03-29T13:16:53+02:00",
  "updated_at": "2025-03-29T13:16:53+02:00"
}