{
  "name": "Andrei Moiseev",
  "url": "http://jewornotjew.com/profile.jsp?ID=936",
  "verdict": "Not a Jew",
  "description": "The biggest contribution of Baron Pierre de Coubertin (Not a Jew) is the resurrection of the Olympics. Not lagging far behind is the creation of the awesome sport of modern pentathlon.\n\nWhat is pentathlon, you ask? And what makes it so modern? You can see that we anticipated these questions. Unless you're an Olympic nut or a resident of some obscure country which just happens to be good at the sport (oh, let's say... Lithuania), you probably have never heard of it.\n\nWell, modern pentathlon is a mashup of five events that de Coubertin thought will be essential to a modern (err... late 19th century) solider caught behind enemy lines: running, swimming, fencing, shooting, and riding an unfamiliar horse (somehow, wearing a mustache as a disguise did not make the cut).\n\nNow, the first four are rather self-evident, but it's the horse part that is getting us all giddy. Sure, it's understandable, if a soldier behind enemy lines is without an attachable mustache and is forced to ride a horse, that horse will be unfamiliar. (Unless his own horse is caught behind lines himself... or herself. Can't discount that factor.)\n\nWhich leads us to so many questions. How exactly are the horses picked? And if you are familiar with one of the horses, do you have to declare it pre-selection? Or the two of you must avoid eye contact, while secretly hoping that the luck of the draw sets up the two of you together? Perhaps we need to ask a Lithuanian to find out how it really works.\n\nOf course, you're not here to listen to us dwell on the complexities of horse selection. You're here to find out about great Jewish modern pentathletes. And...\n\nWe got nothing.\n\nJews run, Jews swim, Jews (surprisingly) fence, Jews (reluctantly) shoot, Jews even ride horses. All five? That will have to be one non-stereotypical Jew. So far we haven't found one... at least not one with any kind of prowess. Two-time defending Olympic champion Andrei Moiseev probably does have Jewish ancestry, with his last name coming from the Russian for \"Moses\". But that's as close as we can get it.\n\nAnd now, modern pentathlon is in peril. It barely survived being excluded from the next Olympics, and recently went a transformation where the running and shooting were combined into one event (making \"modern pentathlon\" a double misnomer).\n\nRunning and shooting at the same time? It just keeps getting more awesome, isn't it?",
  "pros": null,
  "cons": null,
  "score": 936,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/a/andrei_moiseev.jpg",
  "created_at": "2025-03-29T12:53:05+02:00",
  "updated_at": "2025-03-29T12:53:05+02:00"
}