{
  "name": "Anne Hathaway",
  "url": "http://jewornotjew.com/profile.jsp?ID=1455",
  "verdict": "Sadly, Not a Jew.",
  "description": "DeadOrNotDead. GayOrNotGay. PuertoRicanOrNotPuertoRican. GuammyOrNotGuammy. Sure we always talk about doing these sorts of things. But let's be honest: it's not happening. Not now. Not soon. Not ever. We're Jews and so that is what we are going to write about. Other people — dead ones, gay ones, Guamican ones — will have to step up and write those other sites.\n\nSorry.\n\nBut the one site you might see us do? The one that secretly settles in our hearts of hearts? JerseyOrNotJersey.com. Yeah, that one... that one we actually could see doing. Both creators of this site are from the American armpit (one of us has since been paroled. The other, sadly, may never know the freedom that dare not speak its name), so we actually know from what we speak.\n\nWho would be the first profiles? Springsteen (the 15), Mike Trout (baseball phenom extraordinaire), and actress Anne Hathaway (she grew up in Millburn, after a Brooklyn birth). \n\nAnne's acting career actually began in the \"Garden\" State and she's since gone from playing young and geeky to sexy seductress — from child (well, teen really) star to Hollywood royalty. A JONJ.com of a more diner-y sort would give her a 12. \n\nAs for JewOrNotJew? Y'know, the site we actually write right now? Well Anne isn't anything close to Jewish, but her husband is. So for now (Hollywood royalty, remember? We'll set the over/under on this marriage at 3.5 years), we get a chance to ramble on about one of our more preferred performers. Someone who can actually act instead of just look pretty for the cameras.\n\nHmmm, ActorOrNotActor.com... Obviously De Niro would be the 15 and Katie Holmes would be the 0? Oh why do we even bother pretending we're doing this?",
  "pros": null,
  "cons": null,
  "score": 1455,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/a/anne_hathaway.jpg",
  "created_at": "2025-03-29T13:16:59+02:00",
  "updated_at": "2025-03-29T13:16:59+02:00"
}