{
  "name": "Anouk Aimee",
  "url": "http://jewornotjew.com/profile.jsp?ID=2939",
  "verdict": "Jew",
  "description": "\"So, you are the people who run Jew or Not Jew?\", he said. His perfect English was slightly accented.\n\n\"Yes, why do you ask?\"\n\n\"May I sit down?\"\n\nBefore we had a chance to reply, he grabbed a chair from the nearby table and dragged it over.\n\n\"Nice website, you have.\"\n\n\"What is this about?\"\n\n\"May I smoke?\"\n\n\"Well...\"\n\nHe took out a cigarette case from his breast pocket, struck a light, and inhaled.\n\n\"Your website,\" he said, \"it's too American.\"\n\n\"But...\"\n\n\"But what? Are you going to tell me that you write for an American audience?\"\n\n\"Well...\"\n\n\"Are you going to list off the various non-Americans you've profiled?\"\n\n\"Uhhh...\"\n\n\"Are you going to say that you even addressed this 'too American' in a previous profile?\"\n\n\"What is this about?\"\n\n\"You see this,\" he swept his hand in a circular motion. Ash dropped onto the cobblestones. \"This is Paris!\"\n\n\"Well, duh.\"\n\n\"Well, duh,\" he mimicked. \"Well, duh! Well, you like Paris, don't you? You like France?\"\n\n\"We love France...\"\n\n\"Then where is the profile of Anouk Aimee?\"\n\n\"Who?\"\n\n\"Who? Who? Oh, you Americans! Anouk Aimee is only one of the greatest actresses of all time!\"\n\n\"We've never heard of her...\"\n\n\"Oh, you're so provincial! You ever heard of Fellini? Or a little film called 'A Man and a Woman'?\"\n\n\"Maybe...\"\n\n\"Maybe! Maybe! She is only one of France's biggest stars, and yes, she is Jewish!\"\n\n\"Sir, can you leave us alone? We're trying to have lunch here!\"\n\nNone of this happened. We're not going to Paris or anywhere else, for that matter. But here is your Anouk Aimee profile...",
  "pros": null,
  "cons": null,
  "score": 2939,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/a/anouk_aimee.jpg",
  "created_at": "2025-03-29T13:17:37+02:00",
  "updated_at": "2025-03-29T13:17:37+02:00"
}