{
  "name": "Antony Blinken",
  "url": "http://jewornotjew.com/profile.jsp?ID=3135",
  "verdict": "Jew",
  "description": "In 1904, 25-year-old Meir Blinken emigrated from what was then the Russian Empire, and what is now Ukraine (we'll get back to \"what is now\") to America. Blinken died 11 years later, but not before becoming a prolific Yiddish-language writer. He also had time to produce progeny (we'll get back to \"progeny\").\n\nBlinken, like thousands of others, emigrated because being a Jew in the Russian Empire was not exactly palatable. In his short time in America, he achieved more than he could have ever dreamed of back home. Even more importantly, his children and descendants had opportunities they would never have had in Russia. Two of his grandsons became US ambassadors. His great-grandson, Antony, is the current US Secretary of State.\n\nBut Jews were not alone in their persecution by the Russian state. Despite the state's official stance that \"we are all friends\", every single minority has had its struggles. From forced relocations to dekulakization to plain old ethnic cleansing, Russia (then the Soviet Union, and now back to Russia again) has done it all.\n\nWhich brings us to today, and Russia's obscene, inexcusable, psychotic attack on Ukraine. And while things in Ukraine are not exactly perfect, it's a country that has been trying to emerge through a history of Russian lordship and become a modern, democratic society. It's a country that currently (we'll get back to \"currently\"?) has a democratically elected Jewish president and recently had a Jewish prime minister!\n\nThe US is not exactly perfect either, and there are no easy answers here. We just hope that Blinken understands the history that got him (and the rest of us) here and helps thwart the rebirth of the Russian Empire... in Ukraine and beyond.\n\nDo the right thing, Antony. Whatever that is...",
  "pros": null,
  "cons": null,
  "score": 3135,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/a/antony_blinken.jpg",
  "created_at": "2025-03-29T13:17:43+02:00",
  "updated_at": "2025-03-29T13:17:43+02:00"
}