{
  "name": "Arnold Rothstein",
  "url": "http://jewornotjew.com/profile.jsp?ID=882",
  "verdict": "Sadly, a Jew.",
  "description": "Sometimes we're accused of being, well... Jewish apologists here at JONJ. If there's even the slightest chance of absolving one of our Hebrew brethren, our critics cry, then we will go ahead and do so, rather then admit that a Jew did wrong. And y'know what? That's fair. After all, what kind of people would we be if we didn't defend our own?\n\nIn the case of Arnold Rothstein though...  \n\nIn the early 1900s, baseball players were paid pretty poorly. Oh sure, Babe Ruth would famously make more than the US president by the end of the 1920s (\"I had a better year than he did,\" Ruth explained). But for the most part, ballplayers were guys who were just athletic enough to get out of the coal mines and so they were paid like coal miners.\n\nThe White Sox were in a particular bind because their owner Charles Comiskey was cheaper than most and then would nickel-and-dime them further for things like their own uniforms. And then in 1919 he simply stopped paying them.\n\nJewish gangster Arnold Rothstein, on the other hand, had an offer for them. More money than they would ever see ever in exchange for a little favor — intentionally losing the World Series so Rothstein and his boys could bet successfully on the outcome.\n\nWell, we know what happened. The White Sox took the money. The Reds took the series. And there's nothing left to do but look for someone to blame. \n\nBaseball clearly blamed the players, banning all eight who took the money (ironically, Rothstein never exactly paid the players either and they really, truly ended up with nothing). In retrospect it doesn't seem exactly fair. The Black Sox hadn't been paid in months. They were broke and desperate. And honestly not that intelligent (remember, coal miner was an aspiration for these guys). A concept like \"the sanctity of the game\" was a little out of context for them. \n\nIt would be easy to blame Comiskey for pushing them to that place. But it's not like he made them throw the Series. An all time historic villain and despicable human being, yes. But he didn't take the gamblers' money and he didn't lose the games.\n\nNo, sadly, there's only one man that can be blamed for all this: Rothstein, who saw eight starving players and offered them poison in the shape of food, almost destroying professional baseball in the process. All for a couple of bucks.\n\nThere's just no way to apologize for that.",
  "pros": null,
  "cons": null,
  "score": 882,
  "category": "Politics",
  "image_url": "http://jewornotjew.com/img/people/a/arnold_rothstein.jpg",
  "created_at": "2025-03-29T12:53:04+02:00",
  "updated_at": "2025-03-29T12:53:04+02:00"
}