{
  "name": "Art Modell",
  "url": "http://jewornotjew.com/profile.jsp?ID=680",
  "verdict": "Jew",
  "description": "If you are a fan of the Baltimore Ravens, Art Modell is a great man.\n\nIn 1984, under the cover of darkness, Baltimore's beloved Colts were packed in trucks and moved to Indianapolis. Owner Robert Irsay became Baltimore's number one villain, a title he will never relinquish. The whole city wept.\n\nIn 1996, Art Modell brought NFL football back. He took his Cleveland Browns and made them into the Baltimore Ravens. There were no stealth maneuvering this time. It was a fair deal in accordance with the league, and was contingent on the Browns being resurrected — history intact — three years later.\n\nSo sure, the citizens of Baltimore would have preferred an expansion team to the relocated one. But when NFL passed them up time and time again (seriously... Jacksonville?), what were they to do? How could they not embrace Modell and the Ravens?\n\nBesides, that Super Bowl title in 2000 was not too shabby.\n\nUnless you are a fan of the Cleveland Browns...\n\n\nIf you are a fan of the Cleveland Browns, Art Modell is the Antichrist. \n\nHe ripped out the heart of the beloved Browns fans, taking the team that meant so much to Cleveland and moved it to Baltimore.\n\nSure, the Browns came back a few years later, but it just isn't the same. The team has yet to recover and return to its former (AFC Championship game) glory. It's a sorry excuse for a team.\n\nAnd Baltimore? The damn Ravens, with Browns' former players, won the Super Bowl in 2000 and have been competitive just about every year after the move. And that asshole Modell was laughing all the way to the bank.\n\nAnd what did he do after that? He cashed out, selling the team! Typical.\n\nArt Modell: Traitor. Liar. Thief. Sellout.\n\nUnless you are a fan of the Baltimore Ravens...\n\n\n\nfunction flip() {\nd1.style.display = 'none';\nd2.style.display = 'inline';\nsetRatings(4, 4, 0);\nsetVerdict('Sadly, a Jew');\n}\nfunction flip2() {\nd2.style.display = 'none';\nd1.style.display = 'inline';\nsetRatings(4, 4, 2);\nsetVerdict('Jew');\n}",
  "pros": null,
  "cons": null,
  "score": 680,
  "category": "Art",
  "image_url": "http://jewornotjew.com/img/people/a/art_modell.jpg",
  "created_at": "2025-03-29T12:52:59+02:00",
  "updated_at": "2025-03-29T12:52:59+02:00"
}