{
  "name": "Arthur Fonzarelli",
  "url": "http://jewornotjew.com/profile.jsp?ID=935",
  "verdict": "Sadly, Not a Jew.",
  "description": "Everyone knows that Arthur Fonzarelli / Fonzie / The Fonz is Italian, right? Not so fast...\n\nFor we must discuss the case of Fonzie's Grandma Nussbaum, who appeared in three episodes. It's as convoluted a case as we've encountered during our years of running this website. But don't worry, dear readers, we'll get to the bottom of this. Obscure television grandmothers are no match for us.\n\nSo, Grandma Nussbaum. Nussbaum definitely CAN be a Jewish last name, but it can also be German. No help there. And she has been married multiple times, so it's possible that the last name is a leftover from one of the ex-husbands. Hmmmm.\n\nShe uses the word \"schlep\", but we've been through this. Just because a fictional character uses a Yiddish word, doesn't make them Jewish. For all we know, Grandma Nussbaum spent her formative years schlepping through New York City. Hmmmm.\n\nCan we at least figure out from what side of the family tree Grandma Nussbaum is? She is the grandmother of both Fonzie and Chachi. (\"Fonzie\"? \"Chachi\"? Jesus, were the 70s one mess-up decade.) Fonzie and Chachi are cousins: Chachi's mother is a Fonzarelli, meaning that she and Fonzie's father are brother and sister. This means that Grandma Nussbaum must be Fonzie's paternal grandmother. But it's suggested on the show that she is his maternal one. Well this just MAKES NO SENSE! Hmmmm.\n\nJewish references on Happy Days, Jewish references on Happy Days... Here we go: in an episode where the Fonz gets baptized, he thanks all the Jews attending the ceremony. So...\n\nSo there! He got baptized. The verdict is obvious. Screw Grandma Nussbaum.",
  "pros": null,
  "cons": null,
  "score": 935,
  "category": "Art",
  "image_url": "http://jewornotjew.com/img/people/a/arthur_fonzarelli.jpg",
  "created_at": "2025-03-29T12:53:05+02:00",
  "updated_at": "2025-03-29T12:53:05+02:00"
}