{
  "name": "Barney Dreyfuss",
  "url": "http://jewornotjew.com/profile.jsp?ID=1743",
  "verdict": "Jew",
  "description": "Boy, the Baseball Hall of Fame looks a mess these days. Half the deserving enshrinees are immediately ineligible because they used performance enhancing drugs, were linked to PEDs in some way, looked like they took PEDs, or once said the words PED out of context. \n\nThe other half don't actually deserve to be enshrined, but heck, they have to put someone in there.\n\nUnfortunately, however, this isn't actually a new problem. The Baseball Hall has always been a mess. It's just that modern media puts everything under the magnifying glass. And as any 10-year-old boy will tell you, when you put something under a magnifying glass that shit gets lit on fire.\n\nBut even before this \"to juice or not to juice\" dilemma, the Hall made plenty of errors. They accidentally elected the wrong brother (Rick Ferrell had a middling career as a catcher. Wes Ferrell was one of the greatest starting pitchers in the 1930s. Guess who got in). They've chosen mediocre players from good teams (Phil Rizzuoto) over great players on mediocre teams (Lou Whitaker). They've punished some players for minor misdeeds (Tim Raines, who used cocaine, but quit) and rewarded others despite them (Ty Cobb, who...there's not enough space to list everything Ty Cobb did). They seem to take a perverse joy in waiting till surefire HOFers die before they are elected (Ron Santo. Marvin Miller, probably).\n\nWe could go on, but we've got a profile to write here. So, Barney Dreyfuss. Dreyfuss, Jewish, owned the Pittsburgh Pirates at the turn of the (20th) century. He brought in some of their most talented players and made them into one of the best teams in the early National League. He co-invented the idea of a World Series and built one of the first modern ballparks.\n\nHe was a lock Hall of Fame owner. So when do you think he was elected?\n\n2008. Two-thousand EIGHT. What. The Fuck.\n\nOrdinarily we'd cry antisemitism, but in this case it's more likely that Dreyfuss was excluded for so long because his home town rhymes with Mittsburgh.\n\nWhat a shame.",
  "pros": null,
  "cons": null,
  "score": 1743,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/b/barney_dreyfuss.jpg",
  "created_at": "2025-03-29T13:17:07+02:00",
  "updated_at": "2025-03-29T13:17:07+02:00"
}