{
  "name": "Baron Munchausen",
  "url": "http://jewornotjew.com/profile.jsp?ID=3023",
  "verdict": "Sadly, Not a Jew.",
  "description": "18th century German nobleman Baron Munchhausen is famous throughout the world for a series of incredible, yet absolutely truthful tales. Don't ask us how, but we uncovered a previously unpublished one...\n\nI am sure you have heard about my exploits against the Turks, when I rode a cannonball across the field to victory. Unfortunately, a few days after that, a piece of shrapnel got stuck in my right arm. I wanted to keep fighting until no heathen was left alive, but the general commanded that I was to be sent home, so I had no choice but to oblige.\n\nI was recuperating at my estate, when my old friend, the Duke of Manndorff-zu-Pfannhofen-und-Wissenau, asked me to join him for a hunt. The duke is known as one of Europe's best marksmen (second only to me, some say). His palace sits on the north side of the Danube, next to a wide forest, where game is plentiful.\n\nThe duke greeted me warmly and wasted no time showing me his newest purchase: a Barbary falcon named Horus, acquired all the way from Arabia. It was said that this bird's grip was so strong, he once carried a camel all the way across the Lybian desert. As you know, I stick to the truth, so such tall tales are hard to believe.\n\nThe duke and I were trotting through the fields, when his dog, an Old Spanish Pointer, stopped in its tracks, meaning that game was nearby. The duke took the blindfold off Horus' head, and the bird took off into the skies. Underneath, a rabbit ran across the field at breathtaking speed. But he was no match for Horus, who dove, clutched the rabbit in his claws, and dropped the poor animal at the duke's feet.\n\nA strange thing happened then; instead of sitting back on the duke's arm, the falcon decided to settle... on my nose! Now, I do have one of the largest schnozes in all of Europe (some even thought I might be a Jew!), but it is hard to understand why the bird decided to perch there. (Perhaps he recognized the best hunter in the land?) I tried to shoo him off, but his grip only became stronger. Frustrated, I swung my rifle at him. That worked; the falcon took off to the air... carrying me underneath him, his claws buried deep into my nose.\n\nAs everyone knows, I never panic, even as the bird flew higher and higher. Instead, I took my rifle and started to shoot into the air, so that the recoil would force the falcon downwards. That worked, but just as the bird was about to land me safely on the ground, I noticed that we were approaching the Danube! I stopped shooting; the falcon suddenly loosened his grip, with nothing but the mighty river under my feet!\n\nNo, I did not sink to the bottom! The momentum of the bird was so great that it propelled me across the river! There I was, my feet barely breaking the surface, running on top of Europe's greatest waterway! It was not until I reached the opposite shore that I collapsed from exhaustion.\n\nThe duke found me later that evening, having to take the long way across the river via a bridge. As it turns out, there was something to gain from my adventure: while I was firing in the air, I shot four ducks and one very plump goose. The ensuing roast was one of the most delicious I've ever had, and the story of my run across the mighty Danube entered local legend!",
  "pros": null,
  "cons": null,
  "score": 3023,
  "category": "Religion",
  "image_url": "http://jewornotjew.com/img/people/b/baron_munchausen.jpg",
  "created_at": "2025-03-29T13:17:40+02:00",
  "updated_at": "2025-03-29T13:17:40+02:00"
}