{
  "name": "Bela Guttmann",
  "url": "http://jewornotjew.com/profile.jsp?ID=973",
  "verdict": "Jew",
  "description": "Did you know that one of the greatest and most controversial coaches in soccer history was a Jew?\n\nBela Guttmann started as a player in his native Hungary, where he briefly played for its national team. He then moved to Austria, where he led the all-Jewish Hakoah Wien club to the national championship (this is somewhat akin to your local JCC's basketball team winning the NBA title). Hakoah went on a tour of the United States, and Guttmann stayed in America. He played, among other teams, for soccer's incarnation of the New York Giants (this was the 1920s. Soccer leagues — plural — strove in America. Boy, have the times changed).\n\nIn the 1930s, Guttmann moved back to Europe and became a coach. With the obvious interruption for World War II, he led teams in Austria, Holland, Hungary, Greece, and Italy, where he commanded all-time giants AC Milan. Fired when the team was in first place, his outgoing statement was, \"I have been sacked even though I am neither a criminal nor a homosexual. Goodbye.\" We have no further comment.\n\nIn 1957, Guttmann made his way to South America. He took over the Sao Paulo club and popularized the revolutionary 4-2-4 formation (four defenders, two midfielders, four forwards). The formation was adopted by the Brazilian national team on their way to winning the 1958 World Cup.\n\nGuttmann wasn't done. His greatest triumph was in Portugal, where the led Benfica to back-to-back European Cups (the precursor to the Champions League). After winning his second title, he asked for more money. When the club refused, Guttmann quit, cursing the team with the words, \"not in a hundred years from now will Benfica ever win a European Cup\". The club has lost in five finals since.\n\nLeading clubs to championships? That's been done before. But wielding curses? Now that's one bad-ass soccer Jew.",
  "pros": null,
  "cons": null,
  "score": 973,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/b/bela_guttmann.jpg",
  "created_at": "2025-03-29T12:53:06+02:00",
  "updated_at": "2025-03-29T12:53:06+02:00"
}