{
  "name": "Ben Rappaport",
  "url": "http://jewornotjew.com/profile.jsp?ID=1092",
  "verdict": "Jew",
  "description": "It's not often we root for a television show to fail before seeing a single episode. Yet, in the case of \"Outsourced\", we did just that.\n\nThe first time we caught a promo, we asked, is this some kind of a joke? Sadly, it was all too real.\n\nHere's the premise: an American company decides to outsource its employees. So they send one survivor (played Ben Rappaport, Jew) to India where, we are assured, hilarity ensues. They have funny names! He is a fish out of water! They eat spicy food! He can't pronounce their names! They have weird holidays! He can't digest spicy food! They don't understand America! He finds love in a place where he least expects it! Everyone learns to be friends despite all the cultural differences! Please stop us from banging our head against the wall!\n\nNow, we never watched a minute of the show, for what we've seen in promos was more than enough. It was borderline offensive, playing up to ethnic stereotypes time and again. It's absolutely ridiculous that something this worthless could get on the air in the 21st century.\n\nBut \"Outsourced\" was worse than simply being banal television, for it made light of a terrible problem that shares its name with the show's title. Time and again, thousands of people find themselves out of a job because overseas labor is cheaper. In many of these cases, such outsourcing is completely uncalled for, its only purpose to line the pockets of company executives with more money. Sure, it might be a joke to television executives. But it's all too real for too many people.\n\nWell, \"Outsourced\" the TV show got canned after one year. Sadly, outsourcing the practice still remains.\n\nIf only it was as easy to cancel that rubbish.",
  "pros": null,
  "cons": null,
  "score": 1092,
  "category": "Business",
  "image_url": "http://jewornotjew.com/img/people/b/ben_rappaport.jpg",
  "created_at": "2025-03-29T13:16:50+02:00",
  "updated_at": "2025-03-29T13:16:50+02:00"
}