{
  "name": "Benedict Cumberbatch",
  "url": "http://jewornotjew.com/profile.jsp?ID=2695",
  "verdict": "Sadly, Not a Jew.",
  "description": "This is gonna be one of those profiles. Don't expect us to go to any length discussing Benedict Cumberbatch's potential Jewishness. (Come on! He definitely isn't! However, a 5/5/5 on BritishOrNotBritish.com, stiff upper lip and everything.) Instead, we're going to tackle a rather nonsensical question with surprisingly deep impact: does Sherlock Holmes, the original character, as created by Arthur Conan Doyle, exist in the world of \"Sherlock\", the TV show, where the said Mr. Cumberbatch plays the modern version of the character?\n\nHe cannot, right? In the world of \"Sherlock\", Cumberbatch's Holmes is real, so how could there be a fictionalized version of the same character from over a century ago? If there was, the sole comparisons from fictional cases to the ones the real Sherlock deals with would raise eyebrows. (No need to go to your mind palace, Cumberbatch, simply pick up a tome!) Then there is the name — if Sherlock Holmes, the fictional character, existed, Mr. and Mrs. Holmes would have to be insane to bear their child with that moniker. And they are not insane, so there is that.\n\nBut if there was no Sherlock Holmes, the fictional character, was there Conan Doyle? Perhaps there was, and he just never wrote Holmes fiction? Let's take that as an easy out.\n\nWe've dug our own rabbit hole, so let's go down it even further: if Conan Doyle didn't write any Sherlock fiction, what would have happened to the literature and adaptations that followed? It's not just derivatives like TV's \"House\" that wouldn't exist. Pretty much all of modern detective fiction owes its debt to the original consulting detective.\n\nSo, let's assume that in the \"Sherlock\" universe, there was a parallel Conan Doyle (Shmonan Shmoyle) who wrote a parallel Sherlock (Shmerlock?)  who became the keystone of all detective fiction to come. And Cumberbatch's Sherlock, for all his high-mindedness, is simply unaware...\n\nPlease stop us when we start making sense.",
  "pros": null,
  "cons": null,
  "score": 2695,
  "category": "Religion",
  "image_url": "http://jewornotjew.com/img/people/b/benedict_cumberbatch.jpg",
  "created_at": "2025-03-29T13:17:31+02:00",
  "updated_at": "2025-03-29T13:17:31+02:00"
}