{
  "name": "Benjamin Rubin",
  "url": "http://jewornotjew.com/profile.jsp?ID=1177",
  "verdict": "Jew",
  "description": "Once upon a time, there was a disease called smallpox. This was kind of a misnomer. The pox was anything but small, killing nearly half the people who contracted it, which, by the early 1900s, equaled over two million people a year.\n\nThis is a mind-blowing number to the modern mind, but is all the more impressive because (wait for it) we already had the vaccine. Had it, in fact, since two hundred years before when it was discovered that an injection of cowpox (the word itself, vaccine, comes from the Latin word for cow, or vacca) kept people from contracting smallpox later on.\n\nSo why were people still dying from smallpox? Some people didn't want to take the vaccine because of their beliefs (including loyalty to a less effective treatment called variolation), some were afraid of irrational and overblown possible side effects (including that, because it contained cowpox, it would turn people into cows), and some were unable to get the vaccine because there simply wasn't enough to go around.\n\nJews to the rescue! Well, Benjamin Rubin anyway. Rubin went all MacGyver on a sewing machine needle in 1965 and invented the bifurcated needle, which beyond being bifurcated (thus the name) delivered the same amount of protection from smallpox while using less vaccine, solving the supply issue. A mere 15 years later, other silliness overcome, smallpox was completely eradicated from the planet. No one even gets smallpox anymore, let alone dies from it.\n\nWe die from other diseases though, like influenza and pertussis and rabies. Even though we have vaccines for them and there is plenty of supply. But people don't get the vaccine because of their beliefs. Or because they are afraid of irrational, overblown possible side effects. \n\nOnce again, it's clear that we need Benjamin Rubin or someone like him to invent something to clear the way. Perhaps a vaccine for stupidity would help?",
  "pros": null,
  "cons": null,
  "score": 1177,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/b/benjamin_rubin.jpg",
  "created_at": "2025-03-29T13:16:52+02:00",
  "updated_at": "2025-03-29T13:16:52+02:00"
}