{
  "name": "Bettina de Rothschild",
  "url": "http://jewornotjew.com/profile.jsp?ID=3136",
  "verdict": "Jew",
  "description": "You know the names, Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune, (Pluto): Roman gods who orbit the sun. (Well, \"Earth\" is not exactly a god, but whatever.) But those are just the biggest bodies of our solar system. Pluto, of course, is now demoted to dwarf planet, a distinction it shares with Ceres, the largest asteroid.\n\nCeres is also a Roman goddess, the equivalent of Demeter. But Ceres is just asteroid #1... there are thousands.\n\n#2 is Athena. #3 is Juno, #4 is Vesta, and so it goes for a while, with Roman and Greek deities, until astronomers started to run out. #20 and #21 and Massalia and Lutetia, named for the Latin names of Marseilles and Paris. #45, Eugenia, is the first one named after a real person, Eugenie de Montijo, 19th-century Empress of France.\n\nIt took a while for the floodgates to open, but when they did, did they ever. There are asteroids named after famous people: Washingtonia (#886), Einstein (#2001), Magellan (#4055). There are asteroids named for places: Pittsburghia (#484), Transylvania (#1537), Jerusalem (#63163). There are numerous ones named after astronomers, which makes a lot of sense, but then there is an even bigger list named after astronomers' relatives: spouses, children, parents, and even all kinds of in-laws. (It takes a special mother-in-law to get a space rock named after her, and Muriel (#2982) Shoemaker must have been just that.) There are multiple asteroids named after Egyptian pharaohs, Czech Olympic athletes, and Soviet paratroopers. There is a whole category of fictional characters, including Mr. Spock (#2309), Sherlock (#5049), and Donald Duck (#12410)!\n\nWho is at fault of this free-for-all? Well, back in 1885, Austrian astronomer Johann Palisa discovered #250, but he really needed some cash. (For a very nerdy reason: traveling money to observe the total solar eclipse of 1886.) So he sold off the naming rights for 50 pounds to Baron Albert von Rothschild, who named the space rock after his wife (and cousin, ewww), Bettina. So #250 is important for two reasons: it's the first asteroid named after a real-life Jew (we're excluding #102, Miriam, named after Moses' sister), and it's the one that opened the floodgates.\n\nWhich brings us to #3468, Urgenta, named after a type of potato. That makes sense on one level: asteroids do look like potatoes... but also led to the comment that discoverers might lose naming privileges.\n\nThey haven't yet. One of the recent-named asteroids is #601916, named after the musician Sting. Definitely better than potato!",
  "pros": null,
  "cons": null,
  "score": 3136,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/b/bettina_de_rothschild.jpg",
  "created_at": "2025-03-29T13:17:43+02:00",
  "updated_at": "2025-03-29T13:17:43+02:00"
}