{
  "name": "Bette Midler",
  "url": "http://jewornotjew.com/profile.jsp?ID=1530",
  "verdict": "Jew",
  "description": "As part of JONJ's continued dedication to our long history and the Jewish community, we will occasionally republish profiles from our historical archives. Today — using our patented TimeScapeTM Technology — we present the last ever JONJ profile, transmitted telekinetically by Jew #5,903,547 in the year 3227.\n\nGreetings, human, android, and robot Jews.\n\nToday we close our humble endeavor. At this point, every important Jew from pretender demigod Jesus Christ Sr. to Church of Relativity founder Albert Einstein to Supreme World Commander Fievel Q. Katz-Stein-Rubinstein has been profiled. It is time for us to step down.\n\nTo be honest, we were going to close with yesterday's profile of Jew #1,779,601, but our research found an egregious omission. It looks like the esteemed and remarkable founders of this website never profiled the human Jew known as Bette Midler. Such an exclusion seems rather dubious, since her lifespan seemed to intersect those of the esteemed and remarkable founders (estimated to be at the onset of the 21st century).\n\nWhat do we know about this Midler? She was born on a beach in Hawaii. (We believe it to be an archipelago off the coast of Colorado that sunk in the 24th century.) Apparently, she could fly, as various recordings mention her wings. (We have no way to confirm this. Winged humans first appeared in the 29th century, so either Midler was 900 years ahead of her time, or this is some kind of a mistake.) A sect known as \"the gays\" considered her \"divine\". (We cannot explain that one.)\n\nSo what will we do after 318,256 profiles? Tomorrow, tune in to AlphaCentaurianOrNotAlphaCentaurian.com!",
  "pros": null,
  "cons": [
    "So what will we do after 318,256 profiles? Tomorrow, tune in to AlphaCentaurianOrNotAlphaCentaurian.com!"
  ],
  "score": 1530,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/b/bette_midler.jpg",
  "created_at": "2025-03-29T13:17:01+02:00",
  "updated_at": "2025-03-29T13:17:01+02:00"
}