{
  "name": "Bianna Golodryga",
  "url": "http://jewornotjew.com/profile.jsp?ID=2610",
  "verdict": "Jew",
  "description": "We feel that we need to talk about HIAS. The psychopath that slayed 11 Jews in a Pittsburgh synagogue claimed that... you know what, let's not quote him. Let's just talk about HIAS.\n\nIf you know an American Jew (and odds are, you know an American Jew), you can bet your life that HIAS had a role to get them here. If not them, their parents, grandparents, or great-grandparents. Since the late 19th century, the Hebrew Immigrant Aid Society has been at the forefront of helping Jews escape persecution, bringing them to the United States.\n\nHIAS's reach extended all over the world, but Russia (and the Soviet Union) were always the obvious target. Starting with the pogroms and the revolution, through the horrors of Stalin and beyond, HIAS was there, helping to get Jews out, helping to get them to America.\n\nAmong the people HIAS helped? Oh, the list is long, but you like your Google, don't you, so how about Sergey Brin? Nobel laureate Joseph Brodsky? Olympic champion Lenny Krayzelberg? Philosopher Hannah Arendt? Everyone's favorite actress Mila Kunis? Heck, today we'll even kvell over Henry Kissinger and Yakov Smirnoff! Of course, we've profiled them all, so let's anchor it with CBS anchor Bianna Golodryga, whose outspokenness in the wake of the massacre led to us writing this profile. HIAS helped Bianna escape the Soviet Union when she was just a year old.\n\nAnd these are just some of the names they helped directly. Just think of the numerous descendants of these Jewish refugees that helped shape America over the last century and will continue to do so! (Hopefully, beyond the horrors of today...)\n\nThank you, HIAS!",
  "pros": null,
  "cons": null,
  "score": 2610,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/b/bianna_golodryga.jpg",
  "created_at": "2025-03-29T13:17:29+02:00",
  "updated_at": "2025-03-29T13:17:29+02:00"
}