{
  "name": "Bilhah and Zilpah",
  "url": "http://jewornotjew.com/profile.jsp?ID=2056",
  "verdict": "Jew",
  "description": "How well do you know your Biblical stories? Say, the one of Jacob and his wives?\n\nOh, you know this one! Leah and Rachel, of course! The wonders of ancient polygamy!\n\nNot exactly. For you are forgetting Bilhah and Zilpah, Jacob's other two wives. And it gets weirder. And freakier. Just you wait.\n\nSo, yes, you remember the part where Jacob married the ugly Leah and the super-hot Rachel, and lived happily ever after in a sanctioned menage a trois. Leah started popping out kids left and right, four boys to be exact. Jacob must have been super happy!\n\nNot exactly. Jacob wanted the super-hot Rachel to have a kid. And for whatever reason, she just could not conceive. (Did they time her ovulation cycle? That's usually the place to start.) Thankfully, Rachel had a solution. If she couldn't have the child herself, she came up with the second best option: her handmaiden, Bilhah! Jacob was all too happy to oblige, and Bilhah popped out two more boys to bring the total to six.\n\nNot to be outdone, Leah had a handmaiden too: Zilpah. So then it was Zilpah's turn to shtup Jacob, and pop out two more boys (we are now at eight, still none from Rachel).\n\n(What makes the menage a cinq even freakier is that some commentators believe that Bilhah and Zilpah were Leah and Rachel's sisters. Let's just move on.)\n\nSo, eight boys in, it's... Leah's turn again! She gives Jacob two more, and then a girl to boot! (The poor girl is always forgotten. Dinah, if you are wondering.)\n\nWhat about Rachel, the hapless, unfortunate, super-hot Rachel?! Still without a child! Not to worry! There are some shenanigans with mandrakes (which also involve Jacob's first-born, Reuben; hold that thought), and Rachel finally gives birth! It's Joseph, child #12, son #11, Jacob's favorite. And then, for good measure, she finishes out the brood with Benjamin (those must have been some powerful mandrakes). So, for those keeping count: Leah 6 (+1 daughter), Bilhah 2, Zilpah 2, Rachel 2.\n\nNow back to Reuben. Turns out that he was also shtupping Bilhah... at best, his stepmother, at worst, his stepmother AND aunt.\n\nThe Bible, ladies and gentlemen! It's all in there!",
  "pros": null,
  "cons": null,
  "score": 2056,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/b/bilhah_and_zilpah.jpg",
  "created_at": "2025-03-29T13:17:15+02:00",
  "updated_at": "2025-03-29T13:17:15+02:00"
}