{
  "name": "Bob Kane",
  "url": "http://jewornotjew.com/profile.jsp?ID=486",
  "verdict": "Sadly, a Jew.",
  "description": "Some words, in the right context, can be dangerous. You should never say the \"c\" word around a woman. Never use the \"n\" word about someone who is black. Creative people have a word, too — the \"h\" word — and just like the examples above, you should be very careful before you use it.\n\nIf you've watched a Batman movie, you've probably seen \"Batman created by Bob Kane\" somewhere in the credits. This attribution, like Kane's anglicized name, is a tiny morsel of truth wrapped in a big steaming turd of falsehood. \n\nIn 1939, when Superman first appeared, Kane was known as a cartoonist of, at best, derivative ideas and minimal talent. He glommed on to the new trend, created a hero with red tights and a domino mask and named him Batman (some sources say Birdman). He then showed it to his sometime collaborator (and, yes, Jew) Bill Finger.\n\nAnd who is this Bill Finger, you ask? Oh, he's just the fellow who designed Batman's costume (the cowl, the cape, the color scheme), created his alter ego, and even invented Robin. In other words, Finger is the co-creator of Batman and just about anything you associate with the Dark Knight is Finger's, not Kane's.\n\nBut Kane never gave Finger proper credit and, to this day is incorrectly attributed as Batman's sole creator. Further, though Kane's name is all over Batman comics from the 1930s to the 1960s, the artwork was done by someone else (a \"ghost\") who would then sign Kane's name. Meanwhile Kane himself, just like Batman's nemesis the Joker (another Finger creation), was laughing all the way to the bank.\n\nWhen you get right down to it, Kane didn't really do anything except fight tooth and nail to make sure that he got everything. And that gives him special enmity in our eyes. \n\nThe \"h\" word is a dangerous thing to be throwing around. We of all people know full well to use such a weapon cautiously, sparingly. But in a case like this we have no problem saying it, repeating it, shouting it from the rooftops till the day we die:\n\nBob Kane is a hack.",
  "pros": null,
  "cons": null,
  "score": 486,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/b/bob_kane.jpg",
  "created_at": "2025-03-29T12:52:54+02:00",
  "updated_at": "2025-03-29T12:52:54+02:00"
}