{
  "name": "Boris Skossyreff",
  "url": "http://jewornotjew.com/profile.jsp?ID=2606",
  "verdict": "Not a Jew",
  "description": "We've yet to profile anyone from Andorra, which makes sense. The tiny nation, squished in the Pyrenees by Spain and France, population 77,000, is not exactly known for its Jews.\n\nStrangely, Andorra is a principality with two official rulers: Spain's Bishop of Urgell and the President of France. (Yes, France's democratically elected president somehow becomes a prince of another country. Weird.) This arrangement dates back all the way to the 13th century... with a few small breaks: two annexations, the French Revolution, and a couple of weeks in 1934. What makes 1934 special? For a brief time in July, Andorra had a king.\n\nAnd what a king he was! Boris I, Sovereign of Andorra and Defender of the Faith! He was really Boris Skossyreff, a Lithuanian-born Russian con artist who finagled his way to the throne. Somehow, he got the General Council of Andorra to vote for the monarchy, and got himself declared king.\n\nYou know what? As far as con artists go, we gotta tip our hat to him. Getting yourself named king in any country, regardless its relevance? Kudos, Boris I!\n\nUnfortunately for Boris, the Bishop of Urgell did not exactly like the development and sent the Spanish police into Andorra, putting a swift end to his rule. And get this: it was reported in Spain that Boris was a Jew! That doesn't seem to be the case; it was just your usual antisemitic propaganda.\n\nWhich is all rather interesting, but still doesn't give us a profile of an Andorran Jew... Unless, of course, you want to count the former President of France, the sort-of-Jewish Nicolas Sarkozy, who was, for a while, as explained above, an Andorran prince!",
  "pros": null,
  "cons": null,
  "score": 2606,
  "category": "Politics",
  "image_url": "http://jewornotjew.com/img/people/b/boris_skossyreff.jpg",
  "created_at": "2025-03-29T13:17:29+02:00",
  "updated_at": "2025-03-29T13:17:29+02:00"
}