{
  "name": "Brandon Tartikoff",
  "url": "http://jewornotjew.com/profile.jsp?ID=2676",
  "verdict": "Jew",
  "description": "Brandon Tartikoff is crediting with reinventing NBC's television lineup. In charge of the network for most of the 1980s, he was responsible for green-lighting such hits as \"Law \u0026 Order\", \"Family Ties\", \"Cheers\", \"The Cosby Show\" (AHEM), \"Miami Vice\", and \"The Fresh Prince of Bel-Air\". Heck, without Tartikoff we wouldn't have \"Seinfeld\" — he championed the revolutionary sitcom and kept it on the air through its initial low ratings.\n\nBut we will not talk about any of those highly-regarded series. We will talk about Brandon Tartikoff's first apperance IN FRONT of the camera — in a very very special episode of \"Saved by the Bell\".\n\nNow, there would be no SBTB without Tartikoff — the show's forerunner, \"Good Morning, Miss Bliss\" was based on Tartikoff's sixth grade teacher... Miss Bliss. Alas, she was left back in Indiana when, in one of the strangest developments in television history, Zack, Screech, and Lisa moved to California together with their school principal, and the rebranded \"Saved by the Bell\" was born.\n\nTartikoff's appearance comes at the end of the episode fantastically titled \"No Hope With Dope\". In it, a budding movie star named Johnny Dakota (a writer earned their paycheck with that name) visits the high school in order to film an anti-drug PSA. Zack, never the shy one, imposes himself on the actor, and the two become quick friends.\n\nHowever, it all comes crashing down when Johnny invites high schoolers to a party and offers pot to Kelly. (Oh, Kelly! As wonderful as you were, your choice in men was never the best, and we include Zack among them.) Appalled by the hypocricy (IT'S POT!), Zack kicks Johnny out of the school. This is when Mr. Belding calls on his old friend, \"NBC President Brandon Tartikoff\" (played by the real-life Tartikoff), to film a Johnny-less PSA.\n\n\n\n\nScene.",
  "pros": null,
  "cons": null,
  "score": 2676,
  "category": "Art",
  "image_url": "http://jewornotjew.com/img/people/b/brandon_tartikoff.jpg",
  "created_at": "2025-03-29T13:17:31+02:00",
  "updated_at": "2025-03-29T13:17:31+02:00"
}