{
  "name": "Brendan Leipsic",
  "url": "http://jewornotjew.com/profile.jsp?ID=3248",
  "verdict": "Jew",
  "description": "It's been a while since we profiled a hockey player... well, a recent hockey player, not that obscure Czech guy from the 1920s. So what about Brendan Leipsic, who was once named Winnipeg's Jewish Athlete of the Year at the tender age of 18? (It's a surprise that he hasn't continued to win the title every year since.)\n\nLeipsic bounced around the NHL for a while, playing for Toronto, Vegas, Vancouver, LA, and Washingtion. This year, he is lining up for that powerhouse, Metallurg Magnitogorsk. Wait, what the hell?\n\nYes, Leipsic is playing for Metallurg (The Fightin' Metals? The Mighty Magnets?) of Russia's Kontinental Hockey League. (Spelling is clearly not a top priority.) This makes him one of several dozens of North Americans hockey players who have chosen to make a living in Russia.\n\nWhat's a big deal, you ask? Surely, sports and politics don't mix! Alas, in Russia, they do. Oh, do they ever! From the early days of the Soviet Union, sport has been used to provide validation for Russia's supposed power and glory. It continues to this day, with Putin himself a big backer of St. Petersburg's KHL team, and various oligarchs playing along. And those North Americans? They are used as pawns in Russia's propaganda war. They are the \"good\" Americans (in Leipsic's case, Canadians).\n\nLeipsic should be allowed to make a living, you say! Well, he certainly does, and if he no longer good enough for the NHL, there are numerous leagues throughout the world that would love to have him: Sweden, Germany, Czechia... Russia is not the only option!\n\nEnjoy the wasteland of Magnitogorsk, Brendan, and be careful not be caught with some weed residue, okay?",
  "pros": null,
  "cons": null,
  "score": 3248,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/b/brendan_leipsic.jpg",
  "created_at": "2025-03-29T13:17:46+02:00",
  "updated_at": "2025-03-29T13:17:46+02:00"
}