{
  "name": "Brent Spiner",
  "url": "http://jewornotjew.com/profile.jsp?ID=1456",
  "verdict": "Jew",
  "description": "Captain Jean-Luc Picard leans back in his leather space-chair, drinking Earl Grey tea from his space-mug. The space-door hisses, revealing Commander Data.\n\nPicard: \"So, Mr. Data, what important lesson about humanity did you learn this episo... I mean, mission?\"\n\nData: \"Actually, Captain, I believe I have discovered an interesting quirk in my programming.\"\n\nPicard: \"Really, Data, that's *yawn* fascinating. Please go on.\"\n\nData: \"Well, Captain, as we were introducing education to the natives of Talosian IV...\"\n\nPicard: \"Actually, Mr. Data, we were educating the Talosians about introductions, but go on.\"\n\nData: \"Yes, well, in any case, I began to have strange... urges. Desires I cannot explain.\"\n\nPicard: \"For the last time, Mr. Data, no matter how much certain parts of this ship may look like sexual organs, I cannot permit you to defile them!\"\n\nData: \"No, Captain, I was referring to a sudden requirement that I only eat milk or meat. Never both. Further, I found I had a desperate need to cover my head at all times. And the song 'Hava Nagila' as performed by Yitzhak Perlman in 1967 has been playing ad nauseum in my internal speakers. Also, I have begun growing what I believe would be referred to as... peyas.\"\n\nPicard: \"Well, Mr. Data, I believe I have an answer for you. All of those behaviors are common to a lost race known only as 'The Jews.'\"\n\nData: \"I had reached the same conclusion myself, sir. Do you believe that I may, in fact, be Jewish?\"\n\nPicard: \"No, Mr. Data. I am afraid that you cannot be Jewish. This is the future. A utopia where people treat each other equally with love and respect and there are no Jews.\"\n\nData: \"But... but, sir. I cannot help but be convinced of the fact that some very basic part of me may very well be...\"\n\nPicard: \"No, Mr. Data. We can have any manner of creature both corporeal and non, with any range of beliefs, history, or peccadilloes. But we cannot, WILL NOT have Jews in this future. Do you understand?\n\nData: \"Well then, I suppose I shall have to comfort myself by going to hump the portside warp nacelle for a few hours.\"\n\nPicard: \"I swear, Kirk never had to deal with this shit...\"",
  "pros": null,
  "cons": null,
  "score": 1456,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/b/brent_spiner.jpg",
  "created_at": "2025-03-29T13:16:59+02:00",
  "updated_at": "2025-03-29T13:16:59+02:00"
}