{
  "name": "Brett Hull",
  "url": "http://jewornotjew.com/profile.jsp?ID=2495",
  "verdict": "Barely a Jew",
  "description": "Brett Hull's great-grandfather was named Jack Abromovitz. Fantastic!\n\nBefore we arrive at that conclusion, let's begin at the beginning, with Brett's father Bobby: one of the greatest goalscorers in hockey history, hall of famer, notorious SOB. Bobby, on a trip to Moscow, may or may not have said some things which may or may not have been misinterpreted in the Russian press. In short: \"Hitler, for example, had some good ideas.\"\n\nBobby's brother Dennis, an excellent hockey player in his own right, jumped to his sibling's defense, stating: \"His kids are half-Jewish, so, obviously, he's not going to say things like that.\" With us so far?\n\nSo, according to his brother (who should know these things), some of Bobby's kids (he has at least six) are half-Jewish. The problem is that Bobby has been married at least three times, plus had children from at least one more woman. For us to determine if Brett is part Jewish, we would have to figure out if uncle Dennis was referring to his mother, Joanne McKay. (Who Bobby beat. Antisemite or not, he was an SOB.)\n\nTurns out Joanne was no picnic either. When Bobby decided to move from the NHL to the WHA, she angrily screamed, \"Why would you ever want to live in Winnipeg and play for that fat Jew?\" (Ben Hatskin, the owner of the Winnipeg Jets.) Perhaps Bobby and Joanne deserved each other...\n\nSo color us surprised when we found out that Joanne's grandfather was definitely Jewish. Born Jack Abromovitz, he changed his name to Jack Abbott.\n\nSo, Brett Hull: one of the greatest goalscorers in hockey history, hall of famer, once owner of a notorious mullet, is 1/8 Jewish, antisemitic parents or not. Fantastic, isn't it?",
  "pros": null,
  "cons": null,
  "score": 2495,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/b/brett_hull.jpg",
  "created_at": "2025-03-29T13:17:26+02:00",
  "updated_at": "2025-03-29T13:17:26+02:00"
}