{
  "name": "Brittany Murphy",
  "url": "http://jewornotjew.com/profile.jsp?ID=702",
  "verdict": "Not a Jew",
  "description": "Here's a rule we haven't mentioned before: the Behind the Music Rule.\n\nYes, every now and again we add a new rule to our repertoire. The Berenstain Bears Rule (animals that aren't kosher can be Jewish because they don't eat each other), the Gargamel Rule (without definitive evidence, we can decide if someone's Jewish or not), and the Reverse Hype Rule (the more something is hyped, the more likely it is to suck, i.e. The Spirit from last year).\n\nFor those of you who were too busy squashing the Y2K bug (or have no idea what a Y2K bug is) to watch TV, Behind the Music was a show on VH1 about various rock bands and musicians. Without fail, in almost every case, these shows would be about people who had it all: money, fame, women (or men as the case may be), etc. And yet, by the third commercial break, these same people with \"everything\" would be depressed, angry, even suicidal.\n\nThus, the Behind the Music Rule: Money, fame, sports cars, Hawaiian homes — none of these things make you happy. You can have everything in the world and more, if you don't have happiness, it just doesn't matter.\n\nSometimes on these episodes from the early aughts, the musicians figure it out. They reconcile with their estranged father, go to rehab, get in a supportive relationship and put their lives back together. Sometimes they don't. Sometimes, like Brittany Murphy, they end up dead. It is a chilling reminder that the things we've been taught to value in this country really aren't that valuable. \n\nThe Behind the Music Rule, unlike a lot of our other rules isn't there to predict the future or tell us who might be Jewish (in this case, the rumor that Brittany had a Jewish grandparent turns out to be false). It is, instead, a cautionary tale for when we, ourselves, start to go a little bit off the tracks.\n\nMoney, fame, even life are sadly temporary things. But if you can't find happiness in your own life, sadness can last forever.",
  "pros": null,
  "cons": null,
  "score": 702,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/b/brittany_murphy.jpg",
  "created_at": "2025-03-29T12:52:59+02:00",
  "updated_at": "2025-03-29T12:52:59+02:00"
}