{
  "name": "Bud Selig",
  "url": "http://jewornotjew.com/profile.jsp?ID=1194",
  "verdict": "Sadly, a Jew.",
  "description": "Old school baseball fans really, truly despise current commissioner Bud Selig. He destroyed the differences between the American and National Leagues by abolishing the league presidencies and establishing interleague play. He completely neutered the regular season and turned the playoffs into a version of pitcher roulette so that you're almost guaranteed that the best team never wins the championship. He took everything good and unique about baseball and flushed it in favor of something that looks and smells like football or basketball, but tastes like three days old crap brulee.\n\nNew school baseball fans can't stand Bud Selig either. They see him as an old stick in the mud who is too busy \"preserving\" the game to allow it to be successful in a modern society, ensuring it'll be the next boxing or horse racing in 20 years. His insistence on staying with antiquated media restrictions combined with infinite pitching changes, and unlimited voluntary timeouts because they were allowed 80 years ago (before the Internet, before television, before indoor plumbing), continues to take the game that people love and make it a long, dragged out, unwatchable mess consigned to a century that also enjoyed games like \"pick up sticks\" and \"let's see who doesn't get cholera.\" Assuming the game isn't blacked out on your TV because the home team is based 500 miles from your house, that is. \n\nYoung baseball fans... Oh, there are no young baseball fans. So they don't know who Bud Selig is and seem unlikely to care in the near future. \n\nSo does anyone like Bud Selig? Well, Bud sure seems to like himself enough for all of us and he's the one in charge. So get ready for longer, later, less meaningful games not broadcast in a city near you for the foreseeable future! \n\nNo wonder soccer is on the rise...",
  "pros": null,
  "cons": [
    "No wonder soccer is on the rise..."
  ],
  "score": 1194,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/b/bud_selig.jpg",
  "created_at": "2025-03-29T13:16:53+02:00",
  "updated_at": "2025-03-29T13:16:53+02:00"
}