{
  "name": "Carla Bruni",
  "url": "http://jewornotjew.com/profile.jsp?ID=913",
  "verdict": "Sadly, Not a Jew.",
  "description": "How is this for a storybook marriage?\n\nTheir eyes met across the crowded room. He: a big-nosed, freshly-divorced, short Frenchman. She: a former model, a statuesque Italian with a string of rock-n-roll boyfriends. It wasn't exactly love at first sight. For her, at least.\n\nBut the Frenchman, being the persistent bugger that he is, persisted. And soon the Italian saw past the visuals and embraced her new lover. It wasn't that difficult at the end. Not when you are pursued by the President of France.\n\nNow, we're not concerned with the tabloid details of their relationship; we're concerned whether the relationship's principals are Jewish. Nicolas Sarkozy, as we already established, does have some Jewish roots. But what about his bride, the marvelous Carla Bruni? Here's where it gets fuzzy, and again not without tabloid headlines.\n\nBruni's paternal grandfather was an Italian Jew who married a Catholic and converted to Christianity during World War II (considering the time, it's somewhat understandable). So that should make the magnificent Carla a quarter Jewish, except...\n\nAccording to Carla, her father, composer Alberto Bruni Tedeschi, is not her biological parent. She is a product of a tryst between her mother and Brazilian grocery magnate Maurizio Remmert, which will likely make her not Jewish at all.\n\nCarla also says that she is \"easily bored with monogamy\", and now there are rumors of infidelity on both sides.\n\nSo much for a storybook marriage.",
  "pros": null,
  "cons": [
    "According to Carla, her father, composer Alberto Bruni Tedeschi, is not her biological parent. She is a product of a tryst between her mother and Brazilian grocery magnate Maurizio Remmert, which will likely make her not Jewish at all.",
    "So much for a storybook marriage."
  ],
  "score": 913,
  "category": "Politics",
  "image_url": "http://jewornotjew.com/img/people/c/carla_bruni.jpg",
  "created_at": "2025-03-29T12:53:05+02:00",
  "updated_at": "2025-03-29T12:53:05+02:00"
}