{
  "name": "Caspar Weinberger",
  "url": "http://jewornotjew.com/profile.jsp?ID=718",
  "verdict": "Barely a Jew",
  "description": "For those of you that think that Earth history begins sometime in 1996 (aka, the entire freaking Internet), Cap Weinberger was the Secretary of Defense under Ronald Reagan and played a fairly major part in the Iran Contra Scandal (either by outright assisting or by quietly disapproving, which, since he allowed it to happen either way, is sort of splitting hairs, isn't it?). \n\nWeinberger, despite his Jew-y last name, was raised Episcopalian. Here's where it gets interesting: his paternal grandparents were Jews, but — according to the ever-reliable Internets — they left the faith after an argument with their local temple.\n\nThat's — wow — that's just hard to picture. Certainly we've all had disagreements at our respective temples. Our own childhood shul once split in half over some divisive political maneuvering. But to leave Judaism entirely? That had to be SOME argument. \n\nLook, we can understand if you disagree with how they're cutting the challah or who gets to wear the fancy-looking yarmulkes and you decide you'd like to worship somewhere else. But to be so enraged that you throw off the faith entirely? Where in an argument do you get to, \"That's it! I'm done with your temple, and your G-d, AND your entire belief system!\"\n\nWe've been in some dumb arguments over the years (some of which we even started), so maybe we shouldn't be the ones to judge. But if you ever get so mad you're ready to light your entire culture on fire, do us a favor: leave the argument. Maybe take a few days to sleep on it. Anything that rash really needs to done with a clear head.\n\nIt'll save you some regrets later in life. Trust us.",
  "pros": null,
  "cons": null,
  "score": 718,
  "category": "Politics",
  "image_url": "http://jewornotjew.com/img/people/c/caspar_weinberger.jpg",
  "created_at": "2025-03-29T12:53:00+02:00",
  "updated_at": "2025-03-29T12:53:00+02:00"
}