{
  "name": "Catherine Oxenberg",
  "url": "http://jewornotjew.com/profile.jsp?ID=978",
  "verdict": "Borderline Jew.",
  "description": "You gotta give to the British. No matter how silly the idea of the monarchy might seem, they keep going and going at it.\n\nTake succession to the throne. After all that thorny business with  James II and what not, the British got it down to a science.\n\nThere is a list, a list with thousands of names on it. First on the list is Prince Charles. So if Queen Elizabeth dies, Charles will inherit the crown (he's still waiting and waiting). Prince William follows Charles. Prince Henry follows William. The Duke of York... Etc, etc, etc, etc, etc. It just keeps on going. And going. And going. And going.\n\nSo who is on that list? Well, descendants of Sophia of Hanover, who, although never a monarch herself, lucked out (posthumously) on being the matriarch of the British crown. So not only do you get various British royalty, but also European offspring of no-longer existing crowns and countries that are resigned to history books.\n\nBut no Catholics. Oh, no Catholics. So it doesn't matter if Sophia of Hanover was your favorite great-grandmother, if you ever were a Catholic, or became a Catholic, or married a Catholic, or danced with a Catholic, or roomed with a Catholic in college, you and all your descendants are out.\n\nSo, Catholics: bad. Jews, surprisingly: good. Go figure. So, if you go down and down on the list, somewhere in the 3000s, you will find actress Catherine Oxenberg, best known as Amanda Carrington on that 80s classic \"Dynasty\". Catherine's mother was Princess Elizabeth of Yugoslavia (a non-existing crown of a non-existing country), descendant of various Serb, Greek, and Russian blue bloods. He father? Howard Oxenberg. A Jewish dressmaker.\n\nThat's right, baby! So all we need now is for a few thousand people to mysteriously die off and....  Y'know what? Forget we said anything.",
  "pros": null,
  "cons": null,
  "score": 978,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/c/catherine_oxenberg.jpg",
  "created_at": "2025-03-29T12:53:06+02:00",
  "updated_at": "2025-03-29T12:53:06+02:00"
}