{
  "name": "Charles Steinmetz",
  "url": "http://jewornotjew.com/profile.jsp?ID=2063",
  "verdict": "Sadly, Not a Jew.",
  "description": "The picture you see above shows the meeting of the two of the greatest scientific minds of the 20th century — nay, of all time. It depicts the visit of Albert Einstein to the Marconi Wireless Station in Somerset, New Jersey.\n\n\n\n\n\np = document.getElementById(\"photo\");\nd = document.getElementById(\"desc\");\nb = document.getElementById(\"but\");\nvar t = new Array(\n\"Before we get to the geniuses, the man standing fourth from the left is none other than David Sarnoff. As previously profiled, he is the man most responsible for the early development of radio and television in America.\",\n\"And, yes, here is Einstein, looking dapper in a wide-brimmed hat. Yet it is a man on his left (our right) that is the source of much confusion. For years, many have thought that is Nikola Tesla (Not a Jew, please stop asking). In fact, many have called this photo, ''Einstein meets Tesla''.\",\n\"That turns out to be not true. The man depicted here is John Carson, an engineer for AT\u0026T. While a radio pioneer in his own right, we wouldn't put him in the same league as Einstein. And yet, there is another genius in this photo.\",\n\"Yes! This little man! Charles Proteus Steinmetz, the ''Wizard of Schenectady''. It was him that Einstein was visiting in Somerset. What's Steinmetz responsible for? Only the development of alternating current, which kinda made this whole electricity thingamajig happen.\",\n\"Jew? Unlikely. Often reported as Jewish, he was actually baptized as a Lutheran. We can't have every genius... (See also: Tesla.)\");\nx = 1;\nb.disabled = false;\nfunction showNext() {\n x++;\n if (x != 6) p.src = \"img/other/cs/cs\"+x+\".jpg\";\n d.innerHTML = t[x-2];\n if (x == 6) b.disabled = true;\n}",
  "pros": null,
  "cons": null,
  "score": 2063,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/c/charles_steinmetz.jpg",
  "created_at": "2025-03-29T13:17:15+02:00",
  "updated_at": "2025-03-29T13:17:15+02:00"
}