{
  "name": "Charl Schwartzel",
  "url": "http://jewornotjew.com/profile.jsp?ID=1038",
  "verdict": "Not a Jew",
  "description": "In the mid-to-late 1930s and early 1940s when things were getting really bad in Europe for the Jews there was a kind of a mini-diaspora. As you probably know, few made it out. Those that did, went to America. America! Home of the free! Land of opportunity! Where the streets were paved with cheese, er, gold!\n\nAmerica said no thanks.\n\nThis was from a combination of factors, not the least of which was the FDR-approved (though not FDR-originated), pro-Nazi immigration policy at the time. What happened to those who were turned away? Some were sent right back to the gas chambers, sadly. But a lot ended up in all sorts of whackadoo places. There's a large Jewish community in Curacao. Costa Rica is so Jewish, at one point their vice president was a member of the tribe. And, hard as this is to believe, there is a very large Jewish community based in South Africa.\n\nWhich is a really (really) long way of saying that, no, it is not at all ludicrous to glance at this year's Master's champ, Tiger-killer, and South African Charl Schwartzel and think he might be Jewish.\n\nMore than a glance gives the full story. For one, you know how many professional Jewish golfers there are? Yeah, exactly. Country clubs::Jews as Rational, Intelligent Consideration::Arizonians. For second, Schwartzel is listed as Jewish all over the nowhere, and as we've learned by now, if he was Jewish, it would have been all over the Internews a long, long time ago. \n\nRather, he just has an interesting last name. And a green jacket. And we have a neat-o history/geography lesson. So everybody wins. Except Tiger Woods. But nobody really feels bad for him do they?",
  "pros": null,
  "cons": null,
  "score": 1038,
  "category": "Art",
  "image_url": "http://jewornotjew.com/img/people/c/charl_schwartzel.jpg",
  "created_at": "2025-03-29T13:16:49+02:00",
  "updated_at": "2025-03-29T13:16:49+02:00"
}