{
  "name": "Charley Steiner",
  "url": "http://jewornotjew.com/profile.jsp?ID=1119",
  "verdict": "Jew",
  "description": "In another lifeline, some of us moonlight as sports bloggers. So we recently received a copy of \"Those Guys Have All the Fun\", the oral history of ESPN. Presumably, we were supposed to review the tome in our other publication, but the subject matter did not exactly mesh. So here we are, discussing the book here. It's the least we could do.\n\n\"Those Guys Have All the Fun\" will always draw comparisons to the other oral history from James Miller and Tom Shales, \"Live from New York: An Uncensored History of Saturday Night Live\". Unfortunately, while the latter is a lively romp, \"Those Guys\" is a 700-page bore in dire need of an editor.\n\nAnd we're not just talking about passages that are repeated word-for-word. We're talking about pages and pages of minutia that are of little interest to the general reader. We might not be the exact target audience, but we did spend a large chunk of the last 20 years watching ESPN. Many of the talking heads in the book went right over our head. Who is this? And this is interesting... why?\n\nMiller and Shales often fail to put the situation into context; the talking head might reference an incident that they assume to be common knowledge, but one that is lost on the reader who is not entirely plugged in to the world of ESPN. There are some interesting passages, don't get us wrong, especially on the Dan Patrick / Keith Olbermann era, but those are far and between. And while a the whole journey from humble beginnings as a Connecticut cable station to the \"worldwide leader in sports\" could have been fascinating, \"Those Guys\" traps it in a cacophony of monotonous voices.\n\nBut at least it confirmed that Charley Steiner is Jewish.",
  "pros": null,
  "cons": null,
  "score": 1119,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/c/charley_steiner.jpg",
  "created_at": "2025-03-29T13:16:51+02:00",
  "updated_at": "2025-03-29T13:16:51+02:00"
}