{
  "name": "Charles Bronfman",
  "url": "http://jewornotjew.com/profile.jsp?ID=1884",
  "verdict": "Jew",
  "description": "While Seagram — maker of fine beverages, both alcoholic and non — was invented by someone else (some guy named Seagram, apparently), it was Samuel Bronfman (Jew. Also, probably bootlegger) who bought the company in the 1920s, and it was under Bronfman that the brand became successful.\n\nWhen Samuel died, he passed the company down to his son, Edgar, and when Edgar died he passed Seagram down to his sons, Edgar Jr. (A Jewish junior, no less!) and Charles.\n\nAt this point, Seagram, flush with a surplus of cash and bad ideas, began to diversify. They investing in DuPont, Universal Pictures, and... the Montreal Expos. Charles Bronfman bought the team as an expansion franchise in 1968.\n\nUnder Bronfman, the 'Spos had highs and lows. Charles ran the Expos like a drink company, rather than a sports franchise. As Montreal dropped into mediocrity, Bronfman began bringing in his beverage people to run the team (notably Claude Brochu) who had no sports management experience.  Things went downhill, predictably.\n\nBronfman sold the Expos in 1990 when things began heading south (literally. The franchise decamped for Puerto Rico for a time before settling in Washington D.C. as the Nationals). Seagram's fate was no better — the company's assets were broken up and sold piecemeal. Poor Charles was left with the legacy of destroying the family business with only millions and millions of dollars to keep him company.\n\nThe good news is, the lesson was learned. No one would ever be stupid enough to just give a drink company a professional sports franchise and promote a bunch of middle managers with no sports experience to run the team. \n\nNope. Never ever.",
  "pros": null,
  "cons": null,
  "score": 1884,
  "category": "Business",
  "image_url": "http://jewornotjew.com/img/people/c/charles_bronfman.jpg",
  "created_at": "2025-03-29T13:17:10+02:00",
  "updated_at": "2025-03-29T13:17:10+02:00"
}