{
  "name": "Charlotte York",
  "url": "http://jewornotjew.com/profile.jsp?ID=886",
  "verdict": "Jew",
  "description": "OK, so we got a suggestion from one of our fine readers that we ought to profile Charlotte York, the brunette from Sex and the City who was quite WASP-y in the early going but ended up converting for her Jewish husband. Good call. Good suggestion. Gotta write it up. \n\nOne problem: Nobody here at the Hall of Judaism watched Sex and the City. Like, ever. It's not a judgment of the show, it's just... well... it's dude city over here and how the heck are we supposed to write about Charlotte York when it took us six hours of googling just to figure out who she is?\n\nSo we needed to get in touch with our feminine sides. We started by lighting some scented candles and drawing a nice warm bath. After an incident with the laptop, we returned from the hospital and settled in for a long soak. Ah yes, we could totally see the attraction of this. Inner woman here we..... zzzzzzzzzzzzzzzzzzz\n\nSo that was a failure. What else could we do? Hmmmm. How about shopping? Specifically, shoe shopping! Oh, Carrie would SO approve (not that we would know about any of that or anything). Being in Jersey we went to that mecca of all things strappy: the Short Hills Mall. Except we got lost and ended up in Livingston. At the Gamestop. Well, we did end up spending $600. But Carrie would so NOT approve.\n\nSigh. Chick flicks just made us angry at the men in the movie. Dinner with our \"girlfriends\" ended in a fight with our wives. Going wine tasting landed us right back in the hospital, only now our cars were in the impound lot as well....\n\nAnd that's when we made our decision: fuck it. And so we went off to write about baseball players and comic book heroes instead.",
  "pros": null,
  "cons": null,
  "score": 886,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/c/charlotte_york.jpg",
  "created_at": "2025-03-29T12:53:04+02:00",
  "updated_at": "2025-03-29T12:53:04+02:00"
}