{
  "name": "Chelsea Clinton",
  "url": "http://jewornotjew.com/profile.jsp?ID=860",
  "verdict": "Not a Jew",
  "description": "Upsate New York town, Christmas Eve, 202X. A mansion is covered in Christmas lights. A menorah is visible through the living room window. A black limousine pulls up. A man exits it. He rings the doorbell.\n\nChelsea: Now who can that be? Marc, can you get the door, please?\n\nMarc: Sure, honey.\n\nMarc opens the front door. A man walks in.\n\nBill: Family, I'm here!\n\nMarc: Hello, Mr. President.\n\nBill: Marky Mark, I told you one thousand times. Call me Bill.\n\nMarc: Hello... Bill. Merry Christmas...\n\nBill: Same to you, Marky Mark. Now where's that daughter of mine?\n\nChelsea runs into the foyer from the kitchen. She's wearing an apron, her hair is disheveled.\n\nChelsea: Dad! Do you know what time it is?\n\nBill: Glad to see you too, pumpkin.\n\nChelsea: Dad! It's 1 PM!\n\nBill: Really? (looks at watch) Oh, so it is. Well... I am a bit early, so what?\n\nChelsea: Dad! You're eight hours early!\n\nBill: Eight hours here, eight hours there. Women! Can't live with them, can't live... Right, Marky Mark?\n\nMarc: Can I take your coat, Mr. Pre... Bill?\n\nBill takes off his coat and give it to Marc. He hangs it up in the wardrobe.\n\nChelsea: So, dad, is Laura coming?\n\nBill: Laura?\n\nChelsea: That's her name, isn't it?\n\nBill: Laura... Laura... Are you sure you mean Laura?\n\nMarc: (to Chelsea) It's Jessica, honey.\n\nBill: Jessica! Oh, I remember Laura. No, pumpkin, Laura is not coming. And neither is Jessica... Your dad is all alone this year...\n\nChelsea: Marc, can I talk to you for a second?\n\nMarc and Chelsea walk into the kitchen.\n\nChelsea: Marc, what do we do about him?\n\nMarc: He's your father, honey...\n\nChelsea: Marc, it's 1 PM! I have a turkey in the oven, Sam needs to be picked up at the temple, and the table doesn't set itself!\n\nMarc sighs. He walks back to the living room, where Bill is sprawled on the couch. He is snoring loudly.\n\n* * *\n\nFour hours later. The kitchen table is set, with the menorah as its centerpiece. Chelsea, Marc, and Bill sit at the table. Bill's suit is crumpled. Chelsea has changed her clothes, her hair is now styled neatly.\n\nBill: Pass the ketchup, pumpkin?\n\nChelsea: Dad! Can you please wait for Sam?\n\nBill: Sure thing, pumpkin.\n\nBill looks around the room, trying to find something to grab his attention. He lifts up the tablecloth and knocks on the table.\n\nBill: Nice table. Oak?\n\nMarc: Yes, I think it's oak.\n\nBill: Can't go wrong with oak.\n\nA boy descends down the stairs. He's wearing a yarmulke. Bill jumps from his seat.\n\nBill: Sam!\n\nBill and Sam hug.\n\nSam: Hi, grandpa.\n\nSam sits down at the dinner table, across from Bill.\n\nMarc: Sam, would you like to do the honors?\n\nSam stands up and takes out a matchbook. He lights the candles.\n\nSam: Barukh ata...\n\nBill: What's with the hat, Sam?\n\nChelsea: Dad!\n\nSam: It's a yarmulke, grandpa.\n\nBill: Yeah, I know it's a yarmulke.\n\nSam: I'm studying for my bar mitzvah, and Rabbi Tuchman said it might be a good idea to wear it at home.\n\nBill: And you listen to everything he says?\n\nSam: She, grandpa.\n\nBill: She! (to Marc) Your people have always been a progressive bunch.\n\nChelsea: Dad!\n\nBill: Oh pumpkin, come on. You know I don't mean anything by it. I love Jews. Do you remember...\n\nChelsea: DAD! I ASKED YOU A THOUSAND TIMES! NOT IN FRONT OF SAM!\n\nMarc: Honey...\n\nChelsea: Don't you honey me, Jewboy!\n\nMarc: Jewboy?\n\nChelsea: (crying) This... all this... it's because of you... I love you! I tried to make it work! Hanukkah, Hebrew school, bar mitzvah! It's too much!\n\nMarc: Honey...\n\nBill gets up from his chair and hugs Chelsea.\n\nBill: Pumpkin, please don't cry... It hurts me so much to see you this way... (to Marc) pour her a glass of that Manischewitz, Marky Mark.\n\nMarc pours a glass of red wine and gives it to Chelsea. She drinks it down in one gulp.\n\nBill: Isn't that better, pumpkin?\n\nChelsea: Yes, daddy. Thank you.\n\nBill: That Marky Mark, he's a good guy, pumpkin. And you're a good woman for standing by your man. Your mother, on the other hand...\n\nChelsea: (with a smile) Dad!\n\nThe doorbell rings.\n\nBill: (to himself) Speaking of the devil...\n\nThe family makes its way to the foyer. Chelsea opens the front door. A woman enters. There is another person standing behind her.\n\nChelsea: Hi, mom!\n\nSam: Grandma!\n\nMarc: Hello, Ms. Rodham.\n\nBill: Hillary.\n\nHillary kisses Chelsea on both cheeks and Sam on the forehead. She shakes Marc's hand and glances at Bill.\n\nHillary: Merry Christmas, everyone! So great to see you... all.\n\nChelsea: Come in, mom, come in. And I see you brought a guest?\n\nHillary: Yes, yes, I have. Everyone, this is... Joan.",
  "pros": null,
  "cons": null,
  "score": 860,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/c/chelsea_clinton.jpg",
  "created_at": "2025-03-29T12:53:03+02:00",
  "updated_at": "2025-03-29T12:53:03+02:00"
}