{
  "name": "Chris Pine",
  "url": "http://jewornotjew.com/profile.jsp?ID=744",
  "verdict": "Barely a Jew",
  "description": "Some of us here at JONJ used to be really big Star Trek fans. Why 'used to be'?\n\nIt wasn't because the shows got progressively worse (though they did) or that the movies became unwatchable (though they were). It wasn't because we preferred the bright colors and fully haired captains of the 60s to the bald and the drab of today (well, the 1990s anyway). \n\nNo, it was something that occurred rather suddenly really, mostly due to two factors.\n\n1. A remarkably creepy freshman year roommate.\n\n2. The lack of Jews.\n\nThe roommate requires more explanation than we're willing to give. And we admit the Jews thing seems a little random. But you see, in the original series there were dynamic, exciting, top of the line Jews — Nimoy and Shatner (aka, Kirk and Spock for those of you who were too busy getting laid in high school to enjoy high quality science fiction television). And that made us feel comfortable in our own, nerdy Jewish-ness. We didn't have to be dorks all our lives — we could be grand heroes full of vim and vigor and all the necessary je ne se quois to save the universe and get the girl.\n\nAnd then there were none.\n\nFitting then, perhaps, that the first time we liked a new Star Trek adventure was the recent film, which happened to up the Jew Quotient (JQ?) quite a bit. Chekhov is played by the previously profiled Anton Yelchin. Winona Ryder cameos as Spock's mother. And wouldn't you know it, the new Captain Kirk himself, Chris Pine, is of Jewish descent (on his mother's side). \n\nIt's almost enough to get us all giddy about Star Trek again. Y'know, barring any encounters with bizarre, tighty-whitey-and-nothing-else wearing, Klingon speaking roommates.",
  "pros": null,
  "cons": null,
  "score": 744,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/c/chris_pine.jpg",
  "created_at": "2025-03-29T12:53:00+02:00",
  "updated_at": "2025-03-29T12:53:00+02:00"
}