{
  "name": "Chunk Cohen",
  "url": "http://jewornotjew.com/profile.jsp?ID=1066",
  "verdict": "Sadly, a Jew.",
  "description": "It's been pointed out by several readers that our qualifications for what makes a good Jew are a little bit... skewed. After all, we don't weigh how religious the person is or how holy or learned in sacred Torah. Our values tend more toward the aesthetic. So with that in mind, is Chunk Cohen from \"The Goonies\" the worst Jew ever?\n\nWorse than fellow fictional Jewish nerds? Oh, it's not even close. Other movie/TV nerds are secretly goodhearted. Or their intelligence wins the day. Or they meet a nerdy girl. They are good folk.\n \nChunk is beyond worthless: fat, greedy, stupid, conniving, ugly, clumsy, perverted, he is the rare amalgamation of everything awful ever said about Jews plus a few new ones thrown in just for the heck of it. Disgusting on every level.\n\nWorse than real life Jewish villains like Ike Turner? Yeah, sad but true. Ike's behavior, reprehensible though it was, is just one part of his career. Now, you can argue that his domestic violence overwhelms his musical contributions (and we did), but they don't erase them.\n\nChunk's only redeeming moment is befriending Sloth (who, let's be clear, is only uglier than Chunk on the outside) by utilizing a third-rate candy bar most famous for resembling a doody when submerged (see \"Caddyshack\", 1980). So yeah, no. Chunk's worse.\n\nWorse than Hitler?! OK, nobody is worse than Hitler. No one. It's so overused and cliche and so let's be clear that Hitler is just the worst ever. But if we had to pick someone who could be worse than Hitler...\n\nWell, anyway, we said quite clearly Hitler wasn't Jewish. And this is to determine if Chunk Cohen is the worst Jew ever. So the comparison doesn't count and thus we consider this matter closed.",
  "pros": null,
  "cons": [
    "ider this matter closed."
  ],
  "score": 1066,
  "category": "Religion",
  "image_url": "http://jewornotjew.com/img/people/c/chunk_cohen.jpg",
  "created_at": "2025-03-29T13:16:49+02:00",
  "updated_at": "2025-03-29T13:16:49+02:00"
}