{
  "name": "Clare Jacobs",
  "url": "http://jewornotjew.com/profile.jsp?ID=3530",
  "verdict": "Not a Jew",
  "description": "In a profile written during the 2008 Olympics (boy, does time fly!), we wrote the following about the pole vault:\n\n\"But running as fast as you can holding a large metal stick and then using it to catapult yourself as high as you can? What kind of meshuggenah goy thought up that one?\"\n\nOh, Jew or Not Jew of 16 years ago... Little did you know... Little did you know.\n\nThe pole vault as we know it today, as meshuggenah as it seems, did not start out this way. From the mid-19th century and into the early modern Olympics, what came to known as the \"pole vault\" was also called the \"pole jump\". And the pole jump was... well, a doozy.\n\nA pole was planted into the ground with an iron tripod, next to a high bar. Athletes had to climb that pole as high as they could. Your eyes are not deceiving you: they CLIMBED the pole. As they got higher, the pole would start to wobble. By the time the swinging got too much, the athletes had to lift their knees, release the pole, and get over the bar. This was the pole vault. Well, the pole jump.\n\nThe last time this was allowed in the Olympics was 1908, when there was a lot of controversy about the event. Americans complained that there was nothing to break the fall — no sandpit, no straw... Does this mean that the athletes had to climb the pole, then fall 12 feet (three and a half meters) onto a hard floor? Talk about meshuggenah!\n\nIn those 1908 Olympics, two vaulters-jumpers tied for first, and three tied for third, but the organizers decided to to have a vault-off, and awarded five medals. One of those bronze winners was American Clare Jacobs, who often gets cited as Jewish, but did not seem to be. (A Jewish man named Clare? We're not that meshuggenah...)\n\nSo what meshuggenah goy came up with the pole jump?\n\nThe Germans, natch.",
  "pros": null,
  "cons": null,
  "score": 3530,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/c/clare_jacobs.jpg",
  "created_at": "2025-03-29T13:17:53+02:00",
  "updated_at": "2025-03-29T13:17:53+02:00"
}