{
  "name": "Cole Hauser",
  "url": "http://jewornotjew.com/profile.jsp?ID=1026",
  "verdict": "Jew",
  "description": "Let's talk about the most vital Jewish movie from our youth. No, obviously not \"A Stranger Among Us\". No, not \"Yentl\", duh. We're talking about \"School Ties\".\n\nFor those who haven't seen it... where the hell have you been? Drive down to the video store... wait, there are no more video stores. Queue it up on Netflix, find it On Demand, illegally download it off the web, it doesn't matter. Watch it. Immediately. It's that good.\n\nSo here are the basics: a prestigious prep school in Massachusetts recruits a quarterback to help their football team. One small problem: the quarterback, David Greene, is Jewish.\n\nGreene is played by Brendan Fraser (not a Jew, as previously discussed. But it's actually correct casting: the Jew must be able to pass for a goy for the film to work). In school, he befriends a number of goyim, leads the team to a big football win, before all hell breaks loose. But we're not gonna spoil it further. Just watch the damn movie.\n\nWhat makes it stand out, other than the terrific story and its obvious Jewishness, is the stable of then-unknown actors who would go on to make it big. You have Fraser. You have Chris O'Donnell, who, although pretty much in the gutter now, broke through soon after with \"Scent of the Woman\". There's Matt Damon, in his first major role. There's Ben Affleck, deemed so unimportant that he's credited 14th.\n\nAnd then there are Cole Hauser and Randall Batinkoff, both with key roles in the movie. But here's the thing: while the quartet mentioned above can all claim time on Hollywood's A-List, Hauser and Batinkoff? Not even close. Hauser at least has some sort of a career, with a role in Damon and Affleck's \"Good Will Hunting\" and a steady, if not spectacular, string of Hollywood work. Batinkoff? He pretty much has dropped off the face of the earth.\n\nAnd, strangely, after starring in such a Jewish movie, it's the goyim that have all the success. Fraser, O'Donnell, Damon, Affleck: goy, goy, goy, goy. Hauser and Batinkoff: Jew, Jew. (Hauser is half, but self-identifies, so good enough for us.) So why on earth did it work out like that?\n\nWe might just have to watch the movie again to try to figure this out. No, seriously. It's that good.",
  "pros": null,
  "cons": null,
  "score": 1026,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/c/cole_hauser.jpg",
  "created_at": "2025-03-29T13:16:48+02:00",
  "updated_at": "2025-03-29T13:16:48+02:00"
}