{
  "name": "Colin Kaepernick",
  "url": "http://jewornotjew.com/profile.jsp?ID=1514",
  "verdict": "Not a Jew",
  "description": "(Editor's update: This profile was written on the eve of Super Bowl XLVII, in 2013, when Colin Kaepernick was just a football player. It was a simpler time. Since then, he took a stance against police brutality and was ostracized from the NFL for doing so. Shame on you, NFL.)\n\nLet us guess. You were watching the game, and your mind started to trail. Maybe the game got boring. Maybe the chips got stale. Maybe the rube sitting next to you couldn't shut up about his fantasy team. Maybe the blonde across the room, the one you've been trying to make eye contact with the whole night, approached that rube instead. So you started wondering, what's the deal with Colin Kaepernick? That's a rather hard-to-pronounce name, isn't it? Could he possibly be... Jewish?\n\nSo you took out your phone, googled \"Colin Kaepernick Jewish\" and — voila! — you are here. Welcome! Enjoy your stay.\n\nWe're Jew or Not Jew, the website dedicated to figuring out if various celebrities, historical figures, and even fictional characters are Jewish. It's a good time. Our database has over 1500 profiles of everyone ranging from Marilyn Monroe (Jew) to Abraham Lincoln (Sadly, Not a Jew) to George Costanza (you'll have to read to find out!). Various sports figures are here as well. For example, Kaepernick is not the first Super Bowl quarterback whose possible Jewishness has been pondered. Take a look at the links below. Click on Ben Roethlisberger... Read on!\n\nSo, yes, Kaepernick. Honestly, we don't see how anyone could possibly think he is Jewish. The long last name is not Jewy at all. His skin tone is not exactly prominent in Jews (although you HAVE TO read the profile of Yaphet Kotto!). His adopted parents are goyishe Germans, and his biological ancestry includes goyishe Czech. Finally, he has tattoos of Bible verses. Yeah, he's not a Jew. Not even close.\n\nSo, now that you know that, you can go back to watching the game. Or maybe try to talk to that blonde. Or, you know, stay a while. Don't you want to find out if Harrison Ford and Scarlett Johansson are Jewish? Of course, you do!",
  "pros": null,
  "cons": null,
  "score": 1514,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/c/colin_kaepernick.jpg",
  "created_at": "2025-03-29T13:17:01+02:00",
  "updated_at": "2025-03-29T13:17:01+02:00"
}