{
  "name": "Count of St. Germain",
  "url": "http://jewornotjew.com/profile.jsp?ID=915",
  "verdict": "Not a Jew",
  "description": "Mademoiselle de la Collete waved to the Marquise de Contrabas across the crowded room. The older woman patiently waited for the mademoiselle's skirts to traverse the floor.\n\n\"Hello, darling,\" said the marquise, gallantly tilting her hand fan.\n\n\"Good evening, marquise,\" curtsied de la Collete. \"Have you heard?\"\n\n\"Have I heard what?\" The marquise quizzically looked at her protege.\n\n\"He is going to be here!\"\n\n\"You're gonna have to explain yourself, darling.\"\n\n\"The Count! The Count of Saint Germain!\"\n\n\"Fi!\", sniffed the marquise. \"That charlatan!\"\n\n\"Oh, no, marquise, quite the contrary.\"\n\n\"You don't say. Walk with me, darling.\" The marquise offered her elbow to the young woman.\n\n\"He is a great adventurer,\" proclaimed de la Collette, as the two exited the palace and entered the garden.\n\n\"A great pretender is more like it,\" replied the marquise.\n\n\"He is an inventor.\"\n\n\"Perhaps an alchemist.\"\n\n\"He is ageless.\"\n\n\"Don't be fooled by the cosmetics, darling.\"\n\n\"He is the son of the King of Portugal!\"\n\nMarquise de Contrabas stopped in her tracks.\n\n\"Is that so, darling? Is that what you've heard?\"\n\n\"Yes, marquise. It comes from the most reputable of sources.\"\n\n\"The same sources that just last week said that he is a Transylvanian prince?\"\n\n\"Well, no, I'm sure those sources were mistaken...\"\n\n\"The same sources that claimed he was Portuguese, alright... a Portuguese Jew?\"\n\n\"That surely can't be true, marquise!\"\n\n\"Look, darling.\" The marquise's long finger gently pushed up on de la Collette's chin. \"The Count is many things. But if I were you, I'd stay away.\"\n\n\"Marquise...\"\n\n\"Stay. Away.\"\n\n\"Yes, marquise.\"\n\nIn silence, the marquise took de la Collette's hand and walked her back into the palace. As they entered, a murmur swept through the audience.\n\nThe Count of Saint Germain had arrived.",
  "pros": null,
  "cons": null,
  "score": 915,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/c/count_of_st__germain.jpg",
  "created_at": "2025-03-29T12:53:05+02:00",
  "updated_at": "2025-03-29T12:53:05+02:00"
}