{
  "name": "Crazy Eddie",
  "url": "http://jewornotjew.com/profile.jsp?ID=660",
  "verdict": "Sadly, a Jew.",
  "description": "If you grew up in the tri-state area (New York, New Jersey, Connecticut, all others need not apply) in the late 1970s and early 80s, then you know Crazy Eddie from his meshuggenah television and radio ads: running around like he was having some sort of stroke and screaming about low (crazy low, some might say) prices for electronics goods. \n\nOf course, the fellow we all remember from those ads was just an actor (radio personality Jerry Carroll, actually. Not a Jew). But the man whose name adorned the sign was real enough, a Syrian Jew, Eddie Antar, really referred to as Crazy Eddie.\n\nUnfortunately, though Eddie's prices might have been a steal, he was doing more than a little stealing himself. After years of dirty dealings, the SEC indicted the entire Antar family in 1989 for a laundry list of embezzlements and securities frauds.\n\nHere's the fun part: \n\nTo avoid prosecution, Eddie fled to Israel and changed his name to David Jacob Levi Cohen (aka, JEW!!!!). Now that's inssssSSSSSSSSSAAAAAAAAAAAAAAANE! \n\nIt was also not that great of an idea. (For future reference, if you're going to flee the country, try not to go to a place that has an extradition treaty. Especially one that's as tight with the Stars and Stripes as Israel is.) Eddie was picked up in Tel Aviv and convicted soon afterward.\n\nEddie has since served his time (white collar crime, FTW!) and has tried to restart his Crazy Eddie chain but as of this writing it seems to have fallen by the wayside. Sort of like our love for Crazy Eddie, himself. If we were writing this site in 1979 (which would have been quite a feat, since y'know, no Internet) we would have been pretty excited to have Crazy Eddie as a Jew. Nowadays though, we just don't have a lot of heart for money-grubbing criminals who use their Judaism to try to escape from their misdeeds.\n\nSeriously, why does it always have to be Jews and money? Can't we just murder people like everyone else?\n\nfunction loadPic(x) {\nsetImage('crazy_eddie'+x);\n}",
  "pros": null,
  "cons": null,
  "score": 660,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/c/crazy_eddie.jpg",
  "created_at": "2025-03-29T12:52:58+02:00",
  "updated_at": "2025-03-29T12:52:58+02:00"
}