{
  "name": "Cristina Yang",
  "url": "http://jewornotjew.com/profile.jsp?ID=808",
  "verdict": "Jew",
  "description": "Some shows do some crazy things to get themselves in line with the James Wilson Law. Remember, that's the law that says all ensemble TV shows MUST have a Jewish member or the entire fictional universe will collapse upon itself. Or something.\n\nIn any case, when they applied the law in Grey's Anatomy, they found themselves in quite the kosher pickle. The show began with five main characters: Meredith the whiny lead, Izzy the whiny hot blonde, Cristina the whiny smart one, George the whiny male (in the hopes that someone with less estrogen than a pregnant elephant on fertility drugs might actually watch), and everyone's favorite Dr. McDreamy who wasn't at all whiny, which means he probably wandered onto the set from another show or something.\n\nSo — the James Wilson Law being what it is — they needed a Jew. Meredith was out because they're not going to have a main character who's Jewish. We'll have a Jewish president before we have a cute, Jewish female main character on a major network. McDreamy was out because we'll have the cute, goyishe female fall in love with a hot Jewish guy after a Jew is named President of Jupiter. Izzy was out because she's the hot blonde (sensing a trend?). That makes the choice rather obvious, right?  George the emasculated male doctor friend who is secretly in love with the main character is right out of the stereotypical TV Jewish male handbook (he's on the same spread as the somewhat creepy, mama's boy dentist).\n\nBut, no, Grey's Anatomy wasn't gonna be THAT show. Grey's was going to be ORIGINAL. So they eschewed the obvious choice and instead anointed... Cristina?! The Asian one!? Oh yes they did. Oh sure she's Jewish by marriage (her mother's second husband is Jewish) and she mostly self identifies for shock value, but come on! We like Sandra Oh a heck of a lot, but nobody likes her that much.\n\nOh whatever, Grey's Anatomy. You just keep being your quirky whiny self. Just know that even when ER was bad it was better than this.",
  "pros": null,
  "cons": null,
  "score": 808,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/c/cristina_yang.jpg",
  "created_at": "2025-03-29T12:53:02+02:00",
  "updated_at": "2025-03-29T12:53:02+02:00"
}