{
  "name": "Curt Herzstark",
  "url": "http://jewornotjew.com/profile.jsp?ID=1257",
  "verdict": "Borderline Jew.",
  "description": "Berlin, spring of 1945. Goebbels enters a room, where he is greeted by Goring and Bormann.\n\nGoebbels: So, what are you getting HIM for his birthday?\n\nGoring: I believe this year I topped you all, meine herren. A brand new, chrome-plated Mercedes-Benz, with 20 extra horsepower!\n\nGoebbels: Good one, Goring. Good one. What about you, Bormann?\n\nBormann: Two tickets to the State Opera! Die Walkure!\n\nGoebbels: Only TWO tickets? Who is HE supposed to take with him? You?\n\nBormann: Well... \n\nGoebbels: Always brown-nosing, Bormann. Always brown-nosing. No, meine herren, this year, none of you come close to my gift. Watch!\n\nGoebbels reaches into his pocket and produces a small cylindrical machine. It has a dial and is topped with a crank.\n\nGoring: What is it?\n\nGoebbels: A highly experimental...\n\nBormann reaches for the machine. Goebbels quickly retracts his arm.\n\nGoebbels: Look, but don't touch!\n\nGoring: So what is it, Goebbels?\n\nGoebbels: Tell me, Goring, what's 7,498 plus 18,546?\n\nGoring: Ummm...\n\nGoebbels: Now watch!\n\nGoebbels spins the dial and turns the crank.\n\nGoebbels: 25,044!\n\nGoring: Astonishing! Amazing!\n\nBormann takes out a pen from his pocket and scribbles on a sheet of paper lying on a desk.\n\nBormann: Don't want to spoil your excitement, Goebbels, but I got 26,044.\n\nBormann hands Goebbels the paper with calculations.\n\nGoebbels: That cannot be! Let's see here... Carry the one... No! NOOOO!\n\nGoebbels tosses the machine against the wall. It shatters into pieces.\n\nGoebbels: That... JEW!\n\nBormann: What Jew, Goebbels?\n\nGoebbels: Some Austrian scientist we got working in one of our... camps. And I thought he'll have a working prototype ready for HIS birthday!\n\nBormann: I think the Jew is pulling your leg, Goebbels.\n\nGoebbels: How so?\n\nBormann: He is purposely withholding a working prototype so you keep him alive.\n\nGoebbels: You're over-thinking this, Bormann. No, obviously the Jew is not clever enough to do that...\n\nBormann: If you say so, Goebbels... If you say so. Now excuse me, I need to pick out a tuxedo for the opera.\n\nBormann exits the room. Goring shakes Goebbels' hand and also departs. Goebbels starts pacing.\n\nGoebbels: What to get HIM, what to get HIM... Oh, and I thought this machine was such a perfect gift! Oh well... There will always be next year!\n\nCurt Herzstark was liberated from Buchenwald on April 11, 1945, and created the working model of his hand-held calculator, the curta, by November.",
  "pros": null,
  "cons": null,
  "score": 1257,
  "category": "Science",
  "image_url": "http://jewornotjew.com/img/people/c/curt_herzstark.jpg",
  "created_at": "2025-03-29T13:16:54+02:00",
  "updated_at": "2025-03-29T13:16:54+02:00"
}