{
  "name": "Daniel Okrent",
  "url": "http://jewornotjew.com/profile.jsp?ID=1474",
  "verdict": "Jew",
  "description": "Some people will tell you that baseball is America's pastime. These people no doubt spend their evenings galavanting about in their horseless carriages, listening to W.C. Fields on the wireless, while imbibing a glass of frosty cold Moxie. \n\nOthers will look at TV ratings and Forbes earnings reports and calculate that the NFL is how the standard citizen spends his time. But they've made a mathematical error. \n\nHockey, basketball, dominoes. No, these are all very nice sports. Some of them are even still played professionally in the United States. But not a one compares to the popularity of the one sport that rules us all and in the darkness binds us:\n\nFantasy. Fantasy Football. Fantasy Baseball. Fantasy Golf. Fantasy Frolf. Fantasy Congress. Fantasy Reality TV Fashion Show. (Yes, people are really playing these things. Right now.)\n\nAnd who is responsible for all this pretend athleticism? That would be Daniel Okrent — writer, editor, Jew — who in 1979 fantasized (ha ha) about a game where he could draft, trade, and manage his own baseball players. He called it Rotisserie (he and his friends started their first league in a Rotisserie chicken restaurant, leaving millions of people to wonder what would have happened had they preferred Indian). \n\nClearly he wasn't the only person who dreamed of doing this. It helps that the Internet showed up, since tabulating stats from a weekly newspaper... well, it sucked. That's putting it the nice way. But otherwise the game is pretty much as Okrent imagined it.\n\nOh, and if you hate the whole stats revolution? Since fantasy sports are scored completely around numbers (and Daniel, himself, invented WHIP as part of the game) you can pretty much blame Okrent for all that, too.\n\nWe can only hope that, somewhere, Tim McCarver and Joe Morgan are holding each other, sobbing in despair.",
  "pros": null,
  "cons": null,
  "score": 1474,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/d/daniel_okrent.jpg",
  "created_at": "2025-03-29T13:17:00+02:00",
  "updated_at": "2025-03-29T13:17:00+02:00"
}