{
  "name": "Danny Elfman",
  "url": "http://jewornotjew.com/profile.jsp?ID=656",
  "verdict": "Jew",
  "description": "Do you remember 1989?\n\nOh yes, the heady days of Bush, the First. As the Berlin Wall fell, two other major cultural and geopolitical events were occurring: The first Batman movie arrived in June and the first Simpsons episode ran in December.\n\nOK, so maybe these were slightly below the fall of communism  in importance. But really only slightly.\n\nTim Burton's Batman changed the landscape of superheroes as legitimate entertainment — at the time the refuge for B-movies and mind-numbing camp — to the multi-trillion blockbusters that they are today. And The Simpsons revolutionized television, not just for animated shows, but for writing and comedy as well.\n\nAnd Danny Elfman was a part of them both, composing the opening theme for the Simpsons and the soundtrack for the Batman film. Of course, he's done other work since then (most notably for recent vintage, the Spider-Man films), but it's those two works that have been his most iconic. His most memorable and most emulated.\n\nBut 1989 is a ways away now, isn't it? We're all the way through the reign of Bush the Second. The new Batman film franchise has swallowed the Tim Burton one whole, leaving nothing but wonder at how we could ever have thought it was good. And the Simpsons, like an old, rusted Corvette, are chugging along, a shadow of their former glory, getting passed by faster, more modern, inferior models.\n\nAs for Danny, well, he's still working (the aforementioned Spider-Man), but the work has lost a lot of its luster. Much like his former charges, he's seen less as a unique, groundbreaking piece of art and more like the refuge of the lowest common denominator.\n\nIt's a shame. We really liked 1989.",
  "pros": null,
  "cons": null,
  "score": 656,
  "category": "Politics",
  "image_url": "http://jewornotjew.com/img/people/d/danny_elfman.jpg",
  "created_at": "2025-03-29T12:52:58+02:00",
  "updated_at": "2025-03-29T12:52:58+02:00"
}