{
  "name": "Daphne Blake",
  "url": "http://jewornotjew.com/profile.jsp?ID=2916",
  "verdict": "Borderline Jew.",
  "description": "Eleven years ago (three eons in Internet time), we tried to find a Jew on Scooby-Doo. Our search mainly focused on Velma and ended with the statement, \"there were no Jews on Scooby-Doo\".\n\nOr were there?\n\nIn that profile, we immediately dismissed Daphne, stating that \"Jews do not wear neckerchiefs\". There were other, even more obvious reasons to dismiss Daphne, but we didn't go there. So today we will go into reasons to ACCEPT Daphne. Yes, Daphne! Potentially Jewish. Read on.\n\nNo, it has nothing to do with Sarah Michelle Gellar playing her in the movies. It has everything to do with Scooby-Doo comic books. (Are those canon? Does it matter?)\n\n\nAnyway, in a 2001 comic, Daphne and the gang visit her uncle Saul Slotnik. Yes, Saul Slotnik. Now, if that doesn't raise any questions (and some questions should arise), they meet in a Manhattan deli, where uncle Saul teaches Velma the word \"fresser\" (she doesn't know everything, that goyishe Velma), Shaggy chows down on rugalach (good for the munchies), and Daphne is offered to visit Saul's friend, Hesh the Diamond Merchant. (Hesh the Diamond Merchant!) This is where it goes next.\n\nOy, vey, indeed.\n\nLet's brush aside the questionable use of \"diamond merchant\" and get out of this storyline altogether (ghosts are hiding in diamonds?) to come to the obvious conclusion: Daphne has a Jewish uncle, which means that she has a Jewish mother. Which means...\n\nWell, there is Daphne's mother, who (in canon!) is called Elizabeth Blake, and (again, in cannon!), looks like this. Or, if you prefer a younger version, like this. If that woman is Jewish, then... err...\n\nThis leaves us with only two options:\n\nDaphne's mom is adopted.\n\nOr... Jews CAN wear neckerchiefs?\n\nc = document.getElementById(\"comic\");\nfunction showPic(x) {\n showDiv(c);\n c.src = 'img/other/doo/pic'+x+'.jpg';\n}",
  "pros": null,
  "cons": null,
  "score": 2916,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/d/daphne_blake.jpg",
  "created_at": "2025-03-29T13:17:37+02:00",
  "updated_at": "2025-03-29T13:17:37+02:00"
}