{
  "name": "Daphne Rosen",
  "url": "http://jewornotjew.com/profile.jsp?ID=658",
  "verdict": "Jew",
  "description": "If you believe in aliens, then you have to believe that when they arrive they will have questions. #1 being: \"Why the heck are you humans so obsessed with the act of reproduction?\" \n\nAnd even if that question could somehow be skipped over, the next would have to be \"Well then, why are you humans so obsessed with looking at female mammary glands? Especially those of prodigious size?\" \n\nAnd we really have no answer for that, do we? In fact, thinking about it, the whole thing is really quite bizarre. Human reproduction is a natural process, one all of us will participate in at one point or another, probably multiple times. The need to procreate is as hardwired as eating or sleeping. But you don't see piles upon piles of media dedicated to watching people eat, do you?\n\nJust look at the Internet. Here we have the most amazing communicative device that allows for instant sharing of ideas. And we use it almost exclusively for displaying naked chicks (and rating Jews, but that's a totally worthwhile engagement). It's been millennia and we still can't even get over what we look like naked? Really?\n\nSo what does porn star (and Jew) Daphne Rosen have to say about all this?\n\n\"There's not a lot of girls that are as busty or have real big tits as I am, and willing to do quite as much as I am. It's really cool because I'm able to be in the big bust world. But I'm really nasty enough to be a real live porn star. I've got the big bust but I don't use them as an excuse for only doing 'Disney' porn.\"\n\nSee what we're saying? How are we going to be able to answer for THAT? Seriously? Disney porn? What the fuck does that even mean?\n\nAnd we wonder why the aliens haven't shown up yet...",
  "pros": null,
  "cons": null,
  "score": 658,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/d/daphne_rosen.jpg",
  "created_at": "2025-03-29T12:52:58+02:00",
  "updated_at": "2025-03-29T12:52:58+02:00"
}