{
  "name": "David Bowie",
  "url": "http://jewornotjew.com/profile.jsp?ID=802",
  "verdict": "Not a Jew",
  "description": "In college we took a course called \"Myths and Mythology.\" It sounded fun — examining modern film for the undertones of ancient myth. Not bad right? Instead, the entire semester was a long, nauseating plunge into some of the strangest films ever committed to celluloid as our professor pointed out sexual imagery in everything (and we mean everything) we viewed.\n\nOne of the movies we saw was \"The Man Who Fell To Earth\", David Bowie's first film foray and hands down the weirdest of the weird movies that had the honor of scorching our brains that year. For those lucky enough to have no idea what we're talking about, the movie is about an alien (Bowie himself) who comes to Earth and... yeah we've got nothing. At one point you see Rip Torn's bare ass and there's a 20 minute scene of Bowie playing ping pong. A deep learning experience, this was not (though we're now pretty sure what it would be like if we took mushrooms).\n\nThe one thing we did learn? David Bowie is really frickin' strange. He doesn't so much play an alien as he is one, wandering from scene to addled scene with the calm aloofness of a fluffy cloud and about the same number of human emotions. If this were Martian or Not Martian, we'd have a 13. \n\nAs a Jew? Just a 5. Mostly in the K (proving that weird and talented is much more forgivable than just flat out weird). There's some rumor-mongering about a Jewish mother out there, but nothing beyond the usual baseless Internet whispers.\n\nWe learned a lot in college. Most of which we forgot as soon as we left its hallowed halls. But Rip Torn's bare ass, man, that's an image that just never goes away. Dammit.",
  "pros": null,
  "cons": null,
  "score": 802,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/d/david_bowie.jpg",
  "created_at": "2025-03-29T12:53:02+02:00",
  "updated_at": "2025-03-29T12:53:02+02:00"
}