{
  "name": "David Klein",
  "url": "http://jewornotjew.com/profile.jsp?ID=2910",
  "verdict": "Jew",
  "description": "\"Charlie and the Chocolate Factory\" might be a beloved book, and \"Willy Wonka and the Chocolate Factory\" might be an even more beloved film (the Johnny Depp version, not so much), but...\n\n(It has nothing to do with this profile, but let's get to the other \"but\" first. Roald Dahl was a wonderful author... but he was also an antisemite. Moving on.)\n\nWilly Wonka is MAJORLY messed up, isn't he? And we're not talking about that sinister smile or the enslavement of pygmies or that he takes out his childless frustrations on other people's offspring... (Mike watches TV too much! Violet chews gum! Did they deserve their fate? Alright, the gluttonous Augustus and whiny one-percenter Veruca definitely did.)\n\nNo, we're talking about Wonka's nonsensical idea to bequeath his factory to a random child. Not exactly sound business practice. No Jew would ever do that! (And Wonka is clearly not Jewish. See Dahl, above.)\n\nWell, a Jew is (sort of) doing just that. Back in the 1970s, David Klein came up with a new recipe for the jelly bean, making it smaller and filling its insides with delicious flavors. That eventually became Jelly Belly, with Klein selling his idea to the Herman Goelitz Candy Company. (Which is now called the Jelly Belly Candy Company. RIP, Herman.)\n\nToday, Klein is nearing retirement, so he decided to follow in the footsteps of his fictional hero, Wonka. In a much-publicized contest, he is selling tickets to a scavenger hunt which will end up with the winner getting... no, not a factory. A key to one of Klein's factories. The devil is in the details.\n\nWe just hope none of Klein's winners get thrown down a garbage chute.",
  "pros": null,
  "cons": null,
  "score": 2910,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/d/david_klein.jpg",
  "created_at": "2025-03-29T13:17:37+02:00",
  "updated_at": "2025-03-29T13:17:37+02:00"
}