{
  "name": "David Binn",
  "url": "http://jewornotjew.com/profile.jsp?ID=810",
  "verdict": "Borderline Jew.",
  "description": "Our European readers are probably confused about (American) football. And who's to blame them: the game is not that simple to pick up. To top it all, the rules are different on the professional, college, and high school level. Good luck figuring that out, Europeans.\n\nOne thing that really makes (American) football unique is the complete specialization of its players. For example, there is a position of \"wide receiver\". All the wide receiver does is line up, then run. If he is lucky, the ball is thrown to him. If he is good, he will catch the ball and attempt to run some more. If he is not lucky or not good, he returns, lines up, and runs again. Rinse, repeat. That's ALL he does. No wonder most wide receivers are such prima donnas.\n\nBut the specialization of the wide receiver cannot compare to that of the long snapper. While a wide receiver is on the field whenever his team has the ball, a long snapper appears only in kicking situations (yes, there is kicking in (American) FOOTball), which happens about five-six times a game, sometimes more, often less. In those situations, the long snapper's job is simple: snap. Snap, for our European readers, is to crouch, place the ball between your legs, and throw it back so it's caught for the ensuing kick. Yes. That's it. That's ALL the long snapper does.\n\nIn Europe, if your one skill in life is to accurately throw small objects between your legs, you're pretty much limited to dwarf tossing. In America, you play (American) football. And if you're good, like half-Jewish David Binn, who many consider the best long snapper ever, you get paid millions of dollars and get to date Pamela Anderson.\n\n(American) football is a fascinating game, isn't it?",
  "pros": null,
  "cons": [
    "ider the best long snapper ever, you get paid millions of dollars and get to date Pamela Anderson."
  ],
  "score": 810,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/d/david_binn.jpg",
  "created_at": "2025-03-29T12:53:02+02:00",
  "updated_at": "2025-03-29T12:53:02+02:00"
}