{
  "name": "Debi Mazar",
  "url": "http://jewornotjew.com/profile.jsp?ID=880",
  "verdict": "Borderline Jew.",
  "description": "One of the continuous themes of our website is the ongoing battle with the Halachical definition that one is Jewish if and only if their mother is. Time and time again we find counterexamples, yet we continue receiving emails telling us to get in line with the traditionalists. Sorry. No can do.\n\nBut even traditionalists diverge on the definition. What makes a Jewish mother? Does she have to be born Jewish? Or will a conversion be OK?\n\nWe'll leave the mother-must-be-born-Jewish definition aside, but let's discuss the converting issue. There are many cases of this happening so the child would be born Jewish (the mothers of Ben Stiller and Alicia Silverstone, for example).\n\nLet's take the case of the ruggedly handsome actress Debi Mazar (best known for her roles in \"Goodfellas\" and on \"Entourage\"). Debi's father was born Jewish in Latvia, but during World War II, had to have his Judaism hidden. But traditionalists are not concerned about the father. They are concerned about her Catholic-born mother, who... AHA! converted to Judaism.\n\nSo, if we assume that Debi's mother converted before her birth, that would make Debi Jewish, right? Not so fast. Because her mother didn't stop with Judaism. She also converted to Buddhism. And to Jehovah's Witness.\n\nNow that's just convoluted, so we have three options here. One is to trace back her mother's conversions and make sure that at the time that Debi was born (or perhaps conceived? Talk about absurd!) her mother was Jewish. Two is to take the fundamentalist view and deny that Debi is a Jew, Jewish father and somewhat Jewish mother be damned. Three is to avoid this mess altogether and ask Debi herself, because shouldn't that matter most?\n\nAnd if we do that, we'll find out that even though she doesn't exactly call herself Jewish, she does acknowledge her Jewish roots, but is known to wear a cross... for fashion reasons.\n\nWell... no one said this was gonna be easy.",
  "pros": null,
  "cons": null,
  "score": 880,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/d/debi_mazar.jpg",
  "created_at": "2025-03-29T12:53:04+02:00",
  "updated_at": "2025-03-29T12:53:04+02:00"
}