{
  "name": "Delilah",
  "url": "http://jewornotjew.com/profile.jsp?ID=888",
  "verdict": "Not a Jew",
  "description": "Mrs. Manoah couldn't be happier. She spent the Sunday morning ridding her house of the last spec of dust; the linens were bleached to snowy-white perfection; the pot of couscous was boiling on the stove; her husband slaughtered the juiciest lamb for the occasion.\n\nOh, how Mrs. Manoah waited for this day! Young Samson was bringing home a fiance.\n\n\"Come in!\", she yelled, as soon as his footsteps started to echo through the front yard.\n\nAnd here he was. Young Samson, the apple of her eye. And what a hunk! Mrs. Manoah couldn't help but admire her only child. Any woman would be lucky to have him!\n\n\"Hello, mother.\" Samson bent down and kissed Mrs. Manoah on the forehead. A lock of his magnificent hair gently brushed against his mother's side.\n\n\"Welcome, welcome, come in, come in!\", Mrs. Manoah couldn't hold the excitement. \"So where is that future daughter of mine?\"\n\n\"Right here, mother.\" Samson went into the house, and Mrs. Manoah finally saw the woman that was blocked by his majestic mane. \"Mother, this is Delilah.\"\n\nMrs. Manoah didn't like the look of that one bit. Oh, it was obvious what her son saw in this big-bosomed beauty. But something was off.\n\n\"Can I talk to you for a second?\", Mrs. Manoah asked Samson, dragging him into a corner and completely ignoring his fiance, still stranded on the front step.\n\n\"Of course, mother.\"\n\nMrs. Manoah went straight to the point. \"This... Delilah. That's not a Jewish name, is it?\"\n\n\"No, mother.\"\n\nMrs. Manoah fainted in a dramatic production worthy of the best actresses of the time. Samson rushed to get a pitcher of water.\n\n\"And what is she? Phoenician? Geshurian? Pray not Moabian?\"\n\n\"She is Philistine, mother.\"\n\n\"Philistine! Oh, my lord!\", Mrs. Manoah considered a second faint, but decided that would be a bit over the top.\n\n\"She is a good woman, mother.\"\n\n\"That may be, Samson, but can you think about your poor mother just for a second? How will I be able to show my face in temple?\"\n\n\"Mother, I LOVE her.\"\n\n\"Would she at least convert?\"\n\n\"We discussed it.\"\n\n\"And?\"\n\n\"It's under consideration.\" He hated lying to his mother, but he had no choice.\n\n\"And what about the children?\"\n\n\"We will figure that out when the children are born, mother.\"\n\n\"If you think I'm letting my grandson celebrate the Festival of Baal, you got another thing coming!\"\n\n\"Would you give her a chance, mother? Please? For my sake.\"\n\nMrs. Manoah scrutinized Delilah, still standing at the door, from head to toe. Enough for today, she though.\n\n\"For your sake, Samson.\"\n\nSamson ran to the door and took Delilah by the hand.\n\n\"Mother, this is Delilah, my fiance. Delilah, this is my mother.\"\n\n\"Please too meet you,\" said Delilah.\n\n\"Likewise,\" bluntly replied Mrs. Manoah.\n\n\"Mrs. Manoah, I don't want to get off on the wrong foot,\" said Delilah. \"I might not be Jewish, but I love Samson.\"\n\n\"Hmph.\"\n\n\"I'm sure we can work things out.\"\n\nMrs. Manoah let out a sigh.\n\n\"So you say you love my son? What is it that you love about him?\"\n\n\"Oh, everything, Mrs. Manoah! He is so smart, and handsome, and strong!\"\n\n\"You love EVERYTHING about him? What about that... hair of his?\", Mrs. Manoah quizzically looked at the fiance. Delilah surveyed Samson's mane.\n\n\"Well, to be honest, I keep telling him that he could use a haircut...\"\n\nMrs. Manoah sighed. \"Alright, dear. Come into the house already. At least we can agree on something...\"",
  "pros": null,
  "cons": null,
  "score": 888,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/d/delilah.jpg",
  "created_at": "2025-03-29T12:53:04+02:00",
  "updated_at": "2025-03-29T12:53:04+02:00"
}