{
  "name": "Dick Wolf",
  "url": "http://jewornotjew.com/profile.jsp?ID=1892",
  "verdict": "Borderline Jew.",
  "description": "A few years ago, the boys over at Penny Arcade (Jerry Holkins and Mike Krahulik, not Jews) caused a huge controversy by posting a comic in which a character, bemoaning his horrible fate, declared he was being continuously raped to sleep by dickwolves.\n\nMany readers felt that PA had gone too far. They declared that rape is not funny, is never funny, and that any joke involving rape only minimizes the very real impact of sexual assault.\n\nPA responded (both in comic and blog form) with incredulity. After all, how could anyone be offended by the idea of a fictional character being sexually assaulted by a ridiculous, nonexistant creature? Further, they suggested that this was not legitimate protest by legitimately hurt people, but rather was censorship by morons who were incapable of recognizing fiction from fact.\n\n(Two comedy corollaries occur here: George Carlin's bit that rape can be made funny by imagining Elmer Fudd raping Porky Pig and Daniel Tosh's routine about wanting to fuck the pretend love child of Brad Pitt and David Beckham.)\n\nThis whole debate hits home for us. After all, JONJ has said a few things that made people pretty angry. Should we really be writing everything with the idea of what someone might construe as offensive?\n\nBut would we feel so blase if the character complained that all his compatriots were being packed into trains and shipped off to camps?\n\nBecause there are plenty of people — intelligent, caring people — who read these comics and feel threatened by them. Who go to a PA event, filled with young men wearing \"Team Dickwolves\" shirts, and feel unsafe. And if the shirts said \"Team Auschwitz\", how would you feel exactly?\n\nThere are no easy answers here. But we think it would be the perfect plot for the unfortunately named Dick Wolf (not a dickwolf) to write a Law and Order episode around.\n\nLord knows TNT needs something to show on weekday afternoons.",
  "pros": null,
  "cons": [
    "true as offensive?",
    "But would we feel so blase if the character complained that all his compatriots were being packed into trains and shipped off to camps?",
    "There are no easy answers here. But we think it would be the perfect plot for the unfortunately named Dick Wolf (not a dickwolf) to write a Law and Order episode around.",
    "Lord knows TNT needs \u003ci\u003esomething\u003c/i\u003e to show on weekday afternoons."
  ],
  "score": 1892,
  "category": "Comedy",
  "image_url": "http://jewornotjew.com/img/people/d/dick_wolf.jpg",
  "created_at": "2025-03-29T13:17:11+02:00",
  "updated_at": "2025-03-29T13:17:11+02:00"
}