{
  "name": "Diego de Montemayor",
  "url": "http://jewornotjew.com/profile.jsp?ID=2794",
  "verdict": "Barely a Jew",
  "description": "Nuevo Leon, Mexico, late 16th century\n\nAlberto del Canto: Oh, dear Estefania! How I long for your touch!\n\nEstefania de Montemayor: Oh, my beloved Alberto! A second away from you seems an eternity!\n\nAlberto: Why the tears on your face, my Estefania?\n\nEstefania: Oh, Alberto! I haven't seen my father for so long!\n\nAlberto: My cherished Estesfia, you know he and I don't get along...\n\nEstefania: Let bygones be bygones, my Alberto! You know father hasn't been the same since mother's passing...\n\nAlberto: He is the one to blame, my cherished Estefania! It was his sword that struck her!\n\nEstefania: That might be true, my love, but you played a role as well!\n\nAlberto: Oh, my treasured Estefania! How can one point fingers in this time of tenderness!\n\nEstefania: You slept with her, my darling! You shared nightly passion with donna Juana!\n\nAlberto: My angel! Your father was away! Your mother was longing for kinship!\n\nEstefania: And her prize for that kinship, my sweet Alberto, was a sword to her gut!\n\nAlberto: Your father is a madman, my adored Estefania! Did you know that he swore that he will kill me?\n\nEstefania: I... just... wish... you two got along!\n\nAlberto: I can't, my hallowed Estefania! Every time I look at Don Diego's face, with that hooked Hebrew nose, my blood starts boiling!\n\nEstefania: Then look at my face, my lucious Alberto!\n\nAlberto: Oh, my doted Estefania! Your face reminds me so much of her!\n\nConquistador Diego de Montemayor, the founder of the city of Monterrey and the governor of the state of Nuevo Leon, really did kill his wife, Juana Porcalla, after she slept with his rival, Alberto del Canto. And Alberto really did marry Diego and Juana's daughter, Estefania. THIS REALLY HAPPENED.\n\nThey eventually separated.",
  "pros": null,
  "cons": null,
  "score": 2794,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/d/diego_de_montemayor.jpg",
  "created_at": "2025-03-29T13:17:34+02:00",
  "updated_at": "2025-03-29T13:17:34+02:00"
}