{
  "name": "Diogenes",
  "url": "http://jewornotjew.com/profile.jsp?ID=3367",
  "verdict": "Sadly, Not a Jew.",
  "description": "\"Why do you live in a barrel?\", people keep asking me. It's the number one question I always get... other than \"Where do you keep your stuff?\" I don't have any stuff! Think about it: how many tunics does one man need? How many pairs of sandals? One and one. (I actually tried to get away with using a single sandal, not a pair, but it got quite tricky.) And what other \"stuff\" do you actually need? Stuff!\n\nThere are numerous advantages to living in a barrel. Let's say you're in the market and it starts to rain. What do you do? Drop everything you're doing and run home! Well, I'm always home! So while you're getting soaked, I'm always dry and cozy in my barrel! (Mental note: make sure to ask for some tar.)\n\nHave you ever been invited to someone who lives across town? Isn't it annoying to walk all that way? Sure, you can rent a chariot, but you don't want to come off as conceited, do you? Well, the barrel provides an excellent mode of transportation. All I need to do is roll, and I make it anywhere in town in no time at all! (Yes, rolling up the hill is a little hard. But only rich people live on top of hills, and they never invite me! I wonder why...)\n\nHas your house ever been damaged, by flood, fire, or those pesky rats that roam all around? Oh, what a pain to get it fixed! Oh, how many drachmas do you have to pay to crooked contractors, and how many weeks they take to make a simple repair? If my barrel gets damaged by water or fire... I just get a new barrel! It's as simple as that. (As for rats, they don't bother me. Here, his name is Pamphilos. You want to meet him?)\n\nFinally, living in a barrel not only gives me all the time in the world to think, but also allows me to dabble in my passion: gastronomy! Aren't you tired of all those tasteless, watery cucumbers that make up your dour \"Greek\" salad? Well, here is a pleasant change of pace, full of zest, flavor, and crunch: I take those simple cucumbers and put them in my barrel. A few weeks later, they turn into something absolutely delightful... I call it a \"pickle\"! (Yes, I heard the Hebrews down in Judea invented them first. We have much to learn from those wise men!)",
  "pros": null,
  "cons": null,
  "score": 3367,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/d/diogenes.jpg",
  "created_at": "2025-03-29T13:17:49+02:00",
  "updated_at": "2025-03-29T13:17:49+02:00"
}