{
  "name": "Donald Sterling",
  "url": "http://jewornotjew.com/profile.jsp?ID=768",
  "verdict": "Sadly, a Jew.",
  "description": "Let's say you're enjoying another fine day in whatever nice burg you happen to live in when suddenly some ultra-pompous douchebag shows up and, after denigrating your race, family, country of origin etc, demands that you build him his own supermarket. And somehow, despite all reasonable and rational history to the contrary, your fancy little town decides WTF and makes it happen for him. Great. Hoorah. \n\nNow not only does this little prick have all of the profits at none of the cost, but he refuses to stock his store with fresh fruit so that it stinks like grandma's parlor room after she's squeezed a nice fresh turd into her Depends. Meanwhile he's still charging full price for the honor of whiffing the brown peaches and vomiting all over the stale cookie aisle. He pays his employees less than minimum wage, quietly bars entry to anyone who appears even vaguely Mexican and drives around in a Lamborghini Gallardo filled with more fake boobs and fake hair than the United Waitresses Union of the greater Las Vegas area. Oh, and it's the only supermarket in town so if you don't like it, then fuck-all you can either eat his rancid meat or starve to death, whichever you prefer so long as it doesn't interrupt his \"nappy-time\" from 1:15 to 6:30 ever Monday, Wednesday and Friday.\n\nNow sure this all sounds fairly ridiculous except for the fact that this is exactly what's been happening to Los Angeles for the past 25 years with the Clippers (and the Pittsburgh Pirates, and the Kansas City Royals, and the New York Knicks...) And, for those of you who require a vial of nitroglycerin and an oversized car battery to do what the rest of us call thinking — the money sucking, bigoted schmuck in this case is Clippers owner Donald Sterling.\n\nThere's a reason we plow over the playground for your new stadium and put off our vacations to buy your tickets and ignore our families to watch your broadcasts: it's because sports team ownership is a public fucking trust. We pay for these things with the expectation that you'll spend the money on what we care about: fun teams with the occasional opportunity to win more than they lose. Not so you can buy the white fountain with the little boy-angel dancing in the water for the front yard because it looks so much better than the orchid garden in the fall while you screw another thousand black people out of decent housing. In fact, the only reason you haven't been run out of town with pitchforks and torches like a dumber, slower, prostitute-hiring Frankenstein is the protection you get from the so-called \"league commissioner\" who was hired under the pretense of being unbiased but actually runs the league as the owner's voicebox rewarding your fan-screwing, dirty dealing, money sodomizing ways while bitching out the players for such egregious and unforgivable behavior as wearing silly hats.\n\nYes, perhaps it's a stupid thing to be angry about and it's probably why as we get older and older that we've started to care about sports less and less. Here's the thing — we like to convince ourselves we root for the good guys and when we find out our team is run by the sports equivalent of the bastard child of Jabba the Hutt and Attila the Hun we find it hard to keep thinking of ourselves as anything but immortal fuckwents who keep forking our money over in some vain attempt to convince ourselves that someday things will get better though decades of stupidity and greed have made it clear that Charles de Gaulle will rise from the dead, form his own religion and become President of the United Planets of Guam before someone actually grabs thugs like Donald Sterling by their dollar-lined diapers and tosses them into the sea like we do with every other bag of sewage that our society craps out.\n\nOh yes, and Donald Sterling is Jewish. Woo-fucking-hoo.",
  "pros": null,
  "cons": null,
  "score": 768,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/d/donald_sterling.jpg",
  "created_at": "2025-03-29T12:53:01+02:00",
  "updated_at": "2025-03-29T12:53:01+02:00"
}