{
  "name": "Dr. Katz",
  "url": "http://jewornotjew.com/profile.jsp?ID=831",
  "verdict": "Jew",
  "description": "The family sitcom is a time-honored American tradition. From the Bradys to the Bundys, countless fictional families have been trying to bring laughter to living room couches.\n\nBut where, oh where are the Jewish sitcom families?\n\nWe've had Italian Americans, Hispanic Americans, WASP Americans of every shade (from white to lily-white). We've even had Arab Americans and Redneck Americans. But where are the Jews?\n\nYes, we had the Goldbergs, who took it from radio to TV's nascence. But more recently? You would think that with the sheer numbers of Jewish writers in Hollywood, one fictional Jewish family would break through. You would think.\n\nWe did have \"Dr. Katz, Professional Therapist\", the crudely-animated Comedy Central program. (To imitate movement, all the characters constantly jerked like this. Wow, is that annoying. You can stop it.)\n\nBut while Dr. Katz might have not had high production values, it did have a Jewish family at its core. Half of the show dealt with Dr. Katz (Jonathan Katz, obviously a Jew) \"treating\" various comedians as patients (really, just falling asleep in his therapist's chair as the comedians yapped). The other half dealt with Katz playing single parent to his 20-something slacker son Ben (H. Jon Benjamin, Jew).\n\nSo there you go. A two-person Jewish sitcom family is the best we can do. We would say more, but our time is up.\n\n(Editor's update: 2013 gave us the new Goldbergs. A Jewish family, for sure... but we'll take Dr. Katz any day of the week.)\n\n\nd = document.getElementById(\"d1\");\ninterval = 50;\nmx = 3;\nhh = 0; vv = 0;\nend = false;\nfunction start() {\nend = false;\nsetTimeout('move()', interval);\n}\nfunction finish() {\nend = true;\n}\nfunction move() {\nh = 0; v = 0;\nr1 = Math.floor(Math.random()*3);\nr2 = Math.floor(Math.random()*3);\nif (r1 == 1) h = 1;\nif (r1 == 2) h = -1;\nif (r2 == 1) v = 1;\nif (r2 == 2) v = -1;\nhh += h;\nvv += v;\nif (hh \u003e mx) hh = mx;\nif (vv \u003e mx) vv = mx;\nif (hh \u003c -mx) hh = -mx;\nif (vv \u003c -mx) vv = -mx;\nd.style.left = hh;\nd.style.top = vv;\nif (!end) start();\nend = false;\n}",
  "pros": null,
  "cons": null,
  "score": 831,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/d/dr__katz.jpg",
  "created_at": "2025-03-29T12:53:03+02:00",
  "updated_at": "2025-03-29T12:53:03+02:00"
}