{
  "name": "Dr. Zoidberg",
  "url": "http://jewornotjew.com/profile.jsp?ID=466",
  "verdict": "Not a Jew",
  "description": "In Futurama, a modern day dope awakens in the future and goes on hilarious adventures with his alien, mutant, and robot friends (similarities to our most recent presidency are purely unintentional). It's by Matt Groening. It's science fiction. We should love it.\n\nBut there's a problem: Dr Zoidberg, (quoting Wikipedia here) an ignorant, socially inept, disgusting, incompetent who lives in poverty (deep breath) AND speaks with a Yiddish accent, gets guilt from his parents, has a borscht-belt-comedian uncle... you get the point.\n\nJust thinking that Zoidberg might be Jewish ruins the whole show for us. So what can we do about it? Jew or Not Jew powers... ACTIVATE!\n\nOk, first off, the show never outright defines Zoidberg as Jewish. That's good. \n\nSecond, Zoidberg is a kind of lobster/squid amalgam which means he's not Kosher. According to the Bear Corollary established by this website, a non-kosher creature is actually more likely to be Jewish since Jews do not consume each other. That's bad. (The Corollary is. The not eating each other thing is actually fairly beneficial.)\n\nZoidberg doesn't wear a yarmulke. Doesn't go to shul. Doesn't study Torah. Good, good and good.\n\nNow, here's where our in-depth knowledge of xenozoology comes in handy; aka, watching Star Trek. Y'see, on Star Trek they encounter all sorts of \"theme planets\". There's the Greek planet, the Roman planet, the Native American planet, you get the point. None of the people on these planets are Greek, Roman or Cherokee, they just look and act that way. \n\nThe Enterprise has never visited a Jewish planet, but we must assume one exists and that's the planet Zoidberg is from (Decapod 10, for those of you planning a visit).\n\nAll of which brings us to the following happy conclusion (and not a moment too soon):\n\n(Editor's update, 2023: In the revival, Zoidberg is seen lighting a menorah. We're sticking with the verdict.)",
  "pros": null,
  "cons": null,
  "score": 466,
  "category": "Comedy",
  "image_url": "http://jewornotjew.com/img/people/d/dr__zoidberg.jpg",
  "created_at": "2025-03-29T12:52:53+02:00",
  "updated_at": "2025-03-29T12:52:53+02:00"
}