{
  "name": "Dyan Cannon",
  "url": "http://jewornotjew.com/profile.jsp?ID=2980",
  "verdict": "Barely a Jew",
  "description": "What is the worst sequel ever?\n\nThere is no right answer for that one... but let's set some ground rules:\n\n Only the first sequel counts (eliminates \"Rocky V\", \"Batman and Robin\", \"The Next Karate Kid\", \"Superman IV\", and every \"Police Academy\" movie without Steve Guttenberg. Alright, also those with Guttenberg.)\n It has to be an actual sequel, not a remake/rework (eliminates \"Mean Girls 2\", \"American Psycho 2\", \"Son of the Mask\" — yes, those are real movies, look them up!)\n The original movie has to be actually... good (eliminates dreck from the \"Fifty Shades\" series and pretty much any horror franchise you want to name: \"Human Centipede\", \"Saw\", etc, etc, etc.)\n\nWhat are we left with? A few movies tend to rise to the top (err... fall to the bottom) of these lists. \"Speed 2 - Cruise Control\" (Get it? CRUISE Control? It's on a boat!). \"Jaws: The Revenge\" (clearly, sequels need to stay away from water). \"Basic Instinct 2\" and \"Dumb and Dumber To\" (because rehashing the original after the star has aged 20 years is never a good idea). Personally, we despise \"Highlander 2: The Quickening\".\n\nAnd then there is \"Caddyshack II\", which is a complete utter dreckfest that tried to copy the beloved original... by recasting every single role, sans for five seconds of checked-out Chevy Chase. A sequel that cast Dyan Cannon as a love interest to Jackie Mason... except the two couldn't stand each other, on and off the screen (maybe he was disgusted by her conversion to Christianity?). A sequel so utterly humorless and pointless that... we could go on, but this movie just does not deserve further discussion.\n\nBut here is the dirty secret: as beloved as it is, the original \"Caddyshack\" is... pretty darn overrated.\n\nYou know what? Let's just go with \"Batman and Robin\". Screw the ground rules.",
  "pros": null,
  "cons": null,
  "score": 2980,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/d/dyan_cannon.jpg",
  "created_at": "2025-03-29T13:17:39+02:00",
  "updated_at": "2025-03-29T13:17:39+02:00"
}