{
  "name": "Ed Newman",
  "url": "http://jewornotjew.com/profile.jsp?ID=1930",
  "verdict": "Jew",
  "description": "For the opening of the NFL season, we decided to do something special. We went through all 32 NFL teams and found the best Jewish player in its history. For some franchises, it was very easy. For some, incredibly hard. The only caveat is that no player can repeat. So, without further ado, here's the AFC, following yesterday's NFC: \n\n\nAFC East\n\n\n\n\n\n\nAFC Central\n\n\n\n\n\n\nAFC South\n\n\n\n\n\n\nAFC West\n\n\n\n\n\n\n\n\n\n\n\n \n\n \n\n\n\n\n\n\n\nt = document.getElementById(\"tit\");\ni = document.getElementById(\"info\");\np = document.getElementById(\"pic\");\nn = document.getElementById(\"pla\");\nd = document.getElementById(\"dat\");\nbs = document.getElementsByName(\"but\");\nplayer = new Array(\"Sid Youngelman\", \"Ed Newman\", \"Andre Tippett\", \"Steve Tannen\", \"Terrell Suggs\", \"Taylor Mays\", \"Mitchell Schwartz\", \"Randy Grossman\", \"Sage Rosenfels\", \"Mike Sommer\", \"Adam Podlesh\", \"Josh Miller\", \"Lennie Friedman\", \"Bob Stein\", \"Lyle Alzado\", \"Ron Mix\");\ndata = new Array(\n\"Does Marv Levy count? No coaches? Who makes up these rules?!?! Not much to choose from here, so we go with Youngelman, a defensive lineman from the Bills' AFL days. He played for five teams, finishing in Buffalo.\",\n\"With apologies to Jay Fiedler, the Dolphins selection is obvious. Newman, another candidate for the greatest Jewish offensive lineman, made four Pro Bowls, was an All-Pro, and won the Super Bowl.\",\n\"One of the easiest choices with Tippett: five-time Pro Bowler, two-time All-Pro, Hall of Fame linebacker with 100 career sacks. Julian Edelman? Ha!\",\n\"Unlike their neighbors the Giants, the Jets have not been exactly Jew-rrific. Still, there was safety Tannen, who... admit it, you're not reading, you're just staring at that mustache.\",\n\n\"A dilemma here: linebacker Suggs is not exactly Jewish, but does refer to himself as 'half Jewish', as well as... 'Jew for Jesus'. Ugh. Well, we couldn't find a real Jew who've played for the Ravens, so he will have to do.\",\n\"A highly-touted safety out of college, Mays hasn't exactly set the world on fire with the 49ers and now Bengals. But that's it for Jews to play for Cincinnati, so he is in by default (the two sweetest words in the English language!).\",\n\"Schwartz has only been in the league for two seasons, but he has started every game for the Browns so far. (Yes, we know, it's the Browns, but still.) He joins brother Geoff, who made this list for Carolina.\",\n\"No, not the goyishe Ben Roethlisberger, but tight end Grossman. He won the most Super Bowls ever for a Jew, four. And look at that Jewfro!\",\n\n\"There he is! Rosenfels, the one-time patron saint of JewOrNotJew.com! When he became the starting quarterback for the Texans in 2007, readers started to flock to our website. It was all downhill from there... for Rosenfels, not for us.\",\n\"Not much to choose from on the Colts. Running back Sommer played for three teams in the 1950s and 60s, including three seasons for the then-Baltimore based team. He also played some defensive back.\",\n\"Is this the time for Jay Fiedler? Alas, our favorite recent Jewish quarterback only played one game for the Jaguars. Podlesh punted for four years for the much-maligned franchise. Sorry, Jay.\",\n\"The bottom of the barrel. We could only find two Jews who played for the Titans / Oilers: a tight end who played three games in 2001... and Miller, who punted in one in 2007. Let's go with Miller, who had a good career and a Super Bowl ring elsewhere.\",\n\n\"Back in 2007, we chose to profile Friedman as the typical representative of many Jewish offensive linemen. He spent eight years in the NFL, the first three with the Broncos.\",\n\"Few options here, but linebacker Stein played four years for the Chiefs. He was part of their only Super Bowl championship team.\",\n\"We could have picked him for Denver or Cleveland, but Alzado has to belong to the Raiders. Two-time Pro Bowler, three-time All-Pro, Super Bowl champ, admitted steroid user, and one of the nastiest linemen in football.\",\n\"With all the great Jewish offensive linemen, we end with the best one. Mix, the Chargers 'Intellectual Assassin': eight Pro Bowls, nine All-Pro teams, Hall of Fame, one letter to JewOrNotJew.com.\");\nhp = new Array(0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1);\nox = -1;\nfunction load(x) {\n  t.innerHTML = '';\n  i.style.display = 'block';\n  bs[x].style.color = '#0000AF';\n  if (ox != -1) bs[ox].style.color = 'gray';\n  ox = x;\n  n.innerHTML = player[x];\n  d.innerHTML = data[x];\n  loadPic(x);\n}\nfunction loadPic(x) {\n  who = player[x];\n  who = who.replace(' ', '_').toLowerCase();\n  w0 = who.charAt(0);\n  src = 'img/people/' + w0 + '/' + who + '.jpg';\n  if (hp[x] == 0) src = 'img/other/nfl/' + who + '.jpg';\n  p.src = src;\n}",
  "pros": null,
  "cons": null,
  "score": 1930,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/e/ed_newman.jpg",
  "created_at": "2025-03-29T13:17:12+02:00",
  "updated_at": "2025-03-29T13:17:12+02:00"
}