{
  "name": "Ed Miliband",
  "url": "http://jewornotjew.com/profile.jsp?ID=1365",
  "verdict": "Jew",
  "description": "So, the now-four-year-old has learned that there is a country called England. (We didn't get into the details of the exact makeup of the United Kingdom of Great Britain and Northern Ireland.) And, while everyone there speaks English (obviously), some things are just subtly different from America.\n\nFor example, you drive on the left side of the road. And taxis are black, not yellow. (Apparently, most of out conversations with the now-four-year-old are about cars.) And, everyone in England has bad teeth. (Just kidding?) And, the weirdest thing of all, England still has a queen.\n\nNow, no matter how silly the idea of having a queen might be to us, we had to explain to the now-four-year-old that today's queen is not exactly like the queens of old. That she has very little power, and the main guy (we guess it can also be a gal) in charge of the country is the prime minister. But, unlike America where we elect the president by a simple majority of votes (alright, maybe not), in England, the prime minister...\n\nHonestly, we are not exactly sure how English elections work. And the more we read up on them, the more confused we get. That being said, if the elections are called today, the man with the greatest chance to unseat current PM David Cameron would be the Opposition leader, Ed Miliband. He would become the first Jewish prime minister since Disraeli (we realize Cameron himself is part).\n\nBut we didn't get into those details with the now-four-year-old. Instead, we trailed off, mentioning how in England soccer is the most popular sport, and you want to be a soccer player when you grow up, don't you?\n\nHe said yes, but his first choice is to be a doctor.\n\nThe now-four-year-old is Jewish, after all...",
  "pros": null,
  "cons": null,
  "score": 1365,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/e/ed_miliband.jpg",
  "created_at": "2025-03-29T13:16:57+02:00",
  "updated_at": "2025-03-29T13:16:57+02:00"
}