{
  "name": "Edward Brampton",
  "url": "http://jewornotjew.com/profile.jsp?ID=1485",
  "verdict": "Borderline Jew.",
  "description": "\"Ah fare thee well, sir knight. How art thou on this lovely Faire day?\"\n\n\"Oh, Sir Lanceless, I didst not see you there. How good of you to ask. I am well, good sir, quite well.\"\n\n\"Ah, but Lord Brampton, hast thou forgotten today's festivities? Thou canst not joust for the honor of the Lady Rotenbotham in thy sandals and long underwear!\"\n\n\"Ah, the joust! I confess I didst almost forget. But I fear it is my Sabbath and so I must decline to participate in this afternoon's most blessed event in honor of the shik... er, the Lady Rotenbotham.\"\n\n\"Nonsense my good man. You hath really left your wits afar and afield this day. 'Tis Saturday, not Sunday. Thy Sabbath is yet to dawn. Now where is thy squire so that I might rouse him to prepare thee for thy battle. Oh ho! They say the winner will be free to sup on that royal hog. And a meal of roast pork shall be prepared as well.\"\n\n\"Gevalt! Lord Lanceless, much as it might please me to take arms for this meshuggenah, er, mighty joust, I'm afraid I must again decline your treif, er, tournament.\"\n\n\"Well, Lord Brampton, I must say you do seem out of sorts, what with you not knowing the day and this odd peppering of language you've been partaking in. Perhaps it is for the best that you decline.  Still it will not be the same without you. Yes I'd wager my very foreskin it will not be half as much fun without you, good sir.\"\n\n\"Yes, ahem well, that is a wager we shall have to take up another time, yes?\"\n\nLord Brampton, originally the Jewish Duarte Brandao, chose to convert to Christianity soon after to save himself the many uncomfortable conversations such as this completely historically accurate one. And thus, the verdict doth be given:",
  "pros": null,
  "cons": null,
  "score": 1485,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/e/edward_brampton.jpg",
  "created_at": "2025-03-29T13:17:00+02:00",
  "updated_at": "2025-03-29T13:17:00+02:00"
}