{
  "name": "Edwin Land",
  "url": "http://jewornotjew.com/profile.jsp?ID=2041",
  "verdict": "Jew",
  "description": "As part of JONJ's continued dedication to our long history and the Jewish community, we occasionally reprint profiles from our historical archives. Today we present this product review, written in 1948 by Herschel Hymowitz for \"Jewish Life\" magazine.\n\nFor my birthday, Mrs. Hymowitz bought me a camera. \"You will love taking photographs,\" she said. \"Imagine, capturing family moments, important milestones, precious memories...\" \"How much did you spend, meshuge?!\", I yelled out. \"Tsk, Herschel,\" she said. \"Your birthday only comes once a year.\"\n\nSo I had no choice but to give this camera a whirl. Don't get me wrong, I tried to be positive about it, but taking photographs is not for me. First you need to buy the film (30 cents! Ganefs!), making sure to get the right size and speed. Then you have to unwind that darn canister and stick it inside the camera. All set? If only! Now you need to wait for the lighting to be just right...\n\nAnd you know the worst part (other than the cost)? Let's say that you have everything setup correctly. Click! The camera goes off. You have no idea how well the picture ended up. You need to finish the roll of film, remove it from the camera, put it in an envelope, pay an ungodly processing fee (49 cents! Plus a stamp, three cents: 52 cents total!), and wait three weeks to see the results! And then, only then, you can see that in that glamor shot, with Mrs. Hymowitz at the head of the dinner table, her eyes are closed! And little Joseph is out of focus! Who came up with these fakakta things!\n\nWell, there is now a better solution. Edwin H. Land, a fellow lansman, has invented the instant camera for the Polaroid Corporation. With this camera, you don't need to spend all the time (and money!) waiting for the picture to the develop. Just pull the film out, peel off the negative, give at a shake, and voila! Instant photography! Sounds like something out of the future, doesn't it?\n\nNow, while an instant camera is clearly preferable to the old model, I don't see much use for it in the long term. It's hard to imagine people wanting to take many pictures. How many glamor shots of Mrs. Hymowitz at the dinner table does one need?",
  "pros": null,
  "cons": null,
  "score": 2041,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/e/edwin_land.jpg",
  "created_at": "2025-03-29T13:17:14+02:00",
  "updated_at": "2025-03-29T13:17:14+02:00"
}