{
  "name": "Ehud",
  "url": "http://jewornotjew.com/profile.jsp?ID=1555",
  "verdict": "Jew",
  "description": "Inspector Shmul was woken up by loud banging on his door.\n\n\"Coming,\" he said, fidgetly tying his bathrobe.\n\nTwo Moabite soldiers were standing at the entrance.\n\n\"You're Shmul?\", the taller one asked.\n\n\"That I am,\" Inspector answered. \"But what are you doing here at this time of the night?\"\n\n\"Follow me.\"\n\nThe taller soldier grabbed Shmul by the shoulder and pulled him over the threshold. The three of them proceeded in silence, Shmul flanked by the duo.\n\nThe royal palace was magnificent even in darkness, its walls towering over all surroundings. The tall soldier pushed Shmul through the gate. He was met with a nod from the on-duty guard.\n\nThe trio proceeded into the palace, passing through countless corridors, doors, and enclaves. There was not a soul in sight.\n\nThey came to a stop in front of a wide door. The tall soldier reached into his tunic, pulled out a set of keys, carefully picked one out, and opened the door.\n\nShmul was taken aback by the smell. The garishly opulent room, filled with lush carpets, silk tapestries, precious vases, silver golbets, and gold chests, reeked. It reeked of feces.\n\nThere was a rotund body lying at the foot of the throne in the center of the room.\n\n\"Go on,\" the tall soldier said.\n\nShmul stepped into the room, instinctively clasping his nose with two fingers. The tall soldier followed; the other remained at the door.\n\nThe grotesque body, with layers of fat protruding through its clothes, was lying on its stomach, in a pile of blood and excrement. Shmul didn't need to look at the face to figure out who it is: King Eglon of the Moabites, dead in his own throne room.\n\n\"The door was locked,\" the tall soldier said. \"We thought the king was... relieving himself. He usually takes some time.\"\n\n\"Who was the last person to see the king?\"\n\n\"Ehud, the Jew. He brought tribute.\"\n\n\"Was he left alone with the king?\"\n\n\"The king asked us to step out. He said that Ehud had to deliver a personal message from God. You know how you Jews are with messages from God.\"\n\n\"Do you normally leave the king alone with visitors?\"\n\n\"We do not, but the king insisted. Besides, we searched this Ehud. He didn't have a weapon on him.\"\n\n\"Yet Ehud is not there, and the king is dead. May I?\"\n\n\"Go ahead.\"\n\nShmul walked over to the body, and, trying not to wretch, turned it over. The behemothian king plopped on his back, spreading a fecal shower that barely missed Shmul. The soldier wiped his tunic with his hand, then took a step back.\n\nA dagger was thrust into the king's stomach. Only the tip of the handle was visible, as the rest was covered up by folds of fat. Shmul covered his hand with the sleeve of his bathrobe and carefully pulled out the dagger. The soldier gasped.\n\n\"I... searched him!\"\n\n\"Did you, now?\"\n\n\"Yes, the official five-point search! Chest, back, belt, arms, thigh!\"\n\n\"Thigh? Just one thigh?\"\n\n\"Inspector, with all due respect, no one would conceal a dagger of this size on their right thigh. It would be unreachable!\"\n\n\"So you only checked the left side?\"\n\n\"That is the procedure, as instituted by the king himself!\"\n\n\"Well, then the king has only himself to thank for his undoing.\"\n\n\"I don't understand.\"\n\n\"Come closer.\"\n\nThe soldier, his legs clearly shaking, took a step closer to the body.\n\n\"You see this cut?\", Shmul asked, using the dagger to hold up a layer of fat. \"A cut with that angle could only be made by a left-handed man.\"\n\n\"A left-handed man?\"\n\n\"Ehud must have hid the dagger on his RIGHT thigh, where, since he was left-handed, it was easily reachable.\"\n\n\"That sinister Jew!\"\n\n\"Yes... that sinister... Jew.\"\n\n\"I have to call the guards! We must find him before it's too late!\"\n\n\"I wouldn't do that if I were you.\"\n\n\"WHAT?\", the soldier stopped in his tracks, looking at Shmul with obvious derision.\n\n\"You don't want the princes to find out it was YOU who failed to search Ehud? It was YOU who left a killer alone with the king?\"\n\n\"Oh,\" the soldier was clearly taken aback. \"No... of course not.\"\n\n\"Well, dispose of the dagger, then! We'll call this... food poisoning.\"",
  "pros": null,
  "cons": null,
  "score": 1555,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/e/ehud.jpg",
  "created_at": "2025-03-29T13:17:02+02:00",
  "updated_at": "2025-03-29T13:17:02+02:00"
}