{
  "name": "Elijah",
  "url": "http://jewornotjew.com/profile.jsp?ID=1550",
  "verdict": "Jew",
  "description": "\"My name is Elijah... and I'm an alcoholic.\"\n\nGroup: \"Hi, Elijah.\"\n\n\"It has been nearly one year since my last drink.\"\n\nSome scattered applause.\n\n\"However, I already know that in a few short days, I'll be off the wagon again.\"\n\nGroup leader: \"Why do you think that's so, Elijah?\"\n\n\"I'm a binge drinker. I've been this way as long as I can remember. Once a year, every year I'm compelled to visit every Jewish home and drink a whole glass of wine at each house. Then I wait till the next night and do it again. Then I spend the rest of the year trying to recover.\"\n\nGroup leader: \"But if you know this is your behavior, Elijah...\"\n\n\"Why can't I stop it? You try to quit drinking when an entire religion is your enabler. They all leave a full glass of wine at the table, just for me. Then they send their children to welcome me at the door. I can't say no to that! I tell you, if it wasn't for all those reform Jews who quit halfway through the seder, I'd be on my 300th liver by now...\"\n\nGroup leader: \"You can use all the excuses you want, Elijah. But in the end you have to take responsibility for your own actions.\"\n\n\"I know. I know. I mean, I've built up a tolerance over the centuries but after my 4000th glass... It's not even good wine. Usually it's that Maneschewitz swill that tastes like grape juice mixed with Ben-Gay. That stuff messes with your head something awful. By the last few houses... well, let's just say the kids were better off not finding the afikomen some years.\"\n\nGroup leader: \"Elijah, you're a good man.  But you need to sober up so you can bring the messiah, already. Have you looked around lately? I mean, if someone told you five years ago that New Jersey would somehow get worse...\"\n\n\"I know... I know...\"\n\nGroup leader: \"OK. So you'll make an effort this year to stay sober, and maybe next year, you come back and tell us you're ready to finally bring peace to the Earth. And, in the meantime, if you're feeling weak, remember you can always talk to your sponsor, Dionysus.\"\n\n\"Oy, gevalt.\"",
  "pros": null,
  "cons": null,
  "score": 1550,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/e/elijah.jpg",
  "created_at": "2025-03-29T13:17:02+02:00",
  "updated_at": "2025-03-29T13:17:02+02:00"
}