{
  "name": "Emile Hirsch",
  "url": "http://jewornotjew.com/profile.jsp?ID=2726",
  "verdict": "Borderline Jew.",
  "description": "Let's get it out of the way — Emile Hirsch, who has a small but important role in \"Once Upon a Time in Hollywood\", is a quarter Jewish. Now let's talk about \"Once Upon a Time\"...\n\nSome of us here at JONJ are Quentin Tarantino disciples. Ever since \"Pulp Fiction\" took everything we thought we knew about movies and skewered it, we've been waiting with baited breath for the auteur's each new film. And \"Inglorious Basterds\"! Oh, those basterds, but you can scour the JONJ annals where we proclaim our eternal love for them. Not to say that everything Tarantino has done is great, but when the man is on... he is on.\n\nWhich brings us to \"Once Upon a Time\". We were sitting in the movie theater, thinking: do we like this? It definitely didn't consume us like \"Pulp\" or enthrall us like \"Basterds\". It was gorgeously made, the acting was top-notch, but, but... It even lacked the signature trademark of Tarantino, chapter titles. (Not that we need chapter titles, but we're watching a Tarantino movie, and \"Once\" could have been anybody's movie, well, not anybody's, but not necessarily Tarantino's.)\n\nTarantino has always been successful of piecing a larger story from smaller ones (just look at \"Pulp\" or \"Basterds\"), but in \"Once\" the attempt fell flat. It's like you were watching a series of vignettes, which were all connected, but didn't exactly form a concrete narrative. Now, each of the vignettes was pretty good on its own, but together? A solid film they do not make.\n\nSo we were about to say to ourselves, even with Tarantino, they all can't be winners... and then the ending hit. If you read the commentary, many have hated it, but not us. Not only did it tie everything in the movie together, it put a giant, unmistakable stamp: this is a Tarantino film. The two hours that preceded it were an appetizer, a tension-builing path to the most tarantinesque resolution. We absolutely adored it.\n\nNow, Lena Dunham's performance? Ugh. Let's just say her acting is not on par to co-stars Pitt and DiCaprio... Or even Emile Hirsch.",
  "pros": null,
  "cons": null,
  "score": 2726,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/e/emile_hirsch.jpg",
  "created_at": "2025-03-29T13:17:32+02:00",
  "updated_at": "2025-03-29T13:17:32+02:00"
}