{
  "name": "Emma Lowenstamm",
  "url": "http://jewornotjew.com/profile.jsp?ID=2880",
  "verdict": "Jew",
  "description": "What if Lenin and Hitler played a game of chess? No, this is not terrible historical fanfic (at least not as far as we know), but a subject of a very real etching, attributed to Emma Lowenstamm (allegedly; this word will appear a lot below). Here it is:\n\n\n\nFirst, about Lowenstamm: she was a Jewish Czech artist who was most known for her portrait work. Among her subjects were Leo Tolstoy and Theodor Herzl. But it's \"A Chess Game: Lenin with Hitler — Vienna 1909\" that is her (alleged) most famous work.\n\nThe etching was supposedly done when the two future despots met, in, well, 1909 Vienna, over a game of chess. As everyone knows, Hitler was a struggling art student. Lowenstamm was (allegedly) his teacher; her house was a meeting place of various political freethinkers. So a perfect place for Hitler and Lenin to (allegedly) meet and (allegedly) play a game of chess, which they both loved!\n\nAlas, there is a reason for all those allegedlies above; the etching is very likely to be a fake. There is absolutely no evidence that Lenin and Hitler ever met, or that Lenin was even in Vienna in 1909. There is no evidence that Lowenstamm was actually Hitler's art teacher. And, most curiously, the alleged artist got Lenin completely wrong. The man pictured on the right above has a full head of hair; by 1909, Lenin has been bald for a good 15 years. He is drawn moving a piece with his left hand; Lenin was right-handed. There is even a letter from Lenin in early 1910 claiming he had not played chess for a year.\n\nAll of that hasn't stopped the etching from appearing at auctions. It last did so in 2011, but its current fate is not known.\n\nPerhaps its owner is busy working on that fanfic...",
  "pros": null,
  "cons": null,
  "score": 2880,
  "category": "Politics",
  "image_url": "http://jewornotjew.com/img/people/e/emma_lowenstamm.jpg",
  "created_at": "2025-03-29T13:17:36+02:00",
  "updated_at": "2025-03-29T13:17:36+02:00"
}