{
  "name": "Emma Goldman",
  "url": "http://jewornotjew.com/profile.jsp?ID=887",
  "verdict": "Jew",
  "description": "On September 6, 1901, anarchist Leon Czolgosz (Not a Jew) shot President William McKinley. McKinley died eight days later.\n\nWhy did Czolgosz do it? Just like John Hinckley (Not a Jew) 80 years later, he did it for a woman. So who was Czolgosz's Jodie Foster? The paramount stage beauty of the time? A courtesan with a heart of gold? His mother?\n\nNo, no, and no. He did it because he was inspired by Emma Goldman, an anarchist.\n\nGoldman was born in what is now Lithuania and made her way to the US in her teens. Her father told her, \"all a Jewish daughter needs to know is how to prepare gefilte fish, cut noodles fine, and give the man plenty of children\". Sadly for Mr. Goldman, Emma did not exactly follow through. After not finding success in her love or professional life, she became an anarchist, known for her rousing political speeches. Czolgosz was inspired by one such speech and sought out Goldman. She was taken aback, thinking that he was an infiltrator. That didn't deter him, and he claimed Goldman as his inspiration. (He also claimed to be the Antichrist. Not exactly a sane bunch, these assassins.)\n\nGoldman was immediately pegged as the mastermind behind the assassination, but was released after she proved she had nothing to do with it. (But it's not like the woman was a wallflower: she, together with lover Alexander Berkman, did try to assassinate union-buster financier Henry Frick nine years prior.)\n\nGoldman became an anti-war and pro-birth control advocate, was imprisoned multiple times, was deported to Russia, got disillusioned with communism, and spent the rest of her life roaming the world, fighting for what she thought was right. She is now considered not only an anarchist, but a feminist icon.\n\nApologizes, President McKinley.",
  "pros": null,
  "cons": [
    "Apologizes, President McKinley."
  ],
  "score": 887,
  "category": "Politics",
  "image_url": "http://jewornotjew.com/img/people/e/emma_goldman.jpg",
  "created_at": "2025-03-29T12:53:04+02:00",
  "updated_at": "2025-03-29T12:53:04+02:00"
}