{
  "name": "Emma Lazarus",
  "url": "http://jewornotjew.com/profile.jsp?ID=2115",
  "verdict": "Jew",
  "description": "On May 13, 1939, the transatlantic liner St. Louis sailed out of Germany with over 900 Jewish passengers, including children.Their goal was to get away from the Nazis before things, already really bad, got much much worse.\n\nThe Jewish refugees sailed to the United States by way of Cuba but were denied entry into the land of the free. Partially, this was due to randomly assigned and remarkably cruel immigration quota laws set by an infamously anti-semitic immigration department. \n\nSome of it had to do with public paranoia. Everyone felt bad for the refugees, but the US was undergoing a severe economic crisis and people worried that Jews would take jobs away from hard working Americans. Also, President Roosevelt wanted to get re-elected (his third term). Public polls showed great antipathy toward the immigrants. He declined to intervene. \n\nThe ship sailed back to Europe. Over 500 of the passengers ended up right back in Germany. In concentration camps. In the very hell they had tried so very hard to escape.\n\nWe're all so proud of our wonderful, amazing country and all so needlessly stupid and hateful. If you live in this country, you once emigrated here. Full stop. It wasn't that long ago that black people were considered, legally, as less than a full human being. That job descriptions were commonly adorned with \"Irish need not apply.\" That Jews were sent right back to the death chamber. No thanks, we've got more than plenty o' you here.\n\nYet here we are again, making disgusting, despicable decisions about who gets sup at the all too generous succor of our country and who does not. No, it isn't different this time. Someone once said your grandfather was lazy or ignorant or detrimental to this country's standards once, too. Yes, they did. Somehow, you got lucky. Good thing you're working to make sure that never happens again.\n\nThe poem says:\n\"Give me your tired, your poor, \nYour huddled masses yearning to breathe free, \nThe wretched refuse of your teeming shore. \nSend these, the homeless, tempest-tossed to me, \nI lift my lamp beside the golden door \n\nThere is no asterisk at the end saying, \"Except for anyone different than me.\"",
  "pros": null,
  "cons": null,
  "score": 2115,
  "category": "Politics",
  "image_url": "http://jewornotjew.com/img/people/e/emma_lazarus.jpg",
  "created_at": "2025-03-29T13:17:16+02:00",
  "updated_at": "2025-03-29T13:17:16+02:00"
}