{
  "name": "Erich von Stroheim",
  "url": "http://jewornotjew.com/profile.jsp?ID=1028",
  "verdict": "Jew",
  "description": "Hollywood, 1935. Young screenwriter Harry Hubert has been called by producer Louis Lipton to discuss his newest script.\n\nLipton: Harry, my boy, this is terrific!\n\nHubert: Do you like it?\n\nLipton: Best script I read all year!\n\nHubert: That is great to hear...\n\nLipton: We just have to make a couple of changes before we can make it into a film.\n\nHubert: Oh.\n\nLipton: Nothing major, my boy! Nothing to worry about!\n\nHubert: What exactly are you talking about?\n\nLipton: This villain you have in there. Love it. Love everything about him.\n\nHubert: Wonderful!\n\nLipton: Just one thing, my boy. Why is the villain wearing a metal suit through the whole picture?\n\nHubert: Well, he's terribly disfigured...\n\nLipton: We can't have that, Hyman!\n\nHubert: Harry, Mr. Lipton.\n\nLipton: Err... Right, Harry. We can't have a cripple on the screen! You think the audience wants to see a cripple?\n\nHubert: Well, they won't, he's wearing a metal suit...\n\nLipton: Think about it, Harry. I am paying you to think, am I not?\n\nHubert: Well...\n\nLipton: What actor am I gonna get to wear a metal suit for the entire motion picture?\n\nHubert: I was thinking...\n\nLipton: You were thinking? Am I paying you to think?\n\nHubert: Well...\n\nLipton: No actor will wear that thing, Hyman.\n\nHubert: It's Harry, Mr. Lipton.\n\nLipton: Sure it is... Stop interrupting! Where was I?\n\nHubert: The suit...\n\nLipton: Yes, the suit! Ditch the suit, Harry.\n\nHubert: But...\n\nLipton: I don't want to hear any buts, my boy! Do you know who I got lined up to play the villain in this picture?\n\nHubert: No...\n\nLipton: Von Stronheim!\n\nHubert: Erich von Stronheim? The silent actor?\n\nLipton: The one and the same! Such a villainous face! He's been doing quite a few talkies now.\n\nHubert: But... he is a Jew who always plays Germans.\n\nLipton: What do you have against Germans?\n\nHubert: Well, I don't...\n\nLipton: You and your people! Germans this, Germans that!\n\nHubert: What I mean, Mr. Lipton, is that Mr. von Stronheim has a distinctive German look which will not work with the picture's setting...\n\nLipton: You are not thinking, Harry!\n\nHubert: I am not thinking?\n\nLipton: We change the setting!\n\nHubert: Oh?\n\nLipton: Germany, 1924. She is a down-on-her-luck opera singer. He is her brother, a hapless actor. In comes von Stronheim... a benevolent benefactor? Someone who is after something sinister? That's Hollywood gold, my boy!\n\nHubert: But... but...\n\nLipton: What are you babbling about, my boy?\n\nHubert: Well, in my script, the villain is revealed to be the father...\n\nLipton: HE IS?\n\nHubert: Yes, right here at the end of the second act...\n\nLipton: Well, we can't have that! Can you imagine, von Stronheim trying to seduce his own daughter!\n\nHubert: Seduce who now?\n\nLipton: Don't worry about the details, my boy! And the names, the names have to go. Darth? What kind of a name is that?\n\nHubert: But, but...\n\nLipton: Just minor, minor changes, my boy! Such a terrific script. We'll be in touch!\n\nHubert: ...Thank you?\n\nLipton: No, thank you, Harry! You watch, this will be the most talked about picture of the year, if my name is not Leo Lieber... — Louis Lipton!",
  "pros": null,
  "cons": null,
  "score": 1028,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/e/erich_von_stroheim.jpg",
  "created_at": "2025-03-29T13:16:48+02:00",
  "updated_at": "2025-03-29T13:16:48+02:00"
}