{
  "name": "Evan Kaufmann",
  "url": "http://jewornotjew.com/profile.jsp?ID=1289",
  "verdict": "Jew",
  "description": "If not for being Jewish, Evan Kaufmann would be a small blip on the sports radar. A hockey player deemed not good enough for NHL, he is making his living in Germany, playing for a team called DEG Metro Stars. Not exactly a riveting story.\n\nBut Kaufmann is Jewish, and that gives the story an unexpected turn. No, not because Kaufmann plays in Germany: there have been a number of Jews who played for various teams in various German sports leagues. It's because Kaufmann plays FOR Germany. And that is unexpected.\n\nNo, Kaufmann is not the first Jew to represent Germany internationally. Alfred Flatow won gymnastics golds at the first modern Olympics. Gottfried Fuchs set the record for most goals in a soccer match. But these athletes plied their trade a century ago. And yes, there have been Jews who competed for Germany since World War II, South African-born swimmer Sarah Poewe the prime example, but Kaufmann's family history makes his situation rather unique.\n\nBorn in Minnesota, Kaufmann made his way to Germany after he went undrafted in the NHL. There, to escape the quota on foreign players, he took on German citizenship, a common practice for many international athletes. And how did he qualify for the citizenship? Through his grandfather. Who survived the Holocaust. Much of the rest of the family, including Evan's great-grandparents, were murdered. By Germans. The country whose flag Evan wears on his uniform. The country he now represents.\n\nFor Evan excelled so much in the German hockey league, that he was asked to join the national team. And since he was made a citizen, that made him eligible. The decision could not have been easy.\n\nBut it definitely made Evan's story riveting.",
  "pros": null,
  "cons": null,
  "score": 1289,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/e/evan_kaufmann.jpg",
  "created_at": "2025-03-29T13:16:55+02:00",
  "updated_at": "2025-03-29T13:16:55+02:00"
}