{
  "name": "False Dmitry II",
  "url": "http://jewornotjew.com/profile.jsp?ID=1832",
  "verdict": "Not a Jew",
  "description": "1605. Russian czar Boris Godunov drops dead. He leaves one heir, 16-year-old Feodor. Two months after being crowned, Feodor is strangled, leaving Russia czarless.\n\nBut not for long. A pretender emerges: Dmitry, the son of previous czar Ivan the Terrible (one of the biggest douchebags and the most horrible people in history of mankind). One small problem: Dmitry died (probably, was murdered) when he was eight.\n\nNot so, says the pretender. I am the real Dmitry! Look at this wart! (He had a wart.)\n\nThe nobles fall in line, proclaiming the fake Dmitry the new czar. He takes a wife, Polish noblewoman Marina. (In fact, odds are that Dmitry was a Polish plant, intended to take over Russia. It worked.)\n\nLess than a year intro Dmitry's reign, the nobles give it some thought and decide that... maybe they were wrong. Maybe this is not the real Dmitry. So they stage a coup, and the new czar is murdered. (Are you keeping track of all the murders? Russia in the 17th century was is fucked up.)\n\nOne of the noblemen, Vasily Shuisky, is proclaimed new czar. But the coast is not clear. A new pretender emerges, claiming he is the real Dmitry! (Did he have a wart? We're not sure about the wart.)\n\nWhew. It sure took us a long time to get there. So, yes, False Dmitry II, who looked nothing like False Dmitry I. Yet it didn't stop the ex-czarina Marina from proclaiming them the one and same. (Maybe she just wanted some shtupping.) Sadly for the II, he didn't even make it to czar: after taking over a few cities, he couldn't seize Moscow, and was killed by a revenge-seeking noble.\n\nSo who was False Dmitry II? One of the theories is that he was actually (you guessed it!) a Jew... or at least a converso. Again, these are theories. No one knows for sure.\n\nIt didn't stop after the II's death. He was followed by False Dmitry III, who didn't last long, but once again was proclaimed by the shtup-loving Marina to be her real husband... But that was the last pretender, and Russia stabilized, and was transformed into a peaceful, welcoming, unprejudiced country, staying that way to this day.\n\nHa ha ha ha ha! No.",
  "pros": null,
  "cons": null,
  "score": 1832,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/f/false_dmitry_ii.jpg",
  "created_at": "2025-03-29T13:17:09+02:00",
  "updated_at": "2025-03-29T13:17:09+02:00"
}