{
  "name": "Ferenc Sas",
  "url": "http://jewornotjew.com/profile.jsp?ID=1871",
  "verdict": "Jew",
  "description": ".pic {width:75px; height:100px; border:1px solid}\n\n\n\nLet's figure out the All-Time World Cup Jewish XI! Click on player names below to find out more. Since we have to draw the line somewhere, we'll only count those who score \"Borderline Jew\" or higher. Sorry, David Beckham!\n\n\n\n\n\n\n\nItzhak VissokergoalkeeperIsrael 1970\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJuan SorindefenderArgentina2002, 2006\nWilliam AyachedefenderFrance 1986\nJeff AgoosdefenderUSA1998, 2002\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFerenc SasmidfielderHungary 1938\nAndriy VoroninmidfielderUkraine 2006\nGiora SpiegelmidfielderIsrael 1970\nKyle BeckermanmidfielderUSA 2010\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMordechai SpieglerforwardIsrael 1970\nViktor KanevskyforwardUSSR 1962\nRudolf WetzerforwardRomania 1930\n\n\n\n\n\n\ncur = 0;\nin1 = document.getElementById(\"info1\");\nin2 = document.getElementById(\"info2\");\nin3 = document.getElementById(\"info3\");\nin4 = document.getElementById(\"info4\");\nfunction next() {\n cur++;\n if (cur == 12) cur = 1;\n show(cur);\n}\nfunction show(x) {\n t1 = ''; t2 = ''; t3 = ''; t4 = ''; \n if (x == 1) t1 = \"Well, this is an easy selection. Vissoker gets it by default, by being the only Jew on record to play goal in a World Cup match. (Hungary's Sandor Geller was a non-playing backup in 1952.) In any case, Vissoker didn't do too badly, shutting out eventual runner-ups Italy.\";\n if (x == 2) t2 = \"Sorin has appeared in more World Cup games than any other Jew: seven, spanning two tournaments. He even captained Argentina in 2006, as they went to the quarterfinals.\"\n if (x == 3) t2 = \"The Algeria-born Ayache started four four games for France, as they made it all the way to the semifinals in 1986. He is also an Olympic gold medalist, winning two years earlier in Los Angeles.\"\n if (x == 4) t2 = \"No! We didn't want to go here, but it looks like we have to. Agoos didn't play a minute in 1998, but was a starter for three games four years later. He actually managed to score a goal... into his own net, in USA's 3:2 win over Portugal.\"\n if (x == 5) t3 = \"In 1938, the World Cup was a single-elimination affair, and Sas started all four games for Hungary, as they made it all the way to the final. Alas, he couldn't become the first Jew to win the World Cup, as Italy won 4:2. After the tournament, Sas emigrated to Argentina, and played for the famed Boca Juniors.\"\n if (x == 6) t3 = \"Voronin started four games as Ukraine's unexpected run to the quarterfinals. He would have started all five, if not for an injury in the Round of 16 victory over Switzerland.\"\n if (x == 7) t3 = \"We're dipping into Israel again, with Spiegel, who started every game in 1970. On the club level, he was one of the first Israelis to make a name in Europe, playing in France.\"\n if (x == 8) t3 = \"Defensive midfielder Beckerman became a surprising starter and a key player during USA's run in 2014. Can't we bend the rules to include David Beckham or Edgar Davids? No? Whose idea was this?!\"\n if (x == 9) t4 = \"Alright, here is a no-brainer. Spiegler is the only Jew to ever score in the World Cup, doing so in Israel's 1:1 tie with Sweden. He captained Israel in the tournament, and is his country's all-time leading goalscorer.\"\n if (x == 10) t4 = \"Kanevsky started two of the Soviet Union's games in 1962. For whatever reason, he was dropped for their final two matches, as the Soviets were upset in the quarterfinals.\"\n if (x == 11) t4 = \"The first Jew to ever play in the World Cup, Wetzer started both of Romania's games. Romania beat Peru, lost to Uruguay, and Wetzer started the proud tradition of Jews in the World Cup!... Or not.\"\n in1.innerHTML = t1;\n in2.innerHTML = t2;\n in3.innerHTML = t3;\n in4.innerHTML = t4;\n}",
  "pros": null,
  "cons": null,
  "score": 1871,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/f/ferenc_sas.jpg",
  "created_at": "2025-03-29T13:17:10+02:00",
  "updated_at": "2025-03-29T13:17:10+02:00"
}