{
  "name": "Finn Wolfhard",
  "url": "http://jewornotjew.com/profile.jsp?ID=2461",
  "verdict": "Barely a Jew",
  "description": "A few years ago, for the first and only time, we removed a profile from our website. We won't name names, but it was of a child actor who starred in a movie we enjoyed. The child was clearly Jewish (there are stories on the Internet about him celebrating his bar mitzvah), so we wrote a very complimentary profile. Little did we know that the child's army of lawyers and publicists contacted us the very same day, demanding to take it down.\n\nAnd you know what? We did it, not because we're afraid of lawyers, or because we were disgusted by someone so young trying to hide their Jewishness. We took it down because it was a child. What's one less profile to us? So we moved on.\n\nWe moved on (that kid never amounted to anything, so good riddance), but we tried very hard not to profile anyone underage. Let kids enjoy their privacy.\n\nWhich brings us to \"Stranger Things\". And wouldn't you know it, Finn Wolfhard, who plays Mike, is part Jewish! And just in case his lawyers get their panties in a bunch, we give you this quote, given by Finn himself, in a July 25, 2016 article on vulture.com:\n\nWhat's funny is I'm German, but then I'm like French — I'm French and German and then Jewish. It's really weird. I have really weird blood. And then I go to Catholic school, which is really weird.\n\nSee? It's funny AND weird! And just in case those Finn's lawyers do contact us...\n\nWe'll just switch this profile to Noah Schnapp instead.\n\nnathan = false;\nfunction flip() {\n setImage('noah_schnapp');\n setTitle('Noah Schnapp');\n setRatings(4, 4, 3);\n setVerdict('Jew');\n setSubhead('October 3, 2004 \u0026mdash;');\n}",
  "pros": null,
  "cons": null,
  "score": 2461,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/f/finn_wolfhard.jpg",
  "created_at": "2025-03-29T13:17:25+02:00",
  "updated_at": "2025-03-29T13:17:25+02:00"
}