{
  "name": "Firestorm",
  "url": "http://jewornotjew.com/profile.jsp?ID=90",
  "verdict": "Borderline Jew.",
  "description": "OK, so Firestorm doesn't exactly look Jewish. OK, he doesn't exactly look human either, what with the flaming hair and all. But, you see, Firestorm is actually the amalgam of two people, Jason Rusch and Martin Stein. Rusch is black, part of comics attempt to appear socially responsible 40 years too late. But Stein, Firestorm's mental aspect and conscience, is a Jew!\n\nBut does that make Firestorm Jewish? \n\nThe Rabbis are a little unclear on the subject of two individual beings merging to become one elemental superbeing and that being's Jewishness thereof. If we were to view Firestorm as a child (the creation of two people), does Stein count as the \"mother\" and thus confirm Firestorm as a Jew? Or, since Stein is male, does that make Firestorm merely half-Jewish, or even not Jewish at all?\n\nAnd then if Firestorm is, indeed, Jewish, what happens in the cases when Rusch chooses to merge with the goyishe Firehawk instead of Stein? Is he then not Jewish? Or can Judaism be, in some way, dormant? And if you wanted to give Firestorm a bar mitzvah would it already be too late because Stein and Rusch are older than 13? Or do you go by Firestorm's birthdate which could be considered two years ago? Unless you count the original Firestorm with Ronnie Raymond and Martin Stein in which case it's too late again? And was THAT Firestorm Jewish? And if he was, and he used his matter changing powers to create a Passover Seder from thin air, would it be Kosher? The mind boggles.\n\nAll of this goes to prove one thing. Comic books are ridiculous and assessing the Judaism of said comics characters, even moreso. It's a waste of time. Period.\n\nBut, Firestorm is a Jew. Probably.",
  "pros": null,
  "cons": null,
  "score": 90,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/f/firestorm.jpg",
  "created_at": "2025-03-29T12:52:44+02:00",
  "updated_at": "2025-03-29T12:52:44+02:00"
}