{
  "name": "Franz Sacher",
  "url": "http://jewornotjew.com/profile.jsp?ID=2447",
  "verdict": "Sadly, Not a Jew.",
  "description": "The Sachertorte, the guidebook said, is Vienna's signature desert. It was said to have originated at the Sacher Hotel. Avoid the lines! You can get the very same cake in the cafe next door.\n\nWe did not avoid the lines! If we were gonna taste Vienna's signature desert, we were gonna taste the original!\n\nIt was a late spring day, with the promise of summer nullified by overhanging clouds. Book in hand, we stood in line at the Sacher Hotel, as Chinese tourists happily snapped photos. Some of them, enviously eyeing our place, joined at the tail end of the line.\n\nThe Sachertorte, a chocolate confection, was originally created in 1832, by Franz Sacher (sometimes reported Jewish — but alas!), on princely orders. Later, Sacher opened the eponymous hotel, and the torte spread to the rest of Vienna and places beyond.\n\nJust as we were getting to the beginning of the line, a man approached. He was tall, approaching senior age, with a mane of silver hair. He confidentially walked through the line, opened a shut door, and entered the restaurant. The Chinese tourists looked at each other in shock. The maitre d', who up to that point guarded the door with intense scrutiny, just shrugged.\n\nWho is this mysterious stranger, we thought. A dignitary? Some famous Austrian we never heard of? Or just a repeat patron?\n\nAs we made our way inside, the man already made himself at home. His trench coat folded over a nearby chair, a newspaper in his extended arm (English-languaged, we noted), he was enjoying not just the desert, but rather a full meal. The Chinese tourists, now in matching striped ensembles after taking off their coats, moved their picture-taking indoors. They didn't exist to this man. He was sitting alone, enjoying his dish (seafood, we think), with quiet, solemn dignity that seemed more in place with 19th century decorations that surrounded him than with the modern world.\n\nWe ate the Sachertorte.\n\nIt was absolutely delicious.",
  "pros": null,
  "cons": null,
  "score": 2447,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/f/franz_sacher.jpg",
  "created_at": "2025-03-29T13:17:25+02:00",
  "updated_at": "2025-03-29T13:17:25+02:00"
}