{
  "name": "Frank Gehry",
  "url": "http://jewornotjew.com/profile.jsp?ID=773",
  "verdict": "Jew",
  "description": "When we were in college, we made the obligatory summer trip to Europe. When a free day opened up in out haphazard schedule, we had a great idea — take a day trip to Prague. We would take an overnight bus from Frankfurt, where we were based, spend a day in the Czech capital, and return, once again, by bus, the next morning.\n\nSadly, we forgot one thing: we can't sleep on buses.\n\nWe got to Prague after a sleepless night and were dropped off not at a bus terminal, but at some random station. And when our ATM card got immediately eaten by a ravenous cash machine, we cursed our attempts of independence, and wished we were back at our home, in a cozy New Jersey suburb.\n\nIt ended up a great day; we wandered through downtown Prague, seeing it lit up with the gold that gave it its famous nickname. We subsisted on one cup of coffee, one hot dog, and one piece of bread. We attempted to sleep on the footsteps of the Saint Wenceslas statue. We admired Prague's Castle and its beautiful women. We were stopped by the Czech police.\n\n\nBut what we remember most is the Dancing House: a shot of modernism that complements the baroque, gothic, and art noveau that intertwine the rest of the city. A silhouette of a woman, draped in glass, clutching to her concrete-clad partner in an eternal dance. We were memorized. Perhaps the lack of sleep had something to do with it.\n\nOr perhaps not. For Frank Gehry, who collaborated with Czech architect Vlado Milunic on the Dancing House, truly is an architectural genius. From Prague to Boston to Bilbao to Los Angeles, his work can be described by one word: amazing.\n\nOh, and he is Jewish. Born Ephraim Goldberg.\n\nBoy, are we happy we took that day trip.",
  "pros": null,
  "cons": null,
  "score": 773,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/f/frank_gehry.jpg",
  "created_at": "2025-03-29T12:53:01+02:00",
  "updated_at": "2025-03-29T12:53:01+02:00"
}