{
  "name": "Fred Wilpon",
  "url": "http://jewornotjew.com/profile.jsp?ID=1120",
  "verdict": "Sadly, a Jew.",
  "description": "Defense Lawyer: Mr. Wilpon, you are accused of having knowingly taken money in the Ponzi scheme run by Bernie Madoff, is that correct?\n\nWilpon: That is correct.\n\nDefense Lawyer: And your defense is that you were, ummmm, not savvy enough to be aware of what was going on?\n\nWilpon: That (sigh) is correct. \n\nDefense Lawyer: Mr. Wilpon, your team, the New York Mess, er, Mets are currently in severe financial trouble, is that correct? What have you done to fix that problem?\n\nWilpon: Well, we've begun selling off all our stars, but before we could do that, I held a press conference saying I thought they were all worthless.\n\nDefense Lawyer: So, to be clear, before you could get any money for your only assets, you went out and completely devalued them?\n\nWilpon: That's correct.\n\nDefense Lawyer: Are there any other financial dealings you feel the court should be aware of?\n\nWilpon: Well, I built a multi-billion dollar stadium that no one wants to go to because it honors a team that abandoned the city in 1957 rather than the team that plays there now.\n\nDefense Lawyer: I see... anything else?\n\nWilpon: I think that's it.\n\nDefense Lawyer: Really? What about Bobby?\n\nWilpon: Oh. Oh yeah. I kinda sorta encouraged our guys to sign this overweight player with one good year under his belt in the early 90s for a lot of money. After he poisoned the team during our one good playoff run in the 90s, he retired but we still owed him 5.9 million dollars. But we decided to defer the payments.\n\nDefense Lawyer: Uh huh.\n\nWilpon: With interest.\n\nDefense Lawyer: Uh huh.\n\nWilpon: So now that bill has come due and we owe him yearly payments of over 1 million dollars a year for the next 25 years.\n\nDefense Lawyer: So let me get this straight. You made an active choice that resulted in giving someone who was a team cancer and hasn't played for you in 11 years an extra 24 million dollars?!\n\nWilpon: That is correct.\n\nDefense Lawyer: Your honor, the defense rests.",
  "pros": null,
  "cons": null,
  "score": 1120,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/f/fred_wilpon.jpg",
  "created_at": "2025-03-29T13:16:51+02:00",
  "updated_at": "2025-03-29T13:16:51+02:00"
}