{
  "name": "Fritz Hofmann",
  "url": "http://jewornotjew.com/profile.jsp?ID=3382",
  "verdict": "Sadly, Not a Jew.",
  "description": "Years ago, we profiled gymnast Alfred Flatow, the first ever Jew to win an Olympic medal. In the inaugural 1896 Games, Alfred won three golds and one silver. Two of those golds, for team parallel bars and team horizontal bar, were shared with cousin Gustav Flatow.\n\nBut the Flatows were not the only Germans — but, probably, the only German Jews — to receive those medals. A bunch of goys shared in the gymnastics triumph, including team captain Fritz Hofmann. (Now, \"Hofmann\" could theoretically have been Jewish, but there is no evidence that he was. His full name, Friedrich Carl August Hofmann, might be the most German name in the history of names. But we digress.)\n\nSo why are we profiling this goy? Well, other than the potential ambiguity of \"Hofmann\", he competed — and won a medal — in...\n\nBefore we get to that, this Hofmann was quite an athlete. At these inaugural Olympics, he took silver in the 100 meter run, and finished fourth in the 400 and fifth in the high jump. Alright, let's get to it. The fourth medal won by Hofmann came in the rope climb.\n\nYes, rope climb, the scourge of elementary school gym classes! In the Olympics! Not only in 1896, but also 1904, 1924, and 1932 (alas, never since)! In that original competition, a 14-meter rope was hung, and the fastest climber would get the gold. (There were also style points?)\n\nTwo Greeks raced to the top, and Hoffman went third. When he got within a meter and a half of the top, he realized he couldn't win, so he... gave up. Somehow, that was enough for the bronze. (Which they didn't award at the time. He got it retroactively, we guess.)\n\nCome on, Olympics, you brought back rugby and golf... Why not rope climb?",
  "pros": null,
  "cons": null,
  "score": 3382,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/f/fritz_hofmann.jpg",
  "created_at": "2025-03-29T13:17:49+02:00",
  "updated_at": "2025-03-29T13:17:49+02:00"
}