{
  "name": "Gabe Kaplan",
  "url": "http://jewornotjew.com/profile.jsp?ID=1227",
  "verdict": "Jew",
  "description": "Sportswriter Bill Simmons called Gabe Kaplan's triumph one of the greatest sports moments of the 1970s, yet you will not see Kaplan listed under Athletes on our website. The triumph came on an iconic television program, \"Battle of the Network Stars\".\n\nWe previously discussed the ridiculousness of the made-for-TV spectacle that was \"Superstars\" (see the Jody Scheckter profile). But at least that had real athletes, where \"Network Stars\" featured... yes, network stars. Competing in sporting events. For some reason, that made sense. Don't ask us, we were barely alive at the time.\n\nThe iconic moment came in 1976. NBC, led by macho man Robert Conrad, was disqualified from a relay race for an illegal baton pass. The race was won by ABC, captained by stand-up comedian Gabe Kaplan. At the time, he was starring on the highly popular \"Welcome Back, Kotter\", playing a wisecracking (but wise!) high school teacher.\n\nConrad complained, throwing a fit filled with such gems as saying that Kaplan \"is Jewish, he wants to arbitrate, and I'm German, I want to kill [him]!\" This was the 70s. No one cared.\n\nSo Kaplan agreed to race again, but not a full relay, just a run-off between the two captains. Simmons describes being horrified, as he thought that Kaplan didn't stand a chance against an action hero. He was dead wrong. Kaplan, who ran track in high school, obliterated his competitor, giving ABC the title. Everyone hugged. This was the 70s. Somehow they cared.\n\nA few years passed, and \"Battle of the Network Stars\" got canceled. Kaplan stayed on the television screen a little longer, before reinventing himself as a poker player. He's a cash game specialist, and has also won over a million dollars on the pro circuit...\n\nBut how can any of that compare to \"Battle of the Network Stars\"?",
  "pros": null,
  "cons": null,
  "score": 1227,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/g/gabe_kaplan.jpg",
  "created_at": "2025-03-29T13:16:53+02:00",
  "updated_at": "2025-03-29T13:16:53+02:00"
}