{
  "name": "Gargamel",
  "url": "http://jewornotjew.com/profile.jsp?ID=121",
  "verdict": "Not a Jew",
  "description": "For the uninitiated, and by that we mean people over the age of 35, the Smurfs were a popular Saturday morning cartoon show, featuring a tiny, predominantly male, socialist commune. They were blue. And lived in mushrooms. And used the word 'smurf' a lot. As in, this scenario is smurfing bizarre.\n\nThe show also featured Gargamel, a dastardly villain with only one goal — destroy the smurfs! And use their deaths to make money somehow! OK, so maybe this plan wasn't particularly well thought out. Hashem knows the market for smurf skins crashed in the late 1950s. But we digress.\n\nAll of this is a nice little trip down Memory Lane (with a short stopover on Creepy Court), but a waste of time on this website. Except for one thing — there is evidence Gargamel may be Jewish.\n\nGevalt! Look, we're happy to have some really badass villains (come on Darth Vader!), but Gargamel? A dirty schlemiel who can't even conquer a bunch of smurfberry-drunk hippies who're only a hand high? \n\nWhat's worse, the evidence is both circumstantial and insulting: Gargamel is drawn like most anti-semitic propaganda (balding, big nose), his end goal is money, he's a momma's boy... It's all pretty upsetting. Because Jew or not, someone out there is really bigoted — the creator of the cartoon or the creator of the theory. Probably a little of both really. All of which leaves us with the vague feeling Gargamel may be Jewish topped by the desperate hope that he's not.\n\nFortunately, then, there's a solution to all this. Since we'll never know for sure, Gargamel's Judaism is based purely on perspective. And since we really don't want Gargamel to be Jewish, we can simply say that he isn't.\n\nOnce again, the power to determine who's Jewish and who isn't has saved us all. Thank smurfing G-d.",
  "pros": null,
  "cons": null,
  "score": 121,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/g/gargamel.jpg",
  "created_at": "2025-03-29T12:52:45+02:00",
  "updated_at": "2025-03-29T12:52:45+02:00"
}