{
  "name": "General Weiss",
  "url": "http://jewornotjew.com/profile.jsp?ID=2166",
  "verdict": "Not a Jew",
  "description": "Wait, who the eff is General Weiss and why the heck are we profiling him? \n\nWell, you see, General Weiss is in Star Wars. Not the new movie, no, don't go looking for him there. None of the original films or the best-avoided prequels, either. There is no General Weiss in the excellent Clone Wars TV show or its excellent-er replacement Rebels. \n\nNo, here's where you'll find the good general: in a Star Wars board game (yes, really, a board game) called Imperial Assault. In that game, based on a previously-released dungeon crawler called Descent, players can take on the roles of various well-known heroes of the Rebellion or the Empire in ground-based, gun (and light saber) battles across the galaxy. \n\nBut General Weiss isn't in the base game, either. Oh no. He's part of an expansion pack for Imperial Assault (the cleverly named General Weiss Villain Pack) that adds an extra AT-ST to the game along with some new play scenarios. \n\nAnd we think he's Jewish?\n\nNot really. Yes, there are a lot of Jews with the last name Weiss (meaning white), but that's because it's also a fairly common German surname, as well. And the creators of the various Star Wars properties often give the Imperial troops vaguely German sounding names because it harks us all back to the original ultimate villain, the Nazis (For even more heavy handed, pseudo-Nazi imagery, see the new movie). \n\nSo, what we're saying is, General Weiss is a throwaway, barely canon, generic giant-robot pilot from an obscure expansion pack that is part of a moderately good board game that 95% of the geek universe will never hear of, let alone play and has a somewhat Jew-y last name but clearly isn't intended to be Jewish.\n\nAnd we're profiling him. Why? \n\nBecause Star Wars.",
  "pros": null,
  "cons": null,
  "score": 2166,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/g/general_weiss.jpg",
  "created_at": "2025-03-29T13:17:18+02:00",
  "updated_at": "2025-03-29T13:17:18+02:00"
}