{
  "name": "George Steinbrenner",
  "url": "http://jewornotjew.com/profile.jsp?ID=668",
  "verdict": "Not a Jew",
  "description": "By now you're probably aware that the universe has righted itself and the New York Yankees have resumed their rightful place as world champions.\n\nOne of the stranger permutations of this event has been the sudden outpouring of love for Yankees owner George Steinbrenner: \"This win is for George,\" is a paraphrase of what just about every Yankee player, coach and executive declared at the end of game 6.\n\nReally? \n\nMaybe we missed the revisionist history train, but it seems to us that the only difference between the George Steinbrenner who was compared unfavorably to Adolph Hitler by Saturday Night Live and the lovable old baseball man we're supposed to revere today is the Yankees won a few titles in the last decade.\n\nAnd let's be clear, the ONLY reason those titles were won is that ol' Georgie was banned from baseball (for tampering) when the team was being rebuilt in the early 90s. Without that, nothing would have kept him from the disastrous inevitability of trading Derek Jeter, Jorge Posada and Mariano Rivera for some guy in a wheelchair that had a good pitching arm once — the same BS that made the team a laughing stock throughout the 1980s and early 90s.\n\nYup, it'd be fair to say we fairly despise George Steinbrenner and we're quite happy that the only Jewish thing about him is his somewhat-kinda-sorta-Jewish-sounding name. And yet we'd still take him over just about any other owner in baseball, because at least he'll do anything to win. And you just can't say that about the majority of the other owners.\n\nBut that doesn't say anything about George. Just the sorry state of our (some of us anyway) favorite sport.",
  "pros": null,
  "cons": null,
  "score": 668,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/g/george_steinbrenner.jpg",
  "created_at": "2025-03-29T12:52:59+02:00",
  "updated_at": "2025-03-29T12:52:59+02:00"
}