{
  "name": "George Lucas",
  "url": "http://jewornotjew.com/profile.jsp?ID=2333",
  "verdict": "Not a Jew",
  "description": "\"At one time, you've got it, and then you lose it, and it's gone forever.\" — Sick Boy, \"Trainspotting\"\n\nSick Boy proceeds to rattle off a bunch of examples, but let's take one close to home: Woody Allen. Putting his extracurricular life aside, after his peak in the 70s, he hasn't exactly been able to climb back up. There are small blips here and there, but Woody tends to fall back to recycled, repeated themes. And we LIKE Woody (again, extracurricular life aside).\n\nWhich brings us to George Lucas, and this question: did he ever have IT in the first place? American Graffiti is supposed to be good, and we give you the original Star Wars and Indiana Jones (how could we not?), but if you look at Lucas' early plans for his space saga, you'd be scratching your head. Perhaps he got lucky? Perhaps he found just the right people to collaborate with (Spielberg, Kasdan, et al)? Perhaps he was successful despite of himself?\n\nNot only was Lucas not able to replicate his success; he failed miserably. The Star Wars prequels are an abomination (even Ewan McGregor, who, as Renton, is listening to Sick Boy's theory above in Trainspotting, couldn't rescue them from Lucas' mundane plot and mind-numbing dialogue). The less said about Indy 4, the better. Should we bring up Howard the Duck? No need.\n\nWhat separates Lucas from Woody is that the latter kept trying (you will note the past tense). Woody tried to reinvent himself, for better (Hannah and Her Sisters, Match Point), or for worse (too many to mention), before falling back to old patterns. \"Reinvent\" doesn't exist in Lucas' vocabulary; it's if he believed that everything he spun got turned to gold without much effort.\n\nBut we give this to Lucas: he is an incredibly shrewd businessman, who parlayed a once-tiny movie into an empire. And once he lost IT (if he ever had IT in the first place, that is), he sold it off for billions.\n\n\"So we all get old and then we can't hack it anymore. Is that it?\" — Renton\n\nWell, shit.",
  "pros": null,
  "cons": null,
  "score": 2333,
  "category": "Business",
  "image_url": "http://jewornotjew.com/img/people/g/george_lucas.jpg",
  "created_at": "2025-03-29T13:17:22+02:00",
  "updated_at": "2025-03-29T13:17:22+02:00"
}