{
  "name": "George Michael",
  "url": "http://jewornotjew.com/profile.jsp?ID=648",
  "verdict": "Not a Jew",
  "description": "\"I can't believe Liberace was gay. I mean, women loved him! I didn't see that one coming.\" — Austin Powers\n\nSome surprising revelations seem obvious afterward. It's easy to look back on things now and think, \"wow, those people were idiots!\" But, for those of us who lived it, everything wasn't always so clear while it was going on.  \n\nFor instance, when we look back on George Michael, it seems so obvious: The earring, the outfits, the ridiculous music videos, even the lyrics of his songs, my G-d, that man is GAY. Super gay. Scores a 5 on the O score of GayOrNotGay.com gay.\n\nQuick aside, because well, there's no other place to put it: when we say 'gay' we mean people who have relationships with people who are the same sex as they are. And when we say it, there is no judgment or moral statement implied. It's the people using the word gay pejoratively — and we can't say this strongly enough — THEY are the people we have contempt and disgust for. They are the people destroying this country, not the millions of perfectly nice people who would happily live productive and fulfilling lives if we would just leave them the hell alone.\n\nBut in the 1980s (we swear!), when millions of heterosexual women thought George Michael was flat out gorgeous, it wasn't even a question. He was as masculine as Prince or Boy George or... y'know what? Maybe we were just idiots in the 80s. That's really the only possible explanation.  \n\nIn any case, maybe someday the fact that George Michael claims to be part Jewish will seem obvious, even tautological. But for now — wow, cross earring and all — we have to say, we just never saw it coming.\n\n(Editor's update: We're fully aware of claims that George Michael had a Jewish grandmother. However, actual genealogical research has shown otherwise. So, Not a Jew.)",
  "pros": null,
  "cons": null,
  "score": 648,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/g/george_michael.jpg",
  "created_at": "2025-03-29T12:52:58+02:00",
  "updated_at": "2025-03-29T12:52:58+02:00"
}