{
  "name": "George Cohen",
  "url": "http://jewornotjew.com/profile.jsp?ID=647",
  "verdict": "Barely a Jew",
  "description": "Has a Jew ever won the soccer World Cup, the post prestigious trophy in all of team sports? And we don't mean as an assistant coach or a team physician, we mean as a player.\n\nWell, let's do the math. The World Cup has been played 18 times. Each roster, counting substitutes and bench, consists of 22 or 23 players. That's about 400 total champions. 21 have won the title more than once (Pele: Not a Jew), so let's say we're left with 380 players. Surely, one of them must be Jewish. Right? Right?\n\nLet's try South America first. Brazil (five titles) is a reach; besides, it would be pretty difficult to deciphering a Jew among one-names like Garrincha and Jairzinho. Argentina and Uruguay (two titles each) just might give us something, with turn-of-the-century immigration and all. But... let's just say that digging through Gonzalezes and Perezes to find a Jew is a tough task. So let's leave South America for now.\n\nOn to Europe. Germany's three titles all came after World War II, so we're gonna say no on that one. Two of Italy's three came during Mussolini's time, and they added one three years ago, but a quick glance at that roster does not give us a Jew. Neither does one at France's squad in 1998: lots of first and second generation immigrants, but alas, no Jews.\n\nSo we're left with England, champions in 1966, and their starting fullback George Cohen. Cohen, recently named the best right back in English history, is not Jewish, but does have Jewish heritage (his name is Cohen, after all).\n\nSo do we have our World Cup winning Jew, or will Cohen not do? Hmmmm. Maybe we should research those Argentinians and Uruguayans after all.",
  "pros": null,
  "cons": null,
  "score": 647,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/g/george_cohen.jpg",
  "created_at": "2025-03-29T12:52:58+02:00",
  "updated_at": "2025-03-29T12:52:58+02:00"
}