{
  "name": "Gim Allon",
  "url": "http://jewornotjew.com/profile.jsp?ID=948",
  "verdict": "Jew",
  "description": "We're gonna do something a little different for this one. That is, *I'M* going to do something a little different.\n\nSee, I've been a little down lately. Nothing too bad. By the time you read this profile (we post about a month behind when we write) I'll be well past it. But right now I've been going through some stuff and rather than cast it all over our entire writing staff I figured it would be better to just own up to it. So, first person. Deal with it.\n\nSo anyway, a couple of nights ago I'm lying in bed, trying to keep the \"what-ifs\" from taking over my head (credit: Shel Silverstein) and I do what I've been doing for 25 years to relax. I read a comic. Legion of Super-Heroes in this case. \n\nAnd there it is, on page 2, coming from the mouth of Colossal Boy of all people: \"Actually, my tribe calls it Shabbat and we meet on Friday nights.\"\n\nSo why does this make me feel a million times better? It's not just the website thing, though finding new Jews to write about does give me a disturbing amount of pleasure. Especially fictional comic book Jews. But actually, I really don't know why. Maybe it's the whole grew-up-in-a-small-town-with-no-Jews thing.\n\nI'm so conditioned to the idea of being alone that when someone else — even a fictional, crime fighting someone else from the 31st century who is married to a shape-shifting shiksa — professes any kind of sameness it just warms me up inside.\n\nOr maybe I'm just nuts. Not gonna preclude that possibility. Anyway, Gim Allon, aka Colossal Boy, aka Leviathan, aka Micro Lad has been Jewish since 1980 when Legion writer Paul Levitz (JEW!) recognized that Allon was a very popular Israeli last name. And he's been kept that way more or less through three re-boots, re-names, retcons and Hashem-knows whatever else.\n\nWorks for me. Every now and then people ask: why did you start this site? Maybe this is why. Everyone needs to feel like they're not alone in the universe. At least it wasn't Matter-Eater Lad.",
  "pros": null,
  "cons": null,
  "score": 948,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/g/gim_allon.jpg",
  "created_at": "2025-03-29T12:53:05+02:00",
  "updated_at": "2025-03-29T12:53:05+02:00"
}