{
  "name": "Glenn Beck",
  "url": "http://jewornotjew.com/profile.jsp?ID=1018",
  "verdict": "Not a Jew",
  "description": "Do you know what the most widely read magazine in the US is? It's not \"Time\" or \"People\". It's not \"Sports Illustrated\" or \"Ladies' Home Journal\". It's definitely not \"Jewish Bride\". It's \"Parade\".\n\nThat's right, \"Parade\", the insert to most Sunday newspapers. 20 pages of bland stories, blander recipes, blandest celebrity news, and Hummel figurine advertisements. The most widely read magazine in America. Look it up.\n\n\"Parade\" also does profiles of various celebrities to show America that they are just like us. (Hey look, Nicole Kidman loves her children! Jay Leno gives his best! Drew Carey lost weight!) And on the day we had our own encounter with \"Parade\", it decided to profile Fox News blowhard Glenn Beck.\n\nNow, let's preface it that we wouldn't be caught dead reading \"Parade\". But... we were over at someone's house, the situation required a magazine, and a \"Parade\" was the only one around. Let's leave it that.\n\nSo we, no, not read, but glanced through it. And one paragraph immediately caught our attention. Here it is, the underline is ours:\n\nRaised Catholic, Beck wasn't a practicing anything when he proposed to his current wife, Tania. She insisted that they find a church to join, concluding that God needed to be a part of their future family's life. \"We tried 'em all,\" Beck says. \"Unitarian, Episcopalian, Baptist, even a synagogue. We ended up with the Church of Latter-Day Saints because I took my daughters there, and they said, 'Dad, this place makes us feel warm and welcome inside. Can we come back?'\"\n\nOh boy. Where do we begin? On second thought... let's not.\n\nSo... good for Beck. At least he found his place in life. Bad for us, for now we can't stop thinking about the above absurdity. That will teach us to pick up \"Parade\" magazine.",
  "pros": null,
  "cons": null,
  "score": 1018,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/g/glenn_beck.jpg",
  "created_at": "2025-03-29T13:16:48+02:00",
  "updated_at": "2025-03-29T13:16:48+02:00"
}