{
  "name": "Greg Daniels",
  "url": "http://jewornotjew.com/profile.jsp?ID=3223",
  "verdict": "Jew",
  "description": "Which version of \"The Office\" is superior: British or American? It's a debate that keeps raging on, two decades after the former ended, one after the latter.\n\nIt's hard to find anything wrong about the British original: it's twelve incredibly tight episodes filled to the brink with then-groundbreaking cringe comedy. In David Brent, Ricky Gervais created a character for the ages. Perhaps the only knock on is its brevity: we have those twelve episodes (and one Christmas special), and that's it. But one can see that as a feature, not a bug. Going out on top, if you will.\n\nSpeaking of going out on top... this is not what the American version did, but what a top they had. After initial struggles (the pilot episode is a shot-for-shot remake of the British version, which simply didn't work), it rose to heights and popularity that the original just couldn't touch. And Michael Scott... well, he is no David Brent, but Steve Carell evolved him into something even greater. Of course, the problem with the American Office is that it did not go out on top. Seasons eight and nine, after Carell departed, are an abhorrent mess. But those early seasons...\n\nDo we go with Jews as the tiebreaker? Good luck finding one on the British version, but Greg Daniels, the original showrunner of the American one, is Jewish. Paul Lieberstein (you might know him better than Toby), who replaced Daniels late in the run, is a MOT as well. So are a number of actors, including previously-profiled B. J. Novak and Rashida Jones...\n\nIf we had to pick one... well, the British one might have a higher batting average, but if we're stuck on a desert island (with a DVD player?), we'd go with the American one?",
  "pros": null,
  "cons": null,
  "score": 3223,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/g/greg_daniels.jpg",
  "created_at": "2025-03-29T13:17:45+02:00",
  "updated_at": "2025-03-29T13:17:45+02:00"
}