{
  "name": "Guardians of the Universe",
  "url": "http://jewornotjew.com/profile.jsp?ID=977",
  "verdict": "Not a Jew",
  "description": "OK, so, DC Comics has these dudes called the Green Lanterns. They're sort of interstellar policemen, gifted with magic rings which they use to enforce justice across the galaxy. The rings run on willpower — imagine it and it will come true. Their one weakness is fear, symbolized by the color yellow (get it?). There are other colors, too, but today we will be dealing with green.\n\nAnd blue. For you see, these space cops need a space oversight committee (for their space bureaucracy, duh!). And the little blue dude pictured to the left, well, that's them. Well, one of them, anyway. They're called the Guardians of the Universe (not to be confused with the Guardians of the Galaxy, they're another company) and they were like, the first race ever. \n\nThey made the rings, made the Pine Lamps, er Green Lanterns, and now basically serve as a sort of combination straw dog/deus ex machina/plot exposition hub for the series. Oh, also, their look was apparently based on David Ben-Gurion. And thus the JewingOrNotJewing. See, it all comes back to us. Just as it should.\n\nAnywhoo, now would be a good time for us to make a few things clear: Of all the great things Ben-Gurion accomplished, model for these little bald weirdos probably isn't making the Top 10. Further, while there are many things about Jews worthy of basing a comics character on (bravery, wisdom), weird hair and big nose got old about 1200 years ago (it was a Thursday, if we recall). \n\nAlso, Jews may be short, but we're not that short. And as a people we tend to tan fairly well — so it's unlikely you'll find a congregation that's completely cerulean. And finally, while the Guardians are super powerful and all, well, they're sort of all-knowing, interstellar douchebags so...\n\nWell, with all those things in mind, the result seems rather obvious, right?",
  "pros": null,
  "cons": null,
  "score": 977,
  "category": "Business",
  "image_url": "http://jewornotjew.com/img/people/g/guardians_of_the_universe.jpg",
  "created_at": "2025-03-29T12:53:06+02:00",
  "updated_at": "2025-03-29T12:53:06+02:00"
}