{
  "name": "Hank Azaria",
  "url": "http://jewornotjew.com/profile.jsp?ID=1205",
  "verdict": "Jew",
  "description": "Familiar to baseball fans is the concept of the Quadruple A player. Aspiring pros go through a series of minor leagues on their way to the majors. This begins with the aptly named Rookie Ball and then Single A, Double A, Triple A, and finally the Major Leagues. But every now and then a player comes along who gets caught between the moon (or in this case, Scranton or Buffalo) and New York City. Too good for the minors, this player crushes AAA, but every time they make the majors they flop like Chunk Cohen off the high dive. Thus the fictional AAAA level, the magical land meant for these players to play.\n\nBack in the 90s, we were big Hank Azaria fans. If there was a small-time, hilarious character on the Simpsons, you could bet your life they were voiced by Phil Hartman. But if there was another small-time hilarious character? Then that had to be Hank. He was also a bright spot whenever he guest starred on the sometimes watchable Mad About You and may very well have stolen the show as Agador in the American remake of Le Cage Aux Folles (aka, The Birdcage). He was so talented, so funny. Why wouldn't people give Azaria a bigger chance? \n\nOh. That's why.\n\nYes, fifteen years later we have our answer (side note: 1995 was over 15 years ago. Sweet shit). Asking Azaria to do anything more than be a side character is asking waaaaay too much. And sometimes even that little bit is asking too much. \n\nAt this point, our only wish is for there to be some sort of acting equivalent of the minors for us to relegate him to. Sure, he'll be undermatched, but at least he won't be flailing wildly right in front of us anymore. Perhaps the CW or the USA network would suffice?",
  "pros": null,
  "cons": null,
  "score": 1205,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/h/hank_azaria.jpg",
  "created_at": "2025-03-29T13:16:53+02:00",
  "updated_at": "2025-03-29T13:16:53+02:00"
}