{
  "name": "Hans Niemann",
  "url": "http://jewornotjew.com/profile.jsp?ID=3454",
  "verdict": "Not a Jew",
  "description": "A little over a year ago, the world of chess was rocked by a cheating scandal. At the center of it was unquestionable #1 Magnus Carlsen, then-world-champion (he's since abdicated because he got bored — REALLY!) and up-and-comer Hans Niemann.\n\nCarlsen played Niemann, Carlsen lost. It happens; even the greatest lose from time to time. But it was how Carlsen lost that raised all kinds of red flags.\n\nYou see, ever since Garry Kasparov lost to Deep Blue in the 1990s, computers have easily surpassed humans in chess. The engines are incredibly good now, suggesting moves that a human brain would not even consider. The best players — even Carlsen — go in step with the computer's suggestions very rarely. This is what Carlsen alleged — that Niemann's win was too computer-like. Too many of his moves mimicked the digital outcome. He must have cheated.\n\nThere's always been cheating in chess, even at high levels. Often, it includes bathroom breaks and a phone hidden in a stall (just like \"The Godfather\", but much lamer). Back in 1978, in the World Championship match, the Soviets were accused of cheating by bringing blueberry yogurt to defending champion Anatoly Karpov (you know what, with the Soviets, it's pretty clear it was code). But Niemann never cheated, he claimed! Well, in over-the-board chess.\n\nNiemann admitted to cheating in online games, when he was younger. Supposedly, the last time that happened was when he was 16. However, he was 19 at the time of the allegation, and you don't have to be a Carlsen-level genius to do the math. And if someone cheated in online chess, then...\n\nBut Niemann he didn't take any long bathroom breaks and didn't eat any yogurt! This brings us to... butt plugs. Yes, butt plugs.\n\nOf course, those familiar with this story were waiting for this punchline, so let's finally get to it. Even though chess players might be searched to make sure there are no signaling devices on them, no chess arbiter would ever consider exploring their nether regions... This is chess, not prison, after all. So, if one would insert a wi-fi-enabled butt plug (not the words we ever imagined we'd write, yet here we are), and receive computer-determined instructions via anal vibrations (again, such strange words we're writing!)...\n\nNiemann denied using butt plugs. Lawsuits followed that were eventually settled out-of-court. Carlsen is back kicking chess ass, while Niemann will forever be saddled with allegations.\n\nOh, and he is not Jewish. We'll leave the rest to ButtPlugOrNotButtPlug.com. (We just wrote those words!)",
  "pros": null,
  "cons": null,
  "score": 3454,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/h/hans_niemann.jpg",
  "created_at": "2025-03-29T13:17:51+02:00",
  "updated_at": "2025-03-29T13:17:51+02:00"
}