{
  "name": "Harry Anslinger",
  "url": "http://jewornotjew.com/profile.jsp?ID=1634",
  "verdict": "Not a Jew",
  "description": "Hey duuuude. It's been like... forever... and stuff... man. Wow. Like how are you man? Yeah? How's your glaucoma? Haw haw haw.\n\nSo, like, you're totally not gonna believe this, I was talking to... what was his name? Oh man... I was like, just thinking about him, but like, you know him. We used to play ultimate together?\n\nAnyway, we were talking about pot man and how the government just wants to keep us down and he was telling me about this dude named Harry Anslinger and how it's his fault that pot is still illegal and stuff.\n\nLike, back in the 30s Anslinger was, like, this big man down at the Federal Bureau of Narcotics. And he became convinced that like, weed was gonna be the next opium, man. Which, dude, have you tried opium? Dude that stuff is like... wow... My cousin was totally riding his bike downtown when he got totaled by some suit's car and, like, broke his collarbone and stuff? So he got a bunch of painkillers and like, I shared some? Wow, you've totally gotta try that man.\n\nAnyway, what was I saying?\n\nOh, right, Anslinger, man. So he totally makes this huge campaign about how the ganja turns people into murderers and makes teenage white girls get knocked up by African Americans and all this crazy stuff that was probably just the cotton industry trying to crowd out a competitor, man. \n\nSo now pot's illegal — except in Colorado which is bitchin except Colorado is like...really far away and stuff — and all because this one guy got really worked up about how bad the bud is. Except we all know that none of that stuff is true and actually pot is like this miracle drug that does all this cool stuff like...\n\nI forget...\n\nWhat were we talking about?",
  "pros": null,
  "cons": null,
  "score": 1634,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/h/harry_anslinger.jpg",
  "created_at": "2025-03-29T13:17:04+02:00",
  "updated_at": "2025-03-29T13:17:04+02:00"
}