{
  "name": "Harris Barton",
  "url": "http://jewornotjew.com/profile.jsp?ID=1929",
  "verdict": "Jew",
  "description": "For the opening of the NFL season, we decided to do something special. We went through all 32 NFL teams and found the best Jewish player in its history. For some franchises, it was very easy. For some, incredibly hard. The only caveat is that no player can repeat. So, without further ado, here's the NFC, with the AFC to follow tomorrow: \n\n\nNFC East\n\n\n\n\n\n\nNFC Central\n\n\n\n\n\n\nNFC South\n\n\n\n\n\n\nNFC West\n\n\n\n\n\n\n\n\n\n\n\n \n\n \n\n\n\n\n\n\n\nt = document.getElementById(\"tit\");\ni = document.getElementById(\"info\");\np = document.getElementById(\"pic\");\nn = document.getElementById(\"pla\");\nd = document.getElementById(\"dat\");\nbs = document.getElementsByName(\"but\");\nplayer = new Array(\"Igor Olshansky\", \"Benny Friedman\", \"David Smukler\", \"Wayne Millner\", \"Sid Luckman\", \"Karl Sweetan\", \"Charles Goldenberg\", \"Mike Rosenthal\", \"Adam Schreiber\", \"Geoff Schwartz\", \"Brad Edelman\", \"Erik Lorig\", \"Marshall Goldberg\", \"Herb Rich\", \"Harris Barton\", \"Sam McCullum\");\ndata = new Array(\n\"When he was with the Chargers, Olshansky was considered one of NFL's top defensive linemen. He signed a big-money deal with the Cowboys, and it was all downhill from there.\",\n\"Now that's more like it! The Giants are probably the Jewiest team in NFL history, with numerous Hebrews playing for them in the 1920s and 30s. And who better than record-setting Hall of Fame quarterback Friedman?\",\n\"The Eagles had a number Jews in the 1930s. The best of the bunch was Smukler, who played fullback and linebacker. Called the 'Temple Terror', but because of his alma mater, not a synagogue.\",\n\"One would think a franchise with such a \u003cs\u003eracist\u003c/s\u003e long history as the Redskins would field some Jews? Wrong! Once exception is Millner, an actual Hall of Famer who played both sides of the ball and was part of the NFL's all-decade team of the 1930s.\",\n\n\"The easiest selection out there. MVP, five-time All-Pro four-time champion, seven touchdowns in one game, Hall of Famer. Luckman is by far the best quarterback in the Bears history.\",\n\"Sweetan co-holds the unbreakable record for the longest pass, 99 yards. The Lions lost that game, 45-14. Doesn't that describe the club's entire history in a nutshell?\",\n\"Goldenberg was born in Ukraine, and played over a decade for the Packers at running back and guard. Three-time NFL champion, he was probably the only Jew to be nicknamed 'Buckets'.\",\n\"We previously said that Minnesota is where Jewish NFL careers come to die, but in reality, the Vikings have had more than their share of Jews. Lineman Rosenthal spent four years in the cold, cold state.\",\n\n\"Schreiber had a 15-year-long NFL career in the 1980s and 90s, spent as a backup center. He played for seven different teams, ending with three seasons in Atlanta.\",\n\"What is it with this run of offensive linemen? Pickings aren't exactly plenty in Carolina, so we'll go with Schwartz, who played three years with the Panthers.\",\n\"More offensive linemen? You got it! What about Pro Bowler Edelman, who spent eight seasons as a starter for the Saints?\",\n\"Lorig played four years with the Bucs before his recent switch to the Saints. A fullback, he has run the ball exactly ZERO times in the NFL.\",\n\n\"The Cardinals have one of the Jewiest histories in the NFL... Back when they were based in Chicago and fielded, among others, All-Pro running back Goldberg. Now in Arizona? You'd think the Jews would flock (it's a dry heat!), but not so much.\",\n\"Rich played seven years in the NFL, including three for the Rams. In his rookie season, he set the league record for punt return average. The rest of his career was spent at safety.\",\n\"Offensive tackle Barton won three Super Bowls with the 49ers and was named All-Pro twice. The competition is stiff, but, as far as Jewish linemen are concerned, he is up there.\",\n\"Born in Mississippi, raised in Montana, played wide receiver in the NFL. An unlikely a Jew as you will find, McCullum started for the Seahawks for five years.\");\nhp = new Array(1, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1);\nox = -1;\nfunction load(x) {\n  t.innerHTML = '';\n  i.style.display = 'block';\n  bs[x].style.color = '#0000AF';\n  if (ox != -1) bs[ox].style.color = 'gray';\n  ox = x;\n  n.innerHTML = player[x];\n  d.innerHTML = data[x];\n  loadPic(x);\n}\nfunction loadPic(x) {\n  who = player[x];\n  who = who.replace(' ', '_').toLowerCase();\n  w0 = who.charAt(0);\n  if (who == 'charles_goldenberg') who = 'charles_buckets_goldenberg';\n  src = 'img/people/' + w0 + '/' + who + '.jpg';\n  if (hp[x] == 0) src = 'img/other/nfl/' + who + '.jpg';\n  p.src = src;\n}",
  "pros": null,
  "cons": null,
  "score": 1929,
  "category": "Art",
  "image_url": "http://jewornotjew.com/img/people/h/harris_barton.jpg",
  "created_at": "2025-03-29T13:17:12+02:00",
  "updated_at": "2025-03-29T13:17:12+02:00"
}