{
  "name": "Harry Frazee",
  "url": "http://jewornotjew.com/profile.jsp?ID=1608",
  "verdict": "Not a Jew",
  "description": "The Red Sox sale of  Babe Ruth to the Yankees is the most famous transaction in the history of professional sports. It's also probably one of the most misreported. Let's see if we can get to the center to the story.\n\nRuth was a clear, once in a lifetime talent, who anyone would have been insane to trade: False. The Babe Ruth who played for the Red Sox was a good, not great, pitcher, whose numbers were merely above average for his era and were on the decline.\n\nRed Sox owner Harry Frazee was a nincompoop, more interested in Broadway than baseball: False. There is some debate about whether the Ruth money was used to finance No, No, Nanette or not. Frazee's motivation, however, is clear: Ruth was an out of control maniac whose behavior subtracted more from the team than his talent could add. He was suspended multiple times, injured himself acting stupidly, caroused and drank and womanized. He was Rasheed Wallace 1.0, not the alpha version of Michael Jordan.\n\nHarry Frazee was Jewish: Nope. But many of his fellow owners believed he was, secretly, and so they refused to deal with him. It was this, and not Frazee's poor management, that led to his eventual financial difficulties (the other teams essentially froze him out) and forced him to deal whatever assets Boston had to New York (the only team willing to treat with him).\n\nBabe Ruth, angered that the Red Sox dared to doubt him, forever cursed the team from winning: Nah. What kept Boston title-less for 86 years was a combination of remarkably poor management and parsimonious ownership. There was no curse. But if there was a curse, it would have been the Curse of Jackie Robinson, who had tried out for the Red Sox in 1945, only to be cursed off the field by (reportedly) the team owner. The Red Sox were the last team in Major League Baseball to integrate, and refused to carry more than token black players until the 1970s when the team finally became good again.\n\nCoincidentally, we're sure.",
  "pros": null,
  "cons": null,
  "score": 1608,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/h/harry_frazee.jpg",
  "created_at": "2025-03-29T13:17:03+02:00",
  "updated_at": "2025-03-29T13:17:03+02:00"
}