{
  "name": "Harry Styles",
  "url": "http://jewornotjew.com/profile.jsp?ID=1586",
  "verdict": "Not a Jew",
  "description": "In 1966, as part of an interview with the English equivalent of Tiger Beat, John Lennon declared that his band, the Beatles, were \"bigger than Jesus.\"\n\nWhat Lennon was saying (and had actually said before in other venues, when he wasn't claiming to actually be Jesus), was that organized religion was on the decline and other mediums such as art and music were overtaking the role of Christianity in organized society. A perfectly (wrong) acceptable philosophy in the late 1960s.\n\nWhat people took him to mean, however, was that Lennon was claiming his Beatles were more popular than Jesus. Whhhhhiiiiiiich, yeah, ok, they probably were at the time. \n\nThen the American South got a hold of it (proving that the more things change... ok, seriously, things just don't change) and decided that what Lennon actually meant was that the Beatles were more important and powerful than Jesus. So, yeah, that's when things went straight up nuts (to the point where Lennon may very well have been killed 14 years later by someone still stirred up by the statement).\n\nIn 2012, at a family gathering, our niece (who is now... 11 or so), declared with no sense of irony or self-awareness, that the band One Direction was, in fact, destined to be remembered as better than the Beatles. Better musically, better popularly, better attractively, better in all the ways that matter to 11-years-old or so girls.\n\nAnd, finally, in 2013, One Direction band member Harry Styles tweeted everyone a Happy Pesach. Thus, based on the mathematics we learned in 6th grade before we stopped paying attention, could we say that a Jew \u003e The Beatles \u003e Jesus?!\n\nNope. Despite the tweet, Styles is not Jewish.\n\nDarn.",
  "pros": null,
  "cons": null,
  "score": 1586,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/h/harry_styles.jpg",
  "created_at": "2025-03-29T13:17:03+02:00",
  "updated_at": "2025-03-29T13:17:03+02:00"
}