{
  "name": "Harry Sheezel",
  "url": "http://jewornotjew.com/profile.jsp?ID=3557",
  "verdict": "Jew",
  "description": "Let's say you want to pick a favorite Australian football team. Why? Because you decided to follow Australian football? No, that's not it. Perhaps you're researching an Australian football player for a JONJ profile? Sounds about right...\n\nSo how do you pick a team? Based on location? Good luck with that, there are nine AFL teams from Melbourne. Based on the coolest name? Yes!\n\nWe're going to dismiss those that share names with American teams from various sports: Lions, Blues, Suns, Giants, Hawks, Tigers, Saints, and Eagles. Bulldogs can take a hike, this is not high school football. \"Power\" sounds like an indoor soccer team or a neo-fascist organization. No to Power. Where does that leave us?\n\nWe start with the lovely Swans, but that's the problem. They are just too lovely. We are gonna nix the Bombers. They mean airplanes, but come on. The Dockers? Better than the Packers, we give you that. The Magpies? Who wants to imitate a thieving bird? The Cats... just not cool enough.\n\nThis leaves us with the three finalists: the Crows, the Demons, and the Kangaroos. Yeah, we're gonna go with Kangaroos. It's Australian football, after all!\n\nNorth Melbourne Football Club, known as the Kangaroos, is one of the oldest sports clubs in the world, dating all the way back to 1869. (Or even earlier! They are not sure.) Their last championship came in 1999. Of course, the reason for this profile is not exactly their cool nickname... It's Harry Sheezel, who is Jewish and is one of the best young players in all of Australia. He was AFL's Rising Star winner in his rookie season.\n\nAnd, yeah, he plays for the team with the coolest name. Sorry, Swans!",
  "pros": null,
  "cons": null,
  "score": 3557,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/h/harry_sheezel.jpg",
  "created_at": "2025-03-29T13:17:54+02:00",
  "updated_at": "2025-03-29T13:17:54+02:00"
}