{
  "name": "Heidi Fleiss",
  "url": "http://jewornotjew.com/profile.jsp?ID=922",
  "verdict": "Jew",
  "description": "Many of Judaism's oldest, most important traditions have fallen by the assimilationist wayside. For instance, the (previously mentioned in the Patti Stanger profile) matchmaker.\n\nBest remembered in the popular consciousness due to Yenta from Fiddler on the Roof (and misidentified forever more. \"Yenta\" actually means busybody or gossip. \"Shadchen\" is the correct Yiddish word for matchmaker), the matchmaker played an integral part in the \"old country\" Jewish community — making appropriate matches, finding finds, catching catches. That's how the song goes anyway (and now you have it stuck in your head, just like us. Enjoy!).\n\nAs we've previously written, at the time, this was the only way a young man could meet his future henpeck... love of his life. Of course, these days we've done away with the silly old ways and instead randomly meet each other at bars (where we're too drunk to see and it's too loud to hear) or over the Internet (where... gah, you don't want to know what goes on there). Then we attend endless dinners, movies, live animal sacrifices only then to discover that we'd rather peel our own skin like that of a banana than spend another waking minute with the other person. This is progress? \n\nSo we choose not to see Heidi Fleiss — the 90's Madam for the rich and famous — as a purveyor of whores. Rather, she is simply continuing on with the Jewish matchmaking tradition of old: taking young, available men and setting them up with the gorgeous fantasy woman of their dreams.\n\nOf course, neither the men nor the women were necessarily Jewish. Or interested in getting married. Or weren't already married themselves...\n\nOK, so maybe it's a bit of a stretch. But considering how much Ms. Fleiss has parlayed one early-90's indiscretion into a \"career\" we figured she would appreciate another such improbable leap of logic.",
  "pros": null,
  "cons": [
    "idering how much Ms. Fleiss has parlayed one early"
  ],
  "score": 922,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/h/heidi_fleiss.jpg",
  "created_at": "2025-03-29T12:53:05+02:00",
  "updated_at": "2025-03-29T12:53:05+02:00"
}