{
  "name": "Hipes",
  "url": "http://jewornotjew.com/profile.jsp?ID=2708",
  "verdict": "Barely a Jew",
  "description": "Today, we're not going to profile a person, a place, an animal, or even a delicious sandwich. (We've done all those!) We're going to profile a process. Is this the strangest profile in JONJ history? It might just be...\n\nThe process is hipes. Not hips, or hippies, or hives. Pronounced khee-pes. Hard h. It was a concept popularized in Eastern Europe at the turn of the 20th century. To explain it in one phrase, hipes is \"theft with the help of a prostitute\".\n\nBut hipes is not just your ordinary theft with the help of a prostitute! It's an elaborate scheme involving multiple people, real estate, animal sounds, and a chair. The chair is very important.\n\nAs any robberies with the help of a prostitute, hipes starts with a client meeting a... prostitute. Only she doesn't present herself as one; she is a widow or a divorcee... a respectable woman in search of companionship. She is called a \"cat\". Also involved is her pimp (\"tomcat\") and a \"hostess\", who rents an apartment in a good part of town. The apartment has three key features: a room with a hidden entrance, a curtain, and a chair.\n\nThe \"cat\" takes her new friend to the apartment, he places his clothes on the chair, and the two enjoy each other's company. He follows her behind the curtain. Meanwhile, the \"tomcat\" sneaks into the room through the hidden entrance, and makes way with the client's wallet. When the \"cat\" hears barking or meowing, that means the deed is done and they can come back through the curtain.\n\nThen, the \"cat\" suddenly realizes that she has to be somewhere, or perhaps the not-so-divorced husband is due for a return. The client quickly gets dressed, and potentially wants to offer payment for services rendered. The \"cat\" ensures him that none is needed — after all, they are just two adults sharing each other's company, and the client departs on amicable terms.\n\nIs it over? Often, but sometimes the client realizes after exiting that his wallet is gone. He quickly rushes back to the apartment... and is now greeted by a confused \"hostess\", with all the furniture completely rearranged. (The famous chair has been removed.) Perplexed, the client goes home, and that is hipes!\n\nSo why did we just explain this old and strange (be it, rather interesting) process? Well, the untranslatable hipes is a Yiddish word!\n\nStrange, we know.",
  "pros": null,
  "cons": null,
  "score": 2708,
  "category": "Business",
  "image_url": "http://jewornotjew.com/img/people/h/hipes.jpg",
  "created_at": "2025-03-29T13:17:31+02:00",
  "updated_at": "2025-03-29T13:17:31+02:00"
}