{
  "name": "Iceman",
  "url": "http://jewornotjew.com/profile.jsp?ID=1172",
  "verdict": "Borderline Jew.",
  "description": "1993. Spring. A tree-lined street in suburbia. Scott Summers, wearing a business suit and sunglasses, enters the house, carrying a briefcase and a pack of unopened mail. His wife, Jean Grey, a statuesque beauty with long red hair tied in a ponytail, is in the kitchen, wearing an apron, chopping onions.\n\nScott: Honey, I'm home!\n\nJean runs up to him and gives him a peck on the cheek.\n\nJean: Dinner will be ready in a minute, honey!\n\nScott throws the briefcase on the kitchen table, pulls out a chair and slouches on it, leafing through the mail.\n\nScott: Bill, bill, sweepstakes...\n\nHe crumbles up the last letter and throws it into a trash can. The ball of paper lands on the floor. Scott removes his sunglasses, letting out a beam that incinerates the paper.\n\nJean: Honey, I asked you not to do this at home.\n\nScott: Sorry, honey.\n\nJean sighs, taking out a broom and dustpan. Scott continues leafing through the mail.\n\nScott: Hmmmm. This is interesting.\n\nJean: What is it, honey?\n\nScott rips open an envelope and quickly glances at the letter.\n\nScott: An invitation. From Bobby.\n\nJean: An invitation? For what?\n\nScott: Pesach!\n\nJean: (mispronounces) Pe-sach?\n\nScott: Listen to this, honey. (reads from letter) Don't be passed over! On April 6th, celebrate Pesach by joining your friends for First Sedar at the Drake household. Food, games, and ice cold drinks!\n\nJean: Since when is Bobby Jewish? I thought he was Catholic.\n\nScott: I think his mom might have been Jewish.\n\nJean: Well, that's the first I've heard of it.\n\nScott: (sighing) So, I guess we have to go to this...\n\nJean: Really, honey? We do? You know how I hate going to Bobby's house... It's freezing there! Plus he's so moody ever since Lorna dumped him...\n\nScott: Well, how it will look it we will be the only ones not there? What will the Professor say?\n\nJean: But...\n\nScott stands up from his chair, walks over to Jean, and kisses her on the mouth.\n\nScott: Come on, honey. It's just a Jewish holiday. How long can this Sedar take? Hour, hour thirty tops. We'll be out of there before you know it.\n\nJean: Okay...\n\nScott: That's my girl.\n\nJean: Okay, I'll go, but under one condition.\n\nScott: Name it.\n\nJean: Keep that Logan away from me. You know how he gets when he starts drinking.\n\nScott: You got it, honey.",
  "pros": null,
  "cons": null,
  "score": 1172,
  "category": "Academia",
  "image_url": "http://jewornotjew.com/img/people/i/iceman.jpg",
  "created_at": "2025-03-29T13:16:52+02:00",
  "updated_at": "2025-03-29T13:16:52+02:00"
}