{
  "name": "Ignatius Trebitsch-Lincoln",
  "url": "http://jewornotjew.com/profile.jsp?ID=758",
  "verdict": "Barely a Jew",
  "description": "They don't make people like Ignatius Timothy Trebitsch-Lincoln anymore.\n\nBorn Ignacz Trebitsch to an Orthodox Jewish family in Hungary, as a teenager he went to the Royal Academy of Dramatic Arts, got in trouble for theft, and fled to England. There, he met some missionaries, got baptized, and started studying for a life in priesthood.\n\nYou think you know where this is headed? Think again.\n\nMissionary work took young Ignatius to Canada, only for him to return to England over a salary dispute. There, he befriended the Archbishop of Canterbury, became a secretary of a chocolate magnate, and got elected into Parliament.\n\nSo what's next? Tea and chocolate crumpets with the king? Not even close.\n\nBroke, Trebitsch couldn't stand for re-election, and went to Romania, trying to make money in oil. World War I broke out, so he offered his services to England as a spy. The English rejected him; the Germans didn't. The English caught on, captured Ignatius, and sent him to prison for three years.\n\nDoes a life of remorse and rehabilitation follow? You don't know Trebitsch-Lincoln.\n\nDeported, now in Germany, Igantius made friends with right-wing radicals, including a young Adolf Hitler. After a failed putsch, he was charged with high treason, and deported once again.\n\nBy now, you get the picture...\n\nIgantius ended up in China, serving under three warlords. Then, he converted once again, this time to Buddhism, becoming a monk under the name of Chao Kung. He got his own monastery. He seduced nuns. That last part doesn't seem surprising, all things considering.\n\nAnd yes, there is more.\n\nOff to Japan Trebitsch went, producing anti-British propaganda. After World War II started, he contacted his good old friends the Nazis, and offered his help in rising up the Buddhists of Asia on their behalf. Himmler was on board, Hess was on board, and then...\n\nIgantius died in 1943.\n\nNo, they don't make people like Ignatius Timothy Trebitsch-Lincoln anymore.\n\nAnd that's a good thing.",
  "pros": null,
  "cons": [
    "idering.\n\u003c/p\u003e\u003cp\u003e\nAnd yes, there is more.\n\u003c/p\u003e\u003cp\u003e\nOff to Japan Trebitsch went, producing anti"
  ],
  "score": 758,
  "category": "Religion",
  "image_url": "http://jewornotjew.com/img/people/i/ignatius_trebitsch-lincoln.jpg",
  "created_at": "2025-03-29T12:53:01+02:00",
  "updated_at": "2025-03-29T12:53:01+02:00"
}