{
  "name": "Isaac the Jew",
  "url": "http://jewornotjew.com/profile.jsp?ID=2002",
  "verdict": "Jew",
  "description": "\"Where's my elephant?\" — Bart Simpson Charlemagne\n\nMy dearest Miriam,\n\nIn my last letter, I mentioned the passing of Lantfrid. Well, we buried Sigismund last night. Abul helped dig the grave, and I said kaddish. I know Sigismund wasn't Jewish, but I don't know any goyishe prayers. Something about Jesus, I guess? It doesn't matter. Sigismund is gone. Kaddish will do.\n\nSo now it's just Abul and me. Abul and me, in the middle of this damned desert. I'm sorry to swear, dearest Miriam, but I have no better words to describe it! It's damned hot, it's damned vast, it's damned dry, and there are damned scorpions! It's just damned!\n\nAbul doesn't mind the heat, but one scorpion bit him in the toe. He screamed for a bit, but now he's stopped. The bite mark bloated to the size of my fist. Poor Abul.\n\nBaghdad is a city of contrasts. Magnificent palaces stand next to dirty slums. I got you a gift, a local specialty, dearest Miriam! They call it hepatitis. I hope you'll enjoy it.\n\nThe caliph welcomed us nicely, but I'm not even sure he has heard of the Franks. I tried to explain to him that we are a great nation in the northwest, but he looked at me with confused eyes. Then he went to his harem. He has a large harem.\n\nIn any case, the caliph gifted us our elephant. They call him Abul-Abbas, which I think means \"big gray rat\". I just call him Abul.\n\nAbul has a giant nose, much like your uncle Ruben. Unlike your uncle, he can use the nose to pick up things and wash himself. It really is something to see! Once he tried to pick up Sigismund. Poor dead Sigismund.\n\nSoon, this desert will end, and we will make it to the Central Sea. There, I will attempt to charter a boat to get us back to the Empire. I hope the great king enjoys his gift, if I ever make it back. I will make it back, dearest Miriam! Don't you worry! I'll make sure of it!\n\nIs Saul keeping up on his studies? Did Simon stop wetting the bed? Did Sarah's husband stop beating her? I kept telling her, just be an obedient wife! She never listens, that Sarah. She has a lot of you in her, dearest Miriam.\n\nI keep wondering, will history remember me? Here I am, traveling into the East, exploring lands and cultures, suffering all kinds of hardships, bringing a big gray rat back to the greatest king of all time. Will future generations know my name? Or will I just be, the Jew who brought an elephant to Charlemagne? We can only guess, dearest Miriam.\n\nYour loving husband,\n\nIsaac\n7th of Tevet, 4561",
  "pros": null,
  "cons": null,
  "score": 2002,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/i/isaac_the_jew.jpg",
  "created_at": "2025-03-29T13:17:13+02:00",
  "updated_at": "2025-03-29T13:17:13+02:00"
}