{
  "name": "Isakas Anolikas",
  "url": "http://jewornotjew.com/profile.jsp?ID=3543",
  "verdict": "Jew",
  "description": "Sometimes we lurk through the thousands of profiles on this website (or click the handy \"Surprise Me!\" link) and ask ourselves, who is this person? Why did we profile them in the first place? This is especially true if we land on one of our obscure Olympic profiles. Who remembers the Australian table tennis guy or the Argentine handball guy? Not even us, and we wrote those things!\n\nSo why are we back profiling a rather obscure Olympian? Well, Isakas Anolikas is Lithuania's first individual Olympian. Ever.\n\nWe have to stick that \"individual\" in there, because Lithuania's first Olympic appearance, in Paris in 1924, actually started with its soccer team losing 9:0 to Switzerland. (This is still Lithuania's best appearance at a soccer tournament. They are not very good at soccer.) That team actually featured a Jew, Leon Gelerman, but he didn't play. (Hard to imagine it ending worse.)\n\nSo let's move on to the cycling competition, where two Lithuanians entered: Isakas Anolikas and Juozas Vilpisauskas. We're concerned with Anolikas, of course. He was a multiple Lithuanian champion and a member of the Makabi club from his hometown of Siauliai. Anolikas didn't exactly fare well at the Olympics, failing to finish the race. (His countryman didn't either.) Anolikas came back to the Olympics four years later in Amsterdam and... did not finish again. His bike broke down!\n\nStill, Anolikas remains an integral part of Lithuanian sport history. (They would have to wait until 1992 to earn their first medal.) As for his fate, it was par the course for the time. Anolikas was one of 50,000 Jews killed by Nazis in the Ninth Fort in Kaunas, known as the \"Fort of Death\".\n\nWe need to remember Isakas Anolikas.",
  "pros": null,
  "cons": null,
  "score": 3543,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/i/isakas_anolikas.jpg",
  "created_at": "2025-03-29T13:17:53+02:00",
  "updated_at": "2025-03-29T13:17:53+02:00"
}