{
  "name": "Jack Nicholson",
  "url": "http://jewornotjew.com/profile.jsp?ID=1132",
  "verdict": "Not a Jew",
  "description": "Could Jack Nicholson be Jewish? On the surface, no. He has Irish, English, and Dutch heritage, with no hints of Jewishness anywhere. So we'll have to dig underneath the surface.\n\nTo do that, we must figure out the mystery of Jack's father. The Irish/English/Dutch roots come from his sister's... make that his mother's side, while the identity of his father is not exactly readily available. (Jack was raised by his grandmother, and did not know who his real mother was until she passed on.)\n\nNow, one biographer proclaims that Jack's father was one Eddie King. King was born in Latvia, played the piano on a German liner, and sneaked away to the US while the ship was docked in New York. He started a dance studio, and one of his young dancers was June Nicholson, who, at the age of 17, had a tryst with her manager. King missed the birth of his supposed son because he was awaiting deportation, and by then, Jack's mother not only married another man, but decided to pass herself for her son's sister. Oh, youthful indiscretions!\n\nEddie King's name at birth? Edgar Kirschfeld, which, apparently, leads some to believe that Jack is half Jewish.\n\nBut when one gets down to it, that argument seems flimsy at best. For one, there is no proof that King really was Jack's father. And even if he was, there is absolutely nothing to suggest he was Jewish, other than the quasi-Jewish last name. We do know that he died a Episcopalian, which doesn't discount Judaism at birth, but makes it more unlikely.\n\nBut, perhaps most importantly, no matter who his father was, Jack was raised Catholic and now mostly worships at the altar of the nubile twenty-something. But we won't be digging underneath that surface.",
  "pros": null,
  "cons": null,
  "score": 1132,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/j/jack_nicholson.jpg",
  "created_at": "2025-03-29T13:16:51+02:00",
  "updated_at": "2025-03-29T13:16:51+02:00"
}