{
  "name": "Jaclyn Smith",
  "url": "http://jewornotjew.com/profile.jsp?ID=1035",
  "verdict": "Borderline Jew.",
  "description": "Today, we're gonna talk about \"Charlie's Angels\".\n\n\"Oh, sure!\", faithful reader exclaims. \"I know how this goes! Today we're gonna find out which angel is Jewish! And my money is on Jaclyn Smith, it's her profile, after all!\"\n\nNot so fast, faithful reader. For today, we're not going to look for a Jewish angel (at least not yet), but rather... well, bear with us.\n\nSo, \"Charlie's Angels\": a totally ridiculous, unforgivably dumb 70s TV show (in an era where TV was dumb and ridiculous, it was at the top... make that bottom of the heap) about three female private investigators: Farrah Fawcett (meh), Kate Jackson (better), and Jaclyn Smith (hello!). Each episode, they would go undercover, wear skimpy outfits, and solve crimes. You know, a usual day's work for your common detective.\n\nIn any case, Fawcett famously quit the show after the first season, then Jackson left, and there were numerous replacements. The show lasted five seasons, and was resurrected on the big screen in 2000, with Cameron Diaz (meh), Lucy Liu (more meh), and Drew Barrymore (goodbye!) taking on the roles in the film (it actually wasn't THAT bad) and its beyond terrible sequel.\n\nSo that's it for \"Charlie's Angels\"? Not so fast. Since TV writers are out of ideas, it just might be making a return. This time, the angels are Minka Kelly (not bad at all), Rachael Taylor (who? well... ok), and Annie Ilonzeh (seriously? who?). Needless to say, we're not watching.\n\nAlright, faithful reader. You're not here to read our appraisal of the feminine quality of various actresses. You're here to find out why exactly we are profiling Jaclyn Smith. Turns out she is half Jewish! Yes, even though she came from Texas and is named Smith. Her father was a dentist... that should have been your first hint.\n\nSo, while we're not sure if Jaclyn can be called the Jewiest angel of all time, she'll just have to settle for the title of the hottest angel of all time. (Yes, we finally got to the point!)",
  "pros": null,
  "cons": null,
  "score": 1035,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/j/jaclyn_smith.jpg",
  "created_at": "2025-03-29T13:16:49+02:00",
  "updated_at": "2025-03-29T13:16:49+02:00"
}