{
  "name": "Jacob",
  "url": "http://jewornotjew.com/profile.jsp?ID=1411",
  "verdict": "Jew",
  "description": "According to the Bible, the first man (y'know, like, ever) was Adam. The first man to believe in the one G-d was Abraham. The first man to ever stub his toe on his coffee table on the way to using the bathroom at 2 AM was Hezekiah. And the first ever, honest-to-Hashem, Jew was... Jacob, who G-d renamed Israel (sound familiar?) as a sign of his new commitment to the faith.\n\nAnd just who was this first ever Jew, exactly?\n\nWell, let's see. After failing to extort his brother's birthright out of him (withholding food when Esau came home exhausted from hunting), Jacob conspired with his mother to deceive his father and steal the darned thing anyway.\n\nThen, because he was such a heroic figure and all, Jacob absconded to live with his uncle and fell in love with one of his (ugh) cousins. But when told he couldn't marry his love because her elder (ugly) sister had to be married first, Jacob chose simply to marry both of them. \n\nNow that Jacob had his family, he decided to reconcile with his (justifiably) angry brother, only to chicken out at the last minute and hide in the desert. When an angel came to drag the pusillanimous prophet back to his responsibilities, Jacob fought the feathery bastard till the angel hurt Jacob's leg so bad he had no choice but to cowboy up and apologize for being such a douchebag. \n\nMeanwhile, just because wife #1 was ugly didn't stop Jacob from shtupping her pretty much 24/7 as evidenced by his six sons and one daughter by her. He then moved on... to two servant women, fathering four more sons. And when he finally deigned to sleep with the pretty wife he supposedly loved and had a child with her, he loved that kid so much — to the exclusion of his other children — that they felt their only recourse was to throw the kid in a ditch, sell him to slavery, and tell dear old dad that their youngest brother was dead.\n\nSeriously? SERIOUSLY?! This is the father of our people; our forebearer from whom we are to take both our name and our instructions on how to live a Jewish and holy life. \n\nLord, this religion is stupid sometimes...",
  "pros": null,
  "cons": null,
  "score": 1411,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/j/jacob.jpg",
  "created_at": "2025-03-29T13:16:58+02:00",
  "updated_at": "2025-03-29T13:16:58+02:00"
}