{
  "name": "Jacques Derrida",
  "url": "http://jewornotjew.com/profile.jsp?ID=1579",
  "verdict": "Jew",
  "description": "\"... And Rene Descartes was a drunken fart, 'I drink therefore I am.' Yes, Socrates himself is particularly missed. A lovely little thinker but a bugger when he's pissed.\" — Eric Idle, \"Bruce's Philosophers Song\"\n\nIn 1992, the University of Cambridge announced they would be conferring an honorary doctorate on philosopher, writer, and Jew Jacques Derrida. 19 of Derrida's fellow philosoph-ites wrote in to protest. Antisemitism rears it's ugly head once again? Nope. Another case where nominally intelligent people failed to see a set of obvious benefits? Nah.\n\nDerrida, they claimed, was not deserving of the distinction because his work was incomprehensible. \n\nUmmmmm... yeah... well, this shouldn't be too hard, right? Derrida was a proponent of deconstructionism. His idea was that essentially, there is no inherent meaning in anything save the hierarchies created by its oppositions? Sort of? So, basically, words themselves have no meaning, but instead form a code that must be by examined for its intrinsic contrast in order to understand the greater message?\n\nYeah, we got nothing. Derrida may have been a great philosopher and a great Jew. He may even have deserved that doctorate. But when your ideas are so dense that even other philosophers don't get it, you've clearly gone a little off the deep end.",
  "pros": null,
  "cons": [
    "tructionism. His idea was that essentially, there is no inherent meaning in anything save the hierarchies created by its oppositions? Sort of? So, basically, words themselves have no meaning, but instead form a code that must be by examined for its intrinsic contrast in order to understand the greater message?"
  ],
  "score": 1579,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/j/jacques_derrida.jpg",
  "created_at": "2025-03-29T13:17:03+02:00",
  "updated_at": "2025-03-29T13:17:03+02:00"
}