{
  "name": "James the Just",
  "url": "http://jewornotjew.com/profile.jsp?ID=3318",
  "verdict": "Sadly, a Jew.",
  "description": "Did Jesus have brothers? Sure, if you listen to the goyim (you shouldn't), Jesus had brothers! Well, it depends to which goyim you listen to. And how you define the word \"brother\". Maybe Jesus didn't have brothers? Come on, goyim, make up your mind!\n\nAt least two books of the New Testament mention four brothers of Jesus: Joses, Simon, Jude, and the most famous of them, later saint James (the Just). But this is where it gets fuzzy. You see, Christians can't exactly agree on how exactly they were related to their main dude.\n\nOption 1: They were all, you know, brothers. Children of Mary and Joseph, as was Jesus. This is a non-starter for the goyim.\n\nOption 2: The four guys were all children of Mary and Joseph, making them half-brothers of Jesus, because, you know, he had a different father with the immaculate conception and what not. Seems a logical goyishe answer, except...\n\nOption 3: Mary was a virgin until death! Yes, many goyim actually believe that. So she spent the rest of her life living a life of celibacy? We guess that after having G-d put one past you, Joseph would be a step down... (Or maybe Mary was a lesbian. But we digress. Do we digress?) In any case, this scenario has the four guys as Joseph's children from a previous marriage, making them Jesus' stepbrothers. We're getting there.\n\nOption 4: If you thought suggesting Mary lived out her life as a virgin was ridiculous, get a load of this: so did Joseph. So the four guys were the children of Mary's sister, named... Mary and a dude named Clopas, which would make them Jesus' cousins. And if you think it's not likely that Mary had a sister named Mary, a side option has Clopas as Joseph's brother, married to, well, Mary. Not Jesus' mom Mary or her (in this theory, nonexistent) sister Mary! Some other, random Mary. Jesus H. Christ, how much more ridiculous can this get!?\n\nDid Jesus have sisters? Don't get us started...",
  "pros": null,
  "cons": null,
  "score": 3318,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/j/james_the_just.jpg",
  "created_at": "2025-03-29T13:17:48+02:00",
  "updated_at": "2025-03-29T13:17:48+02:00"
}