{
  "name": "Jaron Lanier",
  "url": "http://jewornotjew.com/profile.jsp?ID=3143",
  "verdict": "Jew",
  "description": "Imagine: you're sitting in a cafe in Paris. You order a pain au chocolat, because you are, in, you know, Paris. Also, a large latte, because while you are in Paris, those fancy European drinks are just too tiny. The weather is just perfect, spring is in midseason. A mime performs on a street corner, because you are in, you know, Paris. You put on your headphones to listen to your favorite musician, Michael Bolton.\n\nYou people-watch. Here is a nice, obviously French family. They boy has a big red balloon. Wait a minute... isn't that Mr. Carroll, your high school physics teacher? You thought he died years ago in a boating accident! No, that's definitely Mr. Carroll, hard to recognize without a lab coat... He does look a lot younger than... how old would he be now? 90?\n\nAnd here is Jimmy, your best friend from kindergarten! What a coincidence! You haven't seen Jimmy in three decades, and he is right here, at your table. Hi, Jimmy! Would you like a pan au chocolate? No, Jimmy orders spaghetti and meatballs. How has your life been, Jimmy? Oh, here is your lovely wife Vanessa, your four children and your dog Rover! No, Jimmy, I do not need to buy life insurance. Can't I just enjoy Paris, Jimmy? Jimmy, I don't want to hear about the Jewish-run media. Turn off! TURN OFF!\n\nYou rip off your VR headset and toss it in the corner. Paris is gone. Thankfully, so is Jimmy.\n\nThat is our future, and it's coming faster than you think. Boy, you wish you could taste that pain au chocolat...\n\nJaron Lanier is sometimes called \"the father of virtual reality\" for his pioneering work on VR goggles in the 1980s. He has since been outspoken about the pervasiveness of social media.",
  "pros": null,
  "cons": null,
  "score": 3143,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/j/jaron_lanier.jpg",
  "created_at": "2025-03-29T13:17:43+02:00",
  "updated_at": "2025-03-29T13:17:43+02:00"
}