{
  "name": "Jay Sherman",
  "url": "http://jewornotjew.com/profile.jsp?ID=251",
  "verdict": "Borderline Jew.",
  "description": "Allow us to be serious for a moment. We're going to talk about adoption. And we're going to use a character from an obscure animated series to do so.\n\nJay Sherman was \"The Critic\". Jay Sherman looked, talked, and acted Jewish. Jay Sherman was played by Jewish actor Jon Lovitz. But Jay Sherman was adopted as a baby. By a WASP family. So, as far as his upbringing was concerned, he wasn't Jewish at all. Talk about hilarious mismatches.\n\nYou see, we often talk about the percentage of Jewish blood on this website. He has one Jewish grandparent! She is Jewish on her father's side! Etc. What we don't consider in this discussion is the possibility of adoption. If that one Jewish ancestor was adopted, then the whole line might be cut off. Our subject is no longer the descendant of Abraham. He is the descendant of John Johnson, methodist priest. Or Trond Petterson, viking. Or Jurgen von Klusendorf, pig butcher. You get the idea.\n\nOf course, in those cases, if the person feels attachment to the Jewish roots that were never really there, who are we to judge? Especially since there might always be another Jew somewhere on the family tree.\n\nBut what do we do in the opposite case, what do we do with Jay Sherman?\n\nAh, who cares. After all, he is just a character from an obscure animated series.",
  "pros": null,
  "cons": [
    "ider in this discussion is the possibility of adoption. If that one Jewish ancestor was adopted, then the whole line might be cut off. Our subject is no longer the descendant of Abraham. He is the descendant of John Johnson, methodist priest. Or Trond Petterson, viking. Or Jurgen von Klusendorf, pig butcher. You get the idea.",
    "Of course, in those cases, if the person feels attachment to the Jewish roots that were never really there, who are we to judge? Especially since there might always be another Jew somewhere on the family tree.",
    "But what do we do in the opposite case, what do we do with Jay Sherman?",
    "Ah, who cares. After all, he is just a character from an obscure animated series."
  ],
  "score": 251,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/j/jay_sherman.jpg",
  "created_at": "2025-03-29T12:52:48+02:00",
  "updated_at": "2025-03-29T12:52:48+02:00"
}