{
  "name": "Jennifer Beals",
  "url": "http://jewornotjew.com/profile.jsp?ID=2792",
  "verdict": "Not a Jew",
  "description": "Adam Sandler's Chanukah Song was definitely one of the inspirations for this website, but it's not without some mistakes...\n\"The owner of the Seattle Supersonic-ahs\"\nWe start obscure. In 1994, when the original song came out, Seattle's NBA team was owned by the goyishe Barry Ackerley, who did not like the mistake and actually confronted Sandler about it. He then sold the Sonics to the Jewish Howard Schultz... and the Sonics no longer exist, so the obscurity is lost to history.\n\"Hall-of-famer Rod Carew (he converted)\"\nProbably Sandler's most well-known mistake. As mentioned in his profile (which references the song, natch), Carew never converted.\n\"Harrison Ford's a quarter Jewish — not too shabby!\"\nDefinitely not too shabby: he is half!\n\"The girls from Veruca Salt\"\nWe move on to Part II (1999), with a now-rather esoteric reference to Veruca Salt, an alt rock band from the 90s. The girls in question are Nina Gordon, who is Jewish, and Louise Post, who is not. An easy fix for Sandler, who can just singularize \"girls\".\n\"Courtney Love is half too\"\nOoomph. This one got us as well, so it's completely understandable. Love had claimed that she is Jewish, but turns out she is a quarter, not a half.\n\"Flash dancer Jennifer Beals\"\nAgain, hard to blame Sandler. Beals, the start of \"Flashdance\", claimed in an interview that she \"wanted to be Jewish\" (and who can blame her!), but she is not. She does have a Jewish stepfather, for all that's worth.\n\"The guy who does the voice for Scooby Doo\"\nYes, \"Doo\" rhymes with \"Jew\". Alas, the guy who did the voice for three decades, Don Messick, was not. It doesn't look that any of the ones that followed Messick were Jewish either, so maybe Adam needs to find a better rhyme...\n\nInterestingly, all of these mistakes come from the song's early incarnations. His latest, Part IV (2015), is mistake-free. Perhaps Sandler was inspired by this website?",
  "pros": null,
  "cons": null,
  "score": 2792,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/j/jennifer_beals.jpg",
  "created_at": "2025-03-29T13:17:34+02:00",
  "updated_at": "2025-03-29T13:17:34+02:00"
}