{
  "name": "Jerome Horwitz",
  "url": "http://jewornotjew.com/profile.jsp?ID=1581",
  "verdict": "Jew",
  "description": "A long time ago, on a shtetl far, far away, some of us here at JONJ used to work on medications for HIV. The job itself was lousy (we once almost got hit by a bus on our way to the office and were brought to tears... because the bus missed), but working on one of the most devastating diseases in human history was quite an honor, actually.\n\nPart of that was getting to speak to people with HIV who would tell us that eventually their condition would be like diabetes or high cholesterol — take a pill every day and live your life like anyone else.\n\nThat was over a decade ago. Nowadays, ask someone with HIV what it's like to live with the disease and they'll tell you \"it's just like diabetes or high cholesterol — I take a pill every day and live my life, just like anyone else.\"\n\nWow. What brought about this change? Would you believe a Jew?\n\nWell, not exactly. In 1964, the 100% Hebrew Jerome Horwitz invented AZT, or zidovudine, the first ever NRTI (nucleoside reverse transcriptase inhibitor). He created it to treat cancer. But in the mid-1980s, when people started to care about HIV, they found that Horwitz's discovery (along with two other NRTIs he discovered) were effective in treating the virus.\n\nAnd those drugs helped people with HIV live long, healthy lives right? Well, no. First they developed NNRTIs (non-nucleoside reverse transcriptase inhibitors) and PIs (protease inhibitors), neither of which Horwitz had anything to do with. Those drugs, when dosed in combination, were able to keep people with HIV healthy for long enough that they could look forward to dying from heart attacks or cancer like everyone else.\n\nStill, Horwitz started the process and certainly extended any number of lives. His reward for his amazing act? There's a school named after him in the Captain Underpants books. Although that may be for Curly from the Three Stooges. Well, anyway, at least it's better than getting hit by a bus.",
  "pros": null,
  "cons": null,
  "score": 1581,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/j/jerome_horwitz.jpg",
  "created_at": "2025-03-29T13:17:03+02:00",
  "updated_at": "2025-03-29T13:17:03+02:00"
}