{
  "name": "Jerry Buss",
  "url": "http://jewornotjew.com/profile.jsp?ID=3378",
  "verdict": "Not a Jew",
  "description": "If one watches HBO's \"Winning Time: The Rise of the Lakers Dynasty\", one must do it with a heavy grain of salt, treating it as fiction with some basis in reality. Still-alive Lakers such as Jerry West, Magic Johnson, and Kareem Abdul-Jabbar have spoken about misrepresentation of their portrayals (West, shown as a bombastic misanthrope, probably got it worst), but it goes beyond personalities.\n\nSome facts have been changed for very strange reasons. For example, in Magic's rookie season, the Lakers are shown to be blown out by the Detroit Pistons in a Christmas Day game. Well, the Lakers never played at Detroit then, actually crushing the Pistons by 23 points in January. (This is not ancient history! Anyone can easily look it up — we just did!)\n\nWhich brings us to Jerry Buss, the Lakers owner around whom the series revolves. (Buss is dead, so he can't really comment on his portrayal.) In a Season Two episode, Buss marries a woman named Honey... Well, that never happened.\n\nIn real life, Buss, a notorious playboy, was married at least once, and probably twice. (Potentially, in 1972, he was married to two women at the same time!) His (probable) last marriage ended in 1980, so there is no way he could have married someone named Honey in 1982, as the show depicts.\n\nAnother reason he could not have married Honey? She is not real! For some reason, the creators of \"Winning Time\" decided to create a composite character from Buss' many paramours... and have him marry her.\n\nSo, when you see Buss stepping on a glass and think, could he possibly be Jewish? The answer to that is no. In real life, that is. Maybe they made him Jewish for the show...",
  "pros": null,
  "cons": null,
  "score": 3378,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/j/jerry_buss.jpg",
  "created_at": "2025-03-29T13:17:49+02:00",
  "updated_at": "2025-03-29T13:17:49+02:00"
}