{
  "name": "Jezebel",
  "url": "http://jewornotjew.com/profile.jsp?ID=1644",
  "verdict": "Not a Jew",
  "description": "\"Found anything, Inspector?\", asked the guard.\n\nInspector Shmul slowly got up from his knees. He was covered in red sandy dust from head to toe; his hands and knees were spotted with what must have been blood.\n\n\"Just this,\" he said, drawing out his hand. A long, brown, damp strand of hair was pinched between two of his fingers.\n\n\"Where is the rest?\"\n\n\"Why don't you ask them,\" answered Shmul, pointing to the corner of the courtyard. There, two dogs were being held down by chains.\n\n\"I don't understand...\"\n\n\"The dogs ate Queen Jezebel.\"\n\nThe guard gasped, dropping his sword.\n\n\"I'd like to see her room,\" said Shmul.\n\n\"You'd need King Jehu's permission, Inspector.\"\n\n\"Then go ask him!\", Shmul threw up his hands in frustration.\n\nAs the guard left, Shmul reached into his robe and pulled out a chewed-up shoe sole. He quizzically stared at it, scratching his bald head with his pointy fingernail.\n\n\"King Jehu said you have five minutes,\" said the returning guard.\n\nInspector Shmul followed the guard into the palace. Jezebel's room was in the east wing. Two eunuchs were standing by the entrance. \n\nShmul went straight for the window on the opposite side. It was high off the ground, with a tall window seat underneath.\n\n\"The queen loved watching the sunrise,\" said the guard.\n\nInspector Shmul smirked. He climbed up on the window seat and looked down onto the courtyard. Jezebel's room was on the third floor.\n\n\"It would have been rather difficult for her to trip and fall out, don't you say?\", he asked the guard.\n\n\"I... I... don't know,\" was the mumbled response.\n\nShmul's gaze darted to the large vase that was standing against the wall. He climbed down from the seat, and, with the guard's help, pushed the vase to the side. Lying behind it was a women's sandal.\n\nAs Shmul reached down to pick up the shoe, one of the eunuchs jumped at him, shattering the vase into dozens of pieces. Shmul was knocked to the ground, with one eunuch on top of him; the other one picked up the sandal and hid it among the folds of his robe.\n\n\"What is the meaning of this?\"\n\n\"King Jehu!\"\n\nThe guard and the eunuchs bowed down. Shmul used the pause to get up from the floor and dust himself off.\n\n\"Inspector?\"\n\nJehu drew out his hand, shaking Shmul's.\n\n\"Leave us,\" the king said forcefully.\n\nThe guard and the eunuchs retreated.\n\n\"So, Inspector, what have you uncovered?\"\n\nShmul stayed silent for a moment, weighing his options. He sighed.\n\n\"Queen Jezebel was murdered,\" he finally uttered.\n\n\"Murdered?\"\n\n\"Murdered by these two eunuchs,\" continued Shmul.\n\n\"I don't understand!\"\n\n\"This window is high up, King Jehu. For someone to fall out on their own, they would have to climb up on the window seat and then somehow trip... I just don't think it's logical, do you?\"\n\n\"Not entirely.\"\n\n\"You see this?\", Shmul asked, removing the chewed-up sole from his robe. \"If you get that sandal from the eunuchs, I would bet anything that its sole will match this. These eunuchs grabbed Queen Jezebel and threw her out of the window. Her sandal must have fallen off.\"\n\nKing Jehu's face distorted into a frown.\n\n\"Well done, Inspector. Well done.\"\n\n\"What now, King?\", Shmul asked, his eyes bowed to the ground.\n\n\"What now, Inspector? Nothing. Queen Jezebel, that vile temptress, had to be taken care of. Poor King Ahab, God rest his soul, she had him build temples of Baal! She is gone now, and Israel can go back to being a Jewish state that it's supposed to be!\"\n\nShmul looked up at King Jehu.\n\n\"The guard will see you out, Inspector,\" continued the king. \"Congrats on a job well done. Stop by the treasurer tomorrow, he will make sure you get paid for your services.\"\n\nInspector Shmul shrugged his shoulders, surveyed the room for the final time, nodded in the direction of King Jehu, and exited.",
  "pros": null,
  "cons": null,
  "score": 1644,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/j/jezebel.jpg",
  "created_at": "2025-03-29T13:17:04+02:00",
  "updated_at": "2025-03-29T13:17:04+02:00"
}