{
  "name": "Joaquin Phoenix",
  "url": "http://jewornotjew.com/profile.jsp?ID=940",
  "verdict": "Borderline Jew.",
  "description": "Welcome to...\n\nThe Museum ofJewish Beards!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nbut.disabled = false;\ndir = 'img/people/';\nr = 0;\ntext = new Array(\n\"Jewish patriarchs, such as \u003cb\u003eAbraham\u003c/b\u003e and \u003cb\u003eMoses\u003c/b\u003e, are always portrayed with full, bushy beards. Life was not easy in the desert heat.\",\n\"\u003cb\u003eJesus Christ\u003c/b\u003e and his apostles (pictured: \u003cb\u003eSaint Peter\u003c/b\u003e) are always shown bearded as well. But we'll let the obviously more pathetic Museum of Christian Beards handle their facial hair.\",\n\"Through the centuries, beard styles changed. Compare the impeccably groomed beard of \u003cb\u003eMaimonides\u003c/b\u003e (12th c.) to the lengthiness of \u003cb\u003eNostradamus\u003c/b\u003e (16th c.)\",\n\"The \u003ci\u003evan dyke\u003c/i\u003e proved to be a popular alternative for both artistic and adventurous types. Here we see it sported by painter \u003cb\u003eDiego Velazquez\u003c/b\u003e (17th c.) and pirate \u003cb\u003eJean Lafitte\u003c/b\u003e (18th c.)\",\n\"The 19th century brought a rebirth of the heavy beard movement. Here we see artist \u003cb\u003eCamille Pissarro\u003c/b\u003e, in a self-portrait, and chess champion \u003cb\u003eWilhelm Steinitz\u003c/b\u003e recall the time of the patriarchs.\",\n\"We also began to see the mustacheless beard make an appearance, here on the faces of politician \u003cb\u003eJudah P. Benjamin\u003c/b\u003e and blue jeans inventor \u003cb\u003eLevi Strauss\u003c/b\u003e.\",\n\"No beard museum would be complete without the magnificent growths of philosopher \u003cb\u003eKarl Marx\u003c/b\u003e and New Zealand president \u003cb\u003eJulius Vogel\u003c/b\u003e. Truly, the 19th century was the Jewish beard's golden age!\",\n\"The 20th century saw a worldwide beard revolution. The avant-garde artist \u003cb\u003eMan Ray\u003c/b\u003e gave us the amazing half-beard, while muttonchopped author \u003cb\u003eIsaac Asimov\u003c/b\u003e made us ponder, where do sideburns end and the beard begins?\",\n\"Nowadays, there are all kinds of options. Some, such as anthropologist \u003cb\u003eClaude Levi-Strauss\u003c/b\u003e and director \u003cb\u003eSteven Spielberg\u003c/b\u003e, went with the classy, neatly trimmed look.\",\n\"While others, such as beatnik poet \u003cb\u003eAllen Ginsberg\u003c/b\u003e and mathematician \u003cb\u003eGrigory Perelman\u003c/b\u003e, let it all loose.\",\n\"The \u003ci\u003egoatee\u003c/i\u003e became a popular choice. For unknown reasons, it is often sported by douchebags, here represented by child actor \u003cb\u003eDustin Diamond\u003c/b\u003e and sports talk show host \u003cb\u003eJim Rome\u003c/b\u003e.\",\n\"Can Jewish women be bearded? Yes, and it is no laughing matter. Here we have half-Jewish sideshow performer \u003cb\u003eJane Barnell\u003c/b\u003e and sort-of-Jewish college professor (and sideshow performer, natch) \u003cb\u003eJennifer Miller\u003c/b\u003e.\",\n\"We hope our tour has been informative! We leave you with the wackiness of comedian \u003cb\u003eYakov Smirnoff\u003c/b\u003e and the weirdness of (half Jewish) actor \u003cb\u003eJoaquin Phoenix\u003c/b\u003e. May your own beards be as wonderful!\"\n);\npic = new Array(\n\"a/abraham\", \"m/moses\",\n\"j/jesus_christ\", \"s/saint_peter\",\n\"m/maimonides\", \"n/nostradamus\",\n\"d/diego_velazquez\", \"../other/lafitte\",\n\"c/camille_pissarro\", \"w/wilhelm_steinitz\",\n\"j/judah_p__benjamin\", \"l/levi_strauss\",\n\"k/karl_marx\", \"j/julius_vogel\",\n\"m/man_ray\", \"i/isaac_asimov\",\n\"c/claude_levi-strauss\", \"s/steven_spielberg\",\n\"a/allen_ginsberg\", \"g/grigory_perelman\",\n\"d/dustin_diamond\", \"j/jim_rome\",\n\"../other/bearded_lady1\", \"../other/bearded_lady2\",\n\"y/yakov_smirnoff\", \"j/joaquin_phoenix\"\n);\nfunction begin() {\nwelcome.style.display = 'none';\nmuseum.style.display = 'inline';\nnext();\n}\nfunction url(r,k) {\nx = r*2+k;\nreturn dir + pic[x] + \".jpg\"\n}\nfunction show(r) {\npic1.src = url(r,0);\npic2.src = url(r,1);\n}\nfunction next() {\nbut.value = 'Next';\nshow(r);\nnote.innerHTML = text[r];\nr++;\nif (r == text.length) {\nbut.value = 'Restart Tour';\nr = 0;\n}\n}",
  "pros": null,
  "cons": null,
  "score": 940,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/j/joaquin_phoenix.jpg",
  "created_at": "2025-03-29T12:53:05+02:00",
  "updated_at": "2025-03-29T12:53:05+02:00"
}