{
  "name": "Jody Scheckter",
  "url": "http://jewornotjew.com/profile.jsp?ID=1059",
  "verdict": "Jew",
  "description": "In the 1970s, the golden age of crappy television (although the 2010s are making a good run for the title), someone thought it would be a good idea to determine who the best athlete across all sports is. So \"Superstars\" was born: a made-for-TV event, where sportsmen from various disciplines competed against each other.\n\n\"Superstars\" was beyond camp; we won't describe it at great length, but feel free to head to YouTube to check the clips (after reading this profile, of course). One of the most famous moments happened in the very first event of the very first competition, when heavyweight boxer Joe Frazier almost drowned... He later admitted he didn't know how to swim.\n\nAnd did it determine the best athlete? Well, not really, unless you want to concede that the best athlete in America from 1974 to 1977 was soccer player Kyle Rote Jr, who won three out of four years (the winner in 1975? O.J. Simpson. Let's just move on...) and the best athlete in world from 1977 to 1979 was Canadian(!) soccer player Brian Budd (seriously, what is it with these obscure soccer players), who dominated so much that they had to make up a rule that a three-time champion had to retire.\n\nWhich was bad for Budd, but great for us Jews, for it left the door open for South African race car driver Jody Scheckter to take the crown in 1981, proving once and for all that yes, drivers are also athletes... be it in a contrived made-for-TV setting.\n\nAnd Sheckter was not a shabby driver as well, winning the Formula 1 world championship in 1979. And sure, we could have spend this profile talking about that...\n\nBut it's more fun to talk about \"Superstars\", isn't it?",
  "pros": null,
  "cons": null,
  "score": 1059,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/j/jody_scheckter.jpg",
  "created_at": "2025-03-29T13:16:49+02:00",
  "updated_at": "2025-03-29T13:16:49+02:00"
}