{
  "name": "Joey Bishop",
  "url": "http://jewornotjew.com/profile.jsp?ID=942",
  "verdict": "Jew",
  "description": "Any group of greatness can be broken down into three smaller groups: the Alphas, the supporting cast, and the one fellow who just seems to be hanging on for some reason (aka, the comic relief). For instance, your late 90s Chicago Bulls. Alphas: Jordan, Pippen, Rodman, Jackson. Support: Kerr, Kukoc, Harper. Comic relief: Luc Longley. How that man ever started for that team will forever be pondered by our finest thinkers (example two, Scooby Doo: Alpha: Shaggy, Scooby. Support: Velma, Daphne. Loser: Fred. You know it's true. That guy didn't do anything except tie his neckerchief too tight).\n\nSo how does the Rat Pack break down? The first three, the Alphas, are the gimmees: Swingin' Sinatra. Drunk Dean. Sammy, cause, well, he was the black one. \n\nOn the second tier, Peter Lawford actually had a nice little career. Especially in the 1940s when he pretty much was the leading man in Hollywood (the others having gone off to war). He starred in some big pictures, married some women roughly 30 years his junior, and was generally solid if generally forgotten at this present juncture.   \n\nThat leaves Joey Bishop, AKA, comic relief. Hey, he was the comedian in the group. Ha! Yeah, not so much. Sure he had his own TV show a couple of times, but really? This is the RAT PACK not The Group of Somewhat Successful Swingers. \n\nWell, anyway, you know where this one's going. There's a group of famous people, one of them isn't as cool as all the others and so naturally the assumption is that the loser is Jewish. Well, thankfully we can rule that one....  Wait.\n\nNooooo. It can't be. His last name is Bishop.\n\nAnd yet, there it is:",
  "pros": null,
  "cons": null,
  "score": 942,
  "category": "Comedy",
  "image_url": "http://jewornotjew.com/img/people/j/joey_bishop.jpg",
  "created_at": "2025-03-29T12:53:05+02:00",
  "updated_at": "2025-03-29T12:53:05+02:00"
}