{
  "name": "John the Baptist",
  "url": "http://jewornotjew.com/profile.jsp?ID=3202",
  "verdict": "Sadly, a Jew.",
  "description": "John: \"Cousin Joshua, is that you?\"\n\nJesus: \"Yeah, it's me. But the name is Jesus now.\"\n\nJohn: \"Jebus?\"\n\nJesus: \"Not Jebus, Jesus.\"\n\nJohn: \"Fine, cousin Jesus. What you've been up to?\"\n\nJesus: \"Oh, just wandering the desert...\"\n\nJohn: \"That gets pretty boring!\"\n\nJesus: \"You're telling me. After 40 days, I did meet this interesting fellow...\"\n\nJohn: \"Satan?\"\n\nJesus: \"No, I don't think that was his name. I want to say... Bob? Not sure, exactly.\"\n\nJohn: \"What did Bob want?\"\n\nJesus: \"Who knows, I was pretty out of it by then. Anywhoo, can you do me a favor?\"\n\nJohn: \"I guess?\"\n\nJesus: \"Can you baptize me?\"\n\nJohn: \"Bap-what?\"\n\nJesus: \"Baptize. You basically dunk my head in water. Any water will do. We can use a bucket, or go to that river over there.\"\n\nJohn: \"You want me to dunk your head... in water?\"\n\nJesus: \"Yep.\"\n\nJohn: \"Are you high? Did Bob slip you some wacky weed or something?\"\n\nJesus: \"God damn it, John, I'm not high! It's just something that needs to be done!\"\n\nJohn: \"Okay... I guess... We do this... now?\"\n\nJesus: \"No, give me a couple of days to get a bunch of people to come witness it. Oh, one more thing. You can't let anyone know we're related.\"\n\nJohn: \"But why? We're cousins! We always had your family over for Passover because aunt Mary can't cook!\"\n\nJesus: \"You keep mom out of it!\"\n\nJohn: \"You always used to throw rocks at my head when we were kids...\"\n\nJesus: \"Yeah, but who is to know that. So if anyone asks, you say 'I do not know him'.\"\n\nJohn: \"This makes no sense!\"\n\nJesus: \"Oh, none of this makes any sense! Just stop arguing and do what I say!\"",
  "pros": null,
  "cons": null,
  "score": 3202,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/j/john_the_baptist.jpg",
  "created_at": "2025-03-29T13:17:44+02:00",
  "updated_at": "2025-03-29T13:17:44+02:00"
}