{
  "name": "John Wilkes Booth",
  "url": "http://jewornotjew.com/profile.jsp?ID=1096",
  "verdict": "Barely a Jew",
  "description": "One of the best episodes of the original Star Trek features the Mirror Universe, a twisted reflection or our own where our heroes are villains and vice versa (we know they're evil because they all have facial hair. Remember that, kids, facial hair = evil).\n\nThis mirror (or \"bizarro\" to pick another pulp trope) universe concept has been shmeared pretty thoroughly, so we don't think we're confusing anyone when we point out our own Mirror Universe counterparts: Nazi websites.\n\nWhether they sit around twisting their mustaches is a question best left unanswered, but they do spend quite a bit of time figuring out who's Jewish and who isn't, and — shocker — getting it wrong on purpose to make Jews look bad.\n\nStalin was Jewish. Beria was Jewish. Rosie O'Donnell is Jewish. History's greatest monsters were all Jews? Please. It's all ridiculous, and we spend a lot of our time trying to undo their evil plots before they gain any traction.\n\nSo when we came across the concept that actor/assassin/stovepipe-hat-hater John Wilkes Booth was Jewish we thought: \"ah, darn those bizarro JONJ-ers!\" Except, actually, the source is surprisingly legit this time: Booth himself. Booth references his Jewish ancestry in completely antisemitic, hate-filled ways, sure, but do it he does. \n\nSo was he seriously Jewish or just making rude comments? Sadly our last intern crashed the office time machine joy riding through ancient Minoa, so we're left to guess and so, sadly we're gonna concede this one for now. \n\nApropos of nothing, though, Booth did have a mustache, so maybe he was trying to tell us something, hm?",
  "pros": null,
  "cons": null,
  "score": 1096,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/j/john_wilkes_booth.jpg",
  "created_at": "2025-03-29T13:16:50+02:00",
  "updated_at": "2025-03-29T13:16:50+02:00"
}