{
  "name": "John Barsha",
  "url": "http://jewornotjew.com/profile.jsp?ID=2762",
  "verdict": "Jew",
  "description": "The NFL has been celebrating its 100th anniversary, which is all fun and good, but didn't it start in 1922? More importantly, didn't we claim that Arnold Horween was the first Jew to play in the NFL, because he suited up for the Chicago Cardinals during that 1922 season?\n\nApparently, the NFL is counting two seasons of the American Professional Football Association towards it total. The APFA changed its name to the NFL in 1922, so technically, they are correct... but where does it leave Horween? He did play for the Cardinals in the APFA in 1921, but not back in 1920. So who was the first Jew to play in the NFL (APFA)?\n\nOn October 3, 1920, the Rochester Jeffersons (that's Rochester, New York) played a team named \"All Buffalo\". The latter should not be confused with the Buffalo All-Americans, who played \"West Buffalo\" on that very day. (Buffalo was the epicenter of early American pro football?) \"All Buffalo\" was actually not part of the APFA, but Rochester was, and the game counted in the standings. Rochester won 10:0, with the lone touchdown scored by John Barsha.\n\nMake that Abraham Bashofsky. The Russia-born, Brooklyn-raised Barsha changed his name while playing three sports at Syracuse. After college he went pro and scored the first ever touchdown in the first APFA game of the Jeffersons' glorious history. (They folded in 1925 after four winless seasons.)\n\nSo, Barsha is the first NFL Jew, with one caveat. A week prior to the Jeffersons game, the APFA's opening contest saw the Rock Island Independents beat the St. Paul Ideals. Perhaps a Jew snuck into that game? Hopefully not for the Ideals, who lost 48:0...",
  "pros": null,
  "cons": null,
  "score": 2762,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/j/john_barsha.jpg",
  "created_at": "2025-03-29T13:17:33+02:00",
  "updated_at": "2025-03-29T13:17:33+02:00"
}