{
  "name": "Jonathan Tunick",
  "url": "http://jewornotjew.com/profile.jsp?ID=2596",
  "verdict": "Jew",
  "description": "The EGOT has been in the news recently. Winning an Emmy, Grammy, Oscar, and Tony — at least one of each — is a rare occurrence, but three musicians managed to do it this year. John Legend, Andrew Lloyd Webber, and Tim Rice all needed an Emmy to complete their Grand Slam, and they all got it for \"Jesus Christ Superstar Live in Concert.\" Obviously, neither of the three are Jews. Very few people who have worked on \"Jesus Christ Superstar,\" in any incarnation, are Jews.\n\nAs it happens, when an EGOT is completed, previous winners are recounted. Heck, we even used it as a topic ourselves in a profile of Mike Nichols, written years ago. There, we mention all Jewish EGOTers, a select group that includes Nichols, Richard Rodgers, Mel Brooks, a few others you probably heard of... and someone named Jonathan Tunick. Why Jonathan Tunick?\n\nTunick is (quoting Wikipedia here) \"a composer, conductor, and music arranger.\" His first award was an Oscar for Best Music, won in 1977 for \"A Little Night Music.\" (A film adaptation of a play by the same name, starring Elizabeth Taylor. We never heard of it until now.) In 1982, he got an Emmy for Music Direction for \"Night of 100 Stars,\" a variety show celebrating actors. This was followed by a 1988 Grammy for Best Instrumental Arrangement Accompanying Vocals on the album \"No One is Alone\" by Cleo Laine. (We might be showing our obliviousness here, but once again, have never heard of her.) In 1997, Tunick completed the EGOT with a Tony for Best Orchestrations for the Broadway version of \"Titanic\". (No Leo DiCaprio in this one.)\n\nSo, if you're counting, and we are, that's four awards for rather obscure productions which now seem only relevant because they led to that rare EGOT. That being said...\n\nAs accomplished as he was, it still doesn't help us answer the question... Why Jonathan Tunick?",
  "pros": null,
  "cons": null,
  "score": 2596,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/j/jonathan_tunick.jpg",
  "created_at": "2025-03-29T13:17:29+02:00",
  "updated_at": "2025-03-29T13:17:29+02:00"
}