{
  "name": "Jonah",
  "url": "http://jewornotjew.com/profile.jsp?ID=2046",
  "verdict": "Jew",
  "description": "It's really cold in here.\n\nIs that a coin? I think it's a coin! I wonder if it's gold or silver...\n\nStomach is starting to growl.\n\nThere is so much seaweed in here! Nasty!\n\nGetting hungrier and hungrier. How long have I been in here?\n\nI think I just stepped in something.\n\nAnother coin? I'm gonna be rich! If I ever get out...\n\nI miss you, dear wife...\n\nG-d damn, it's cold in here!\n\nThought it was a grape, tried to chew it. Definitely not a grape.\n\nI miss you, dear Batsheba...\n\nNot a fan of half-digested fish. Might not have a choice.\n\nEwww! That was disgusting! I just threw up in my mouth!\n\nI wonder if the wife knows about Batsheba...\n\nIf I ever get out of here, I promise to never go fishing again!\n\nG-d, why have you forsaken me?\n\nYou know what I could use right now? I nice mutton sandwich.\n\nI know! I will EAT my way out!\n\nThat's right! I will eat this whale from the inside!\n\nHere is a stick, here is a rock...\n\nNow tie them together with some seaweed... I'm a regular MacGyver!\n\nWhat the heck is a MacGyver? Am I hallucinating?\n\nWhat do you know, a home-made spoon!\n\nDid I just call this a home? I guess I'm getting used to living here...\n\nI miss you, dear Batsheba!\n\nAlright, let's ram this spoon into this wall...\n\nNow, here is a healthy chunk... Gulp!\n\nHmmm, doesn't taste too bad... And I am one step closer to freedom!\n\nI'm coming, dear Batsheba!\n\nLet's take another bite...\n\nI just had a terrible, terrible thought: whales don't have scales!\n\nMy G-d, what have I done?\n\nOnly fish with scales are Kosher!\n\nWhales are not Kosher!\n\nHoly crap, another coin. I have no time for coins!\n\nG-d, will you ever forgive me?\n\nWell, I've made my decision. I might spend my whole life inside this fish, but I will not take another bite.\n\nAre we good, G-d?\n\nYou'll rescue me, right?\n\nRight?...\n\nOh, dear Batsheba!",
  "pros": null,
  "cons": null,
  "score": 2046,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/j/jonah.jpg",
  "created_at": "2025-03-29T13:17:15+02:00",
  "updated_at": "2025-03-29T13:17:15+02:00"
}