{
  "name": "Jonathan Brandis",
  "url": "http://jewornotjew.com/profile.jsp?ID=890",
  "verdict": "Not a Jew",
  "description": "Clinical depression can be a tough thing to understand. \n\nNone of us here at JONJ are trained psychologists or psychiatrists, have doctorates or any form of medical degree, but we know enough to know that the general idea of depression as \"the blues\" or \"just being down\" is an oversimplification made mostly by people who have never been really, truly depressed.\n\nPerhaps it is the mental aspect. More widely accepted \"diseases\" like cancer or HIV are physical manifestations that we can see with viral counts, or tumors, or gross, festering, puss-filled, dripping infections (how do ya like THAT visual, huh? HUH?).\n\nBut, honestly, depression isn't really any different than that. It's a disease like any other — acquired or self-inflicted. Once it takes hold it can't be shaken without medication any more than you can walk off a leukemia or snap out of a rheumatoid arthritis. But some people seem to think you can — that it's a matter of mental fortitude or emotional strength. Yeah, try replacing medication with THAT philosophy around the chemo ward and see how it goes over.\n\nThe reason for Jonathan Brandis' suicide at an all-too-young 27 will remain unknown. We certainly weren't his psychiatrists (just his Jew-raters and in this case, BrandIS is no BrandEIS). His choice to end his life will forever be between him and his own mind. But to say that he decided to kill himself over a lack of acting jobs rather than a disease whose primary clinical presentation is the brain's unyielding command for him to end his own life is merely \"modern\" society's lack of sophistication and understanding of an all too common and all too serious disease.\n\nThat said, his career as the sloppy seconds for a flying, hairy dog, a transvestite teen athlete, and the poor man's Wesley Crusher could not have helped things, we grant you.",
  "pros": null,
  "cons": null,
  "score": 890,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/j/jonathan_brandis.jpg",
  "created_at": "2025-03-29T12:53:04+02:00",
  "updated_at": "2025-03-29T12:53:04+02:00"
}