{
  "name": "Joop Zoetemelk",
  "url": "http://jewornotjew.com/profile.jsp?ID=1053",
  "verdict": "Not a Jew",
  "description": "The first running of the Tour de France was held in 1903. It was won by Maurice Garin who was, along with most of the leading riders, disqualified afterward for cheating. Not only were the riders secretly taking cars and trains when no one was looking, but several had taken so many drugs that they tested positive for pregnancy.\n\nThus began the long tradition of the Tour de France — thousands of miles, grueling climbs, and doping to win.\n\nToday's profilee, Joop Zoetemelk, is definitely a Tour champion: he won in 1980. There is some hearsay that he is Jewish, which would make him the only Jewish winner of the Tour (that seems to be false, as he was raised in a Catholic family). He also, because he rode in the Tour de France, got in trouble for doping. He was caught in drug tests in 1977, 1979, and 1983.\n\nThis is the point where we're supposed to rail against the rampant cheating in cycling and how these athletes are ruining our beloved sport, blah, blah, blah, blah, blah. But here's the thing: maybe this history of drugs and cheating is a sign that we really aren't supposed to be doing this kind of thing in the first place. Maybe the human body simply isn't capable of \"running a marathon several days a week for three weeks\" or \"climbing three Everests\" in succession: both ways people have described the meat grinder that is the Tour.\n\nHow impossible is the Tour de France? The fact that Joop completed it every time he raced is a Tour record. An event whose very completion is considered an accomplishment? Maybe it's time to accept that the Tour de France may be something that a normal human being cannot complete without assistance. And if that's the case then maybe the Tour is something that we shouldn't even start.",
  "pros": null,
  "cons": null,
  "score": 1053,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/j/joop_zoetemelk.jpg",
  "created_at": "2025-03-29T13:16:49+02:00",
  "updated_at": "2025-03-29T13:16:49+02:00"
}