{
  "name": "Joseph Keller",
  "url": "http://jewornotjew.com/profile.jsp?ID=3211",
  "verdict": "Jew",
  "description": "The Nobel Prizes are all good and important and everything, but they are quite serious, to say the least. So the scientific community came up with a parody, the Ig Nobel Prizes (Get it? Ignoble? Oh, those hilarious scientists!) that \"honor achievements that first make people laugh, and then make them think.\"\n\nWinners range from Dan Quayle (Category: Education, 1991) for \"demonstrating, better than anyone else, the need for science education\" to a Japanese detective (Category: Chemistry, 1999) for \"an infidelity detection spray that wives can apply to their husbands' underwear\" to Belarusian president Alexander Lukashenko (Category: Peace, 2013) for \"making it illegal to applaud in public\". Yep, it's that kind of a prize. Most recent laureates include a group of Spanish biologists who \"used genetic analysis to identify the different species of bacteria that reside in wads of discarded chewing gum stuck on pavements in various countries.\" Truly, a remarkable achievement!\n\nSome Ig Nobel winners actually go on to great things, like Andre Geim (Category: Physics, 2000) who won for levitating frogs, and then won the Nobel ten years later for... something else. But few hold the candle to Jewish American mathematician Joseph Keller, who won two Ig Nobel prizes!\n\nIn 1999, Keller won for figuring out why teapot spouts drip. In 2012, for calculating how much force is needed to move a hair in a human ponytail. He also dabbled in airline scheduling, website popularity (oh, if he only knew that one day he would be profiled on JONJ!), stealth technology, and earthworm wriggling, winning the prestigious (and completely serious) Wolf Prize for mathematics. Truly, a modern renaissance man!\n\nThose two Ig Nobels give Keller the tie for the all-time lead with five others, including Lukashenko. Alas, \"Ignoble\" sounds about right...",
  "pros": null,
  "cons": null,
  "score": 3211,
  "category": "Physics, 2000) who won for levitating frogs, and then won the Nobel ten years later for... something else. But few hold the candle to Jewish American mathematician Joseph Keller, who won two Ig Nobel prizes!",
  "image_url": "http://jewornotjew.com/img/people/j/joseph_keller.jpg",
  "created_at": "2025-03-29T13:17:45+02:00",
  "updated_at": "2025-03-29T13:17:45+02:00"
}