{
  "name": "Josh Baskin",
  "url": "http://jewornotjew.com/profile.jsp?ID=777",
  "verdict": "Jew",
  "description": "Nowadays, you can't go to the mall (or the ballgame, or the pizzeria, or the barber shop...) without meeting some little boy named Josh. He's probably blond, between seven and nine years old, and is annoying his mother to no end while she tries to find a nice dress for Cousin So-and-So's second wedding. In fact, there are probably three of them within shouting distance of you RIGHT NOW. \n\nBut from the 70s on back, Josh wasn't that popular of a name. It didn't even make the top 100 for the decade (by the end of the 80s it had shot up to fourth. Mind boggling). So, if you were born in the 70s or earlier and you were named Josh there were only two possibilities: you were Jewish or you were black. And for those people, to be associated with the unending hordes of modern Joshes, well, we can only imagine, but it must be very trying.\n\nThat's the long way around of getting to today's subject: Josh Baskin (as played by Tom Hanks) in the movie Big. Because we tend to assume he's just one of the roaring masses of little Joshes wandering around out there. A regular boy turned grown up turned back again who apparently invented both the Transformers AND the iPad (which, quick aside, to us sounds like some kind of interactive feminine product), we grant you. But certainly nothing more interesting than that. For this website, anyway.\n\nBut when you realize the Josh character is 13 in Big and the movie came out in 1988 (meaning he was born in 1975 or thereabouts), well, then the curly hair and the whiny mother start to make a little more sense, don't they?\n\nOf course, viewing Big with a modern eye leads to all kinds of problems (the Elizabeth Perkins character is guilty of statutory rape, right?). And such is life. Most movies don't age well. But to see a boy named Josh in the 1980s and assume he's just another whiny goyishe kid at the Macy's?\n\nThat's just ludicrous.",
  "pros": null,
  "cons": null,
  "score": 777,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/j/josh_baskin.jpg",
  "created_at": "2025-03-29T12:53:01+02:00",
  "updated_at": "2025-03-29T12:53:01+02:00"
}