{
  "name": "Judit Polgar",
  "url": "http://jewornotjew.com/profile.jsp?ID=933",
  "verdict": "Jew",
  "description": "Here's something we don't understand.\n\nHow come there is a separate chess championship for men and women?\n\nNow, with sports, it's obvious. (And no, chess is not a sport. Sorry, those who want to get it into the Olympics. It's not happening.) Men's bodies give them an advantage over women, so lumping everyone together would just be unfair. (Except in curling. By G-d, how is curling an Olympic sport? That's even sillier than chess, yet here we are. Anyway...)\n\nWith chess, the body is pretty much out of equation. All one needs is a brain, and what surrounds it, be it a 300-lb man with multiple layers of fat, or a 100-lb woman with a perfect figure (just taking two random stereotypes here) should be irrelevant.\n\nSomehow, it isn't. Women rarely play against men. They have their own championship and their own ranking system and even their own groupies (we wish we were kidding).\n\nWell, most women do. There are some out there who man up (errr... woman up) and compete against men. And clearly the best one of them all is a Hungarian Jew, Judit Polgar.\n\nHow good is Polgar? She doesn't play against women, but has been in the top 10 in the men's world rankings. She's won numerous tournaments. At the age of 15, she became the world's youngest grandmaster, regardless of gender. At 17, she would have beaten then-world champion Garry Kasparov, only he cheated. (Not sure where our allegiances lie here. Both are Jewish. But Kasparov is only half... How could you, Garry! Admit it: you cheated to avoid losing to a girl!)\n\nSo, if Polgar is so good, why is it that the women have their own tournaments? Oh, the international chess body is ruled by men.\n\nNow we understand.",
  "pros": null,
  "cons": null,
  "score": 933,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/j/judit_polgar.jpg",
  "created_at": "2025-03-29T12:53:05+02:00",
  "updated_at": "2025-03-29T12:53:05+02:00"
}