{
  "name": "Judy Blume",
  "url": "http://jewornotjew.com/profile.jsp?ID=970",
  "verdict": "Jew",
  "description": "So, Judy Blume writes a book (\"Are You There G-d? It's Me, Margaret\") about a young teenage girl who, faced with the many challenges inherent with attaching a number 1 to one's age, turns to G-d for help.\n\nDo our religious, fundamentalist, \"family-first\" brethren commend the book for such a positive outlook on a person's relationship with G-d? Do they recommend it to their church or thank Ms. Blume for inspiring a better relationship between G-d and their own children?\n\nNope. BANNED. Threw it out of every school they could, campaigned to get it thrown out of the schools they couldn't, and continue to describe the book in ways usually reserved for such hallowed tomes as Mein Kampf, The Satanic Bible, and Little T Learns to Share.\n\nWhy? Well, \"Margaret\" does such awful, horrible, indescribable things such as acknowledge that women experience menses and like boys (what, Margaret should have been attracted to girls? Yeah, we're sure that would have gone over so much better). Also, our heroine is both Jewish and Christian, which suggests she might be praying to some generic, open-minded and (*gasp*) possibly slightly Semitic G-d. The horror!\n\nBlume has written multiple books, many of which we enjoyed and many of which have suffered from censorship woes for writing about such controversial and fanciful topics such as puberty, divorce, and love. Yeah, that's so much more poisonous for a child's mind than a resurrected lion.\n\nWhatever. All this kneejerk censorship accomplishes is to teach our children that they are incapable of thinking for themselves. People wonder why our children aren't more exceptional. Why other countries seem to be so much smarter than we are. \n\nWell, when you treat our kids like idiots, what the fuck did you think would happen?",
  "pros": null,
  "cons": null,
  "score": 970,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/j/judy_blume.jpg",
  "created_at": "2025-03-29T12:53:06+02:00",
  "updated_at": "2025-03-29T12:53:06+02:00"
}