{
  "name": "Kate Middleton",
  "url": "http://jewornotjew.com/profile.jsp?ID=307",
  "verdict": "Not a Jew",
  "description": "For a while now, we've been trying to find Jewish European royalty. It seemed plausible at first, but we soon realized that we're barking up the wrong tree. European kings must have had great genealogy researchers, but with a goal completely opposite from ours: \"I'm sorry, son, but you can't marry the lovely Rebecca, for her maternal great-great-great-uncle changed his name from Cohen to Cole. Why don't you marry the horse-faced Augusta instead?\"\n\nPerhaps it's more possible in the modern world, with less emphasis on bloodlines and more desire for European princes to avoid horse-faced brides? Alas, that is not the case. It seems that Australian hotties are the hot item, but nice Jewish girls are still off limits. What can we do.\n\nBut what's this? Some people think that Kate Middleton, quite possibly the next Queen of England, just might be somewhat Jewish? She might not be royalty yet, but we have to check.\n\nYou see, Kate's mother's maiden name is Goldsmith. And there are people with the last names of Temple and Meyers in her family tree, which apparently is enough to make some think that she has Jewish ancestry. There is absolutely no proof that's the case, but even if it were, that Jewish link was lost a long, long time ago. Genealogy research is not just limited to days past, and in case of Kate possibly ascending the British throne, her lineage has been studied at length. And for at least five generations, Kate's ancestors have been married in churches. Nothing Jewish about that.\n\nWell, the mission is clear now. It's too late for us to marry into royalty, but there might just be a future generation ready to get started. Could a prince or princess be in their future? It doesn't seem impossible, right? Right?",
  "pros": null,
  "cons": null,
  "score": 307,
  "category": "Science",
  "image_url": "http://jewornotjew.com/img/people/k/kate_middleton.jpg",
  "created_at": "2025-03-29T12:52:49+02:00",
  "updated_at": "2025-03-29T12:52:49+02:00"
}