{
  "name": "Kate Capshaw",
  "url": "http://jewornotjew.com/profile.jsp?ID=98",
  "verdict": "Jew",
  "description": "At Jew or Not Jew, we love the Indiana Jones movies. We love them so much that we can't wait for the now-ancient Harrison Ford to reclaim his role in the still untitled Indy 4, even if the film ends up being a comparable disaster. We mean... Indiana Jones! How bad can it be?\n\nBut right now, there is no Indy 4, so we are stuck with the first three, which we can't help but watch every time they appear on TV, or popping in a DVD now and again. The films are just that good. Especially \"Raiders of the Lost Ark\". Especially \"Last Crusade\".\n\n\"Temple of Doom\"? Not so much. Don't get us wrong, it's still Indiana Jones, so its rates very highly when comparing to any other film out there. But comparing it to the other two? Well, it suffers. Maybe it's the lack of Nazis (we hate those guys). But most likely it's the role of Kate Capshaw as Indy's leading lady.\n\nWe loved the so-cute-and-so-tough Karen Allen in \"Ark\". We loved the so-blond-yet-so-evil Alison Doody in \"Crusade\". (Sorry for the spoiler. But shame on you if it is a spoiler! Watch the movie!) Kate Capshaw? Not so much.\n\nMaybe it's the constant screaming. Maybe it's the overacting. Maybe it's the damsel-in-distress that we really, really, don't care if Indy saves or not. In fact, every time we re-watch the movie, we hope that somehow he doesn't. Sadly, that never happens.\n\nBut oh yes, we are writing for Jew or Not Jew here. So Capshaw is Jewish, converting to Judaism for Indy director Steven Spielberg. Perhaps the best thing that came out of that is that she limited her acting and became a stay-at-home mom after the marriage. As for rumors of her making an appearance in Indy 4... We are not holding our breath.",
  "pros": null,
  "cons": null,
  "score": 98,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/k/kate_capshaw.jpg",
  "created_at": "2025-03-29T12:52:44+02:00",
  "updated_at": "2025-03-29T12:52:44+02:00"
}