{
  "name": "Koschei",
  "url": "http://jewornotjew.com/profile.jsp?ID=3468",
  "verdict": "Not a Jew",
  "description": "In a castle on top of a mountain, somewhere deep in Slavic folklore...\n\nIvan: \"I've made it! Die, Koschei!\"\n\nKoschei: \"Oh, it's you. Ivan, is it?\"\n\nI: \"How did you know?\"\n\nK: \"It's always Ivan. Which one are you this time?\"\n\nI: \"Ivan Tsarevich, of course!\"\n\nK: \"Oh, Ivan the czar's son. Good on you. I was expecting Ivan the Fool.\"\n\nI: \"I am no fool!\"\n\nK: \"And yet, here you are...\"\n\nI: \"What are you even talking about? Die, Koschei!\"\n\nK: \"Uhh... Die? You know my name, right?\"\n\nI: \"Koschei, of course. Or is it Kaschei?\"\n\nK: \"Either is fine. But that's Koschei the Deathless to you. Koschei the Immortal, if you like.\"\n\nI: \"Oh, you'll get your death!\"\n\nK: \"Yes, I'll have my death. My death is in a needle, and the needle is in an egg, and that egg is in a chicken... no, wait, a duck, and that duck is in...\"\n\nI: \"Enough talking, old man! Prepare to die!\"\n\nK: \"Are you even listening? Death-less. Are you sure you're not Ivan the Fool? Why do you even want to kill me?\"\n\nI: \"I am on a quest to rescue the princess!\"\n\nK: \"I've got no princesses here.\"\n\nI: \"Are you sure?\"\n\nK: \"Who do you take me for? I would know if there was a princess here.\"\n\nI: \"But they said you kidnapped her!\"\n\nK: \"Did they? Did you even get that princess' name?\"\n\nI: \"Maria!\"\n\nK: \"It's always Maria. Boy, these storytellers have no imagination! Ivan and Maria! No, no Maria here. Just me and my chests of gold.\"\n\nI: \"Then, if there is no Maria, give me your gold!\"\n\nK: \"See, now we are finally getting to the point. I am not giving you my gold.\"\n\nI: \"Come on, old man, don't you jew me!\"\n\nK: \"Excuse me? Did I hear that right?\"\n\nI: \"You know what you heard!\"\n\nK: \"I am no Jew. Some researchers have drawn parallels between my story and that of Samson, but that's a lot of bologna...\"\n\nI: \"Who is Samson? And what is bologna?\"\n\nK: \"You really are the fool, aren't you? Now get out of here, I've got all this gold to count!\"",
  "pros": null,
  "cons": null,
  "score": 3468,
  "category": "Science",
  "image_url": "http://jewornotjew.com/img/people/k/koschei.jpg",
  "created_at": "2025-03-29T13:17:51+02:00",
  "updated_at": "2025-03-29T13:17:51+02:00"
}