{
  "name": "Kronk Pepikrankenitz",
  "url": "http://jewornotjew.com/profile.jsp?ID=754",
  "verdict": "Jew",
  "description": "Parents of America!\n\nWe have to warn you. There is a monster consuming your children, and its name is Disney.\n\nSay you purchase your children a DVD of a Disney classic, such as \"Aladdin\" or \"The Lion King\". Terrific movies, good songs, solid plot, Robin Williams or Matthew Broderick... The whole family will enjoy. Yes, even with Robin Williams involved.\n\nBut as much as you yourself will enjoy the movies, your children will enjoy them MORE. So much more that you'll end up playing these same DVDs over and over again. Until one day, when Williams' or Broderick's voice gets tattooed on your brain, and you shell out the money to buy the straight-to-video sequel.\n\nAnd your children might be happy to see their characters again. But you won't be. Everything will be worse. The quality of the animation, the songs, the lead actors, especially the plot. Hell, you might even miss Robin Williams.\n\nDisney doesn't do it with just the classics, but also with also-rans like \"The Emperor's New Groove\". But there is one possibly redeeming thing about that sequel. In it, Kronk, the sidekick to Emperor Kuzco in the original, reveals that he is Jewish.\n\nNow, we realize that Disney will never have a Jewish princess. We realize that a Disney Jewish hero is too much to ask. We realize that Disney is trying to throw us a bone here, like they did with Timon of \"The Lion King\". But... Kronk?\n\nKronk Pepikrankenitz? That's Pepikrankenitz, an Incan warrior? A Jewish Incan warrior? How is that even possible?\n\nOK, here's one way: if you subscribe to Thor Heyerdahl's theories on migration of nations, it's possible that Jews sailed across the Atlantic centuries ago, and then cross-bred with the Incas. But then, wouldn't we see more manifestations of Judaism in the Inca cultures other than in Kronk, who — get this — is shown marrying his sweetheart in a Jewish ceremony, glass-stepping and all?\n\nSeems unnecessary, if you ask us. But so are all Disney sequels.",
  "pros": null,
  "cons": null,
  "score": 754,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/k/kronk_pepikrankenitz.jpg",
  "created_at": "2025-03-29T12:53:01+02:00",
  "updated_at": "2025-03-29T12:53:01+02:00"
}