{
  "name": "L. L. Zamenhof",
  "url": "http://jewornotjew.com/profile.jsp?ID=1331",
  "verdict": "Jew",
  "description": "Ancient Babylonia. The angels Gabriel and Raphael are looking down from the clouds.\n\nRaphael: Look at those stupid humans, building that stupid tower. Who do they think they are?\n\nGabriel: I dunno, I kinda like it.\n\nRaphael: Like it? It's blasphemous! Look how tall it is! Almost reaching the sky!\n\nGabriel: It can't reach the sky, it's not like the sky is solid or anything...\n\nRaphael: Well, they don't know that, do they?\n\nGabriel: No, they don't. Dumb humans. In any case, I don't think He minds...\n\nRaphael: Oh, I'll make sure He minds!\n\nGabriel: Don't you think there's already enough for Him to worry about? There is a new tyrant in Corinth. A famine in Australia...\n\nRaphael: What the hell is Australia?\n\nGabriel: Besides, you remember what happened the last time you tried to bother Him?\n\nRaphael: Yes, He...\n\nGabriel: He sent you down to live with the humans.\n\nRaphael: Worst month of my life. Although Beverly was nice.\n\nGabriel: The Whore of Babylon?\n\nRaphael: She prefers the term concubine.\n\nGabriel: How did you and the... concubine...\n\nRaphael: Never mind that! This time will be different! I'll make sure He puts an end to this!\n\nLater that day. Raphael flies over to Gabriel's cloud. Gabriel is nervously looking down.\n\nGabriel: What's going on there?\n\nRaphael: Look at these petty little humans! Screaming at each other, and no one can understand a word!\n\nGabriel: What did He do?\n\nRaphael: Scrambled their languages. Now every human can't understand what the other one is saying. Oh, the hilarity!\n\nGabriel: Yes, its beyond hilarious.\n\nRaphael: Look, that one threw a brick at another! Soon, their whole tower will crumble!\n\nGabriel: So I take it, this time He had the time for your complaints?\n\nRaphael: Yes, I lucked out. He just beat Satan in dominoes, so He was in good mood.\n\nGabriel: But all these languages... How will humans ever learn to cooperate?\n\nRaphael: Since when do you care about humans so much? Besides, He said this isn't forever.\n\nGabriel: No?\n\nRaphael: He says, in 2000 years, give or take, a Jew will try re-create the unifying language. Esperanto, he will call it.\n\nGabriel: It's always a Jew, isn't it?\n\nRaphael: They are a smart bunch, I give you that. Bank on this, though, I'll make sure this Esperanto will not take.\n\nGabriel: And how will you do that?\n\nRaphael: I have two millennia to figure it out! But now I have to say goodbye...\n\nGabriel: He banished you again?\n\nRaphael: For a year this time. See you, chump. I'm coming, Beverly!",
  "pros": null,
  "cons": null,
  "score": 1331,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/l/l__l__zamenhof.jpg",
  "created_at": "2025-03-29T13:16:56+02:00",
  "updated_at": "2025-03-29T13:16:56+02:00"
}