{
  "name": "Lazarus",
  "url": "http://jewornotjew.com/profile.jsp?ID=2366",
  "verdict": "Sadly, a Jew.",
  "description": "It all started the previous summer... no, maybe early fall... no, wait, definitely summer... Jeremy comes in and says, you want to party? Hell yeah, I say. So Jeremy says, look what I got. What is it, I say. Hemp, he says. Are you mental, I say, how can you party with hemp? Don't worry, he says, it all started the previous summer... No, wait, I already said that...\n\nSo Jeremy, don't worry, he says, we just roll this hemp in this leaf, and smoke it! What leaf, I say, but that's not important... So we smoke it... Man, that's some good shit!\n\nSo Jesus comes by one day... How do I know Jesus? Martha, my older sis, used to hang out with him... Or was it Mary? Maybe both? Hard to keep track, he used to get around... Anyway, one day Martha brings him home, and he says, what is that stuff? Hemp, I say, want a toke? He says, sure, why not? Jesus used to do all kind of stuff, don't get me started... Like once, he and that guy Simon sneaked into a girls school at night, and... Never mind that, so Jesus lights up, this is some good shit, he says, and Jeremy says, I can get you some more, and Jesus says, cool...\n\nSo every now and then Jesus starts to come around, and then one day Jeremy says, you know, Jesus, you're cool and shit, but we can't just keep giving you this stuff for free... And Jesus says, what the hell, I thought we were friends, and Jeremy says, friends or not, man, that's not cool, and I say, come on, Jesus, Jeremy is trying to be fair here, so Jesus says, alright, give me some time, I'll pay up. And we trust him, you know, I mean, this is Jesus we're talking about. He's an alright dude.\n\nNext time Jesus comes, he says, check what I got. What is it, I say. And he shows us some powder. It's made from poppy seeds, he says. Poppy seeds, what the hell? We're not making bagels here, Jesus. This is not for bagels, he says. Then Jeremy yells, what the fuck, Jesus, I trusted you, you promised me money, and you give me this bagel shit? Calm down, Jeremy, Jesus says, this poppy stuff is like your hemp, but much better. Just try it. I dunno about that, says Jeremy, but I tell him, come on, Jeremy, this is Jesus, come on, let's try it...\n\nJeremy tries the poppy stuff, and he just drops on his back, and his eyes roll back in his head, and he just stays there, and I scream, what the fuck, Jesus, but Jesus says, wait, wait, wait... We wait a bit, and Jeremy's eyes pop open, and he springs up, man, he says, man, Jesus, you were fucking right, man, that's some shit right there!\n\nGive me some, I say, so Jesus hands it over to me, and I...\n\nNext thing I remember, I wake up. It's dark... It's so fucking dark. Am I dead, I think. I must be dead! What the fuck have you done with me, Jesus? I'm dead!\n\nThen my eyes get used to it, and it's not so dark anymore. I can see some light through holes in the wall... And some stalagmites... or is that stalactites... Am I in a cave? What the hell am I doing in a cave? Maybe I'm not dead? And why the hell am I wearing these white robes?\n\nI try to feel my way around and find what looks like the door, and I try to push it, and it won't budge, so I bang on it, and yell, but of course no one can hear me, what the fuck, Jesus? What have you done to me? I'm stuck here forever!\n\nSo for the next couple of days, I pace around the damn cave, eat some mushrooms I found growing in the corner, not bad, could be worse, and drink the water that collected through holes in the ceiling... and think of one thing: revenge! Oh, Jesus, just wait until I get out of here, I'll show you!\n\nThen... there is a slither of light, and then the door opens, and who is there? Jesus! Rise, Lazarus, he says. Rise from the dead! I'm not dead, you asshole, I try to tell him, but before I get a chance to, Martha and Mary run in, and hug me, and then Martha hugs Jesus, and kisses him on the mouth, and they make out for a while, see, I was right, it was Martha who used to go with him, and then Jesus just starts crying. He cries and cries...\n\nThat's my story... So if you ever hear Jesus claim he resurrected the dead, now you know the truth. Fucking Jesus. Hey, maybe you have some hemp? Mind if I have a toke? It all started the previous summer...",
  "pros": null,
  "cons": null,
  "score": 2366,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/l/lazarus.jpg",
  "created_at": "2025-03-29T13:17:23+02:00",
  "updated_at": "2025-03-29T13:17:23+02:00"
}