{
  "name": "Leah and Rachel",
  "url": "http://jewornotjew.com/profile.jsp?ID=1525",
  "verdict": "Jew",
  "description": "OK, Disney, enough's enough. It's time to make ourselves a Jewish Princess movie. And do we have the story for you!\n\nYoung Rachel is beautiful and earnest and lives on a farm with her father and her ugly older sister.  You do the whole montage of Rachel's degrading farm life with her mean sister Leah and her slave-driving, apathetic father Laban (hmmm, that might be too Jewy. Even for this movie. We'll call him... Larry. Better?). She milks cows, plants crops, pickles herrings, the whole megillah.\n\nThen one day a handsome man appears over the horizon. It's her cous... er, random man she's never met before, Jacob! Jacob is handsome! Jacob is wise! Jacob seems really anxious to get away from his family for some reason, but what the hey! Jacob and Rachel immediately fall in love. There is much singing, romantic duets, Oscars abound. \n\nExcept then here comes mean old Larry who declares that Jacob cannot marry Rachel. He must marry Leah instead, because Leah is the eldest sister. Oh, the horrors! Jacob doesn't love Leah. Leah's ugly (and a bit of a bitch, too, if truth be told)! So Jacob negotiates a deal with his Uncle Larry. He will labor for seven years in Larry's service and in exchange he gets to marry his true love, Rachel.\n\nThe day of the wedding arrives. The talking pigs cannot contain their excitement (we didn't mention the talking pigs? Oh, Disney, of course there will be talking pigs. Herschel and Hamisch we'll call them and OH how funny they will be). The bride walks down the aisle.  Jacob is so happy. But then he lifts the veil and discovers that he has married... Leah!? Larry has tricked him!\n\nBut not to worry. Jacob knows how he and his beloved Rachel can live happily ever after. He will marry both... of...\n\nY'know, Disney? Maybe this isn't the tale for you. But have you heard the story of Delilah? Now that's a movie that can't miss!",
  "pros": null,
  "cons": null,
  "score": 1525,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/l/leah_and_rachel.jpg",
  "created_at": "2025-03-29T13:17:01+02:00",
  "updated_at": "2025-03-29T13:17:01+02:00"
}