{
  "name": "Lenina Varshavskaya",
  "url": "http://jewornotjew.com/profile.jsp?ID=3225",
  "verdict": "Jew",
  "description": "After Lenin's death in 1924, the Soviets really, really tried hard to make sure he was not forgotten. His face adorned every wall in the country, his slogans were pasted everywhere imaginable, his mummy was placed on display for all to see... Ewww. Gross. (IT'S STILL THERE!)\n\nBut what could a common Soviet citizen do? Sure, they can hang a picture of Lenin on their wall, and read wonderful stories about Lenin's willpower (Did you know how he quit smoking in ONE DAY?), ingenuity (Did you know that while in jail, he made inkwells out of bread?), or modesty (Did you know that he refused to cut in line to get a haircut?), but is that really enough? How else could an ordinary Soviet extend the legacy...\n\nWell, through children, of course! Specifically, through children's names. And no, not by calling your child Vladimir, that would be too easy. (And what if you, God Party forbid, have a girl?) By coming up with new, complex names!\n\nThe most popular names turned out to be Vladlen (VLADimir LENin) for boys and Ninel (Lenin backwards) for girls, but those just scratch the surface of Soviet creativity. Lenar (LENin's ARmy), Vilior (Vladimir Ilich Lenin and October Revolution), Idlen (IDeas of LENin), Genvil (GENius of Vladimir Ilich Lenin)... There were acronyms for \"Lenin is dead, but his work lives on\" (Leundezh), \"Lenin: friend of children\" (Ledrud), \"Lenin's lightbulb\" (Lailya)...\n\nSo, on the grand scheme of things, \"Lenina\" is pretty tame. Lenina Varshavksaya was a heroic Jewish military doctor, who lied about her age to join the army at 16. She single-handedly captured two Nazi officers. While wounded herself, she saved nine soldiers from dying on the battlefield. Alas, she didn't see her 20th birthday, killed in Estonia as the war was winding down. And, as far as her name goes, it looks like she just went by \"Elena\", despite what the birth certificate said.\n\nWell, Lenin names are a sign of the past, we're pretty sure there are currently a bunch of young Vladputs running around Russia...",
  "pros": null,
  "cons": null,
  "score": 3225,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/l/lenina_varshavskaya.jpg",
  "created_at": "2025-03-29T13:17:45+02:00",
  "updated_at": "2025-03-29T13:17:45+02:00"
}