{
  "name": "Leopold and Loeb",
  "url": "http://jewornotjew.com/profile.jsp?ID=748",
  "verdict": "Sadly, a Jew.",
  "description": "What is the most popular category on JONJ?\n\nWe always thought it would be Actresses and Models or Fictional Characters. Both make a ton of sense, honestly. But having demoed the site for quite a few people over the years, everyone always clicks on one category first: Sociopaths.\n\nAnd yeah, we can see it. After all, sociopath is really a fun intellectual concept. More than criminals or the insane, sociopaths encompasses a whole range of whack jobs and psychos. Nothing beats that.\n\nWhat about Leopold and Loeb? Holiest of holies do they fit the bill. Back in the 1920s, Nathan Leopold and Richard Loeb were two out-and-out geniuses (Leopold's IQ was in the low 200s, Loeb was the youngest graduate ever from the University of Michigan) living in the oh-so-Jewish Chicago suburb of Kenwood. Both were Jews. And both were obsessed with the idea of the Nietzschean Superman (the philosophical concept, not the superhero. Remember, they were nuts, not nerds) and decided to prove their own supremacy by committing the perfect crime: in this case, murdering a third Jewish young man who was a neighbor of theirs.\n\nHowever, their \"perfect crime\" was a perfect mess. They were caught, confessed, and plead guilty in what may very well have been the first ever \"Crime of the Century.\" Their exploits later inspired multiple books, movies and TV shows, and their actions have reverberated even to this day.\n\nY'know, when we started this site looking for famous Jews, whackadoos like these two weren't what we had in mind. Still, what the public wants, the public gets.\n\nJews? Check. Sociopaths? Check. Ratings gold? We'll just have to wait and see.",
  "pros": null,
  "cons": null,
  "score": 748,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/l/leopold_and_loeb.jpg",
  "created_at": "2025-03-29T12:53:00+02:00",
  "updated_at": "2025-03-29T12:53:00+02:00"
}