{
  "name": "Les Paul",
  "url": "http://jewornotjew.com/profile.jsp?ID=606",
  "verdict": "Sadly, Not a Jew.",
  "description": "Les Paul is one of those people that makes hyperbole problematic. We use words like \"legend\" and \"groundbreaking\" and \"genius\" so often that when a legitimately legendary, groundbreaking genius such as Les Paul comes along the words sound empty and insufficient. We'll just say that his recent passing leaves a small hollow spot in the solid bodied-guitar of our hearts.\n\nBut really, who gives a crap about all that stuff when we've got Jews to rate, right? So how do we figure that out?\n\nWe start at the usual spot, Wikipedia, which  seemed to think so a while back, but then the content was changed and now Wikipedia thinks he's not. \n\nThat's too wishy washy for ones so dedicated to accuracy as us, so we Google him up and find several online music magazines have written that Paul was of German-Jewish decent. But then, other, more mainstream sources (New York Times, Rolling Stone) are disconcertingly mum. \n\nSo we're still in the darkness, which means taking drastic measures. We have to read a book. According to \"The Early Years of the Les Paul Legacy 1915-1963\", Les Paul's parents were Prussian. His original name of Polsfuss is not demonstrably Jewish, nor is his mother's maiden name, Stutz. You have to go all the way back to his grandmother's maiden name to find the first Jewish-sounding surname, Meyer, and even that's not a lock.\n\nFurther, still from that book-y thing, Paul's parents emigrated to Wisconsin in the 1800s, were involved in farming and brewed beer. All very stereotypical German immigrant things to do. But not stereotypically German-Jewish things. \n\nSo it's looking bad. But we still want one more source to erase all doubt and that means (GASP) opening yet another dusty tome. In this case, \"Famous Wisconsin Musicians\" by Susan Masino (with a forward by Lester himself!), which mentions Paul's attendance at church socials as a boy. \n\nYup, that'll do it. Les Paul: Not a Jew. \n\nBut wow, what a long way to go just to get there, huh?",
  "pros": null,
  "cons": null,
  "score": 606,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/l/les_paul.jpg",
  "created_at": "2025-03-29T12:52:57+02:00",
  "updated_at": "2025-03-29T12:52:57+02:00"
}