{
  "name": "Lewis Skolnick",
  "url": "http://jewornotjew.com/profile.jsp?ID=592",
  "verdict": "Jew",
  "description": "Nerds!!!  \n\nWait. Let's try that again. NERDS!!!! \n\nOh yes, that's much better.\n\nIn any case, yeah, Revenge of the Nerds. Great pic, that one. If you've managed to miss it (or just been stuck with the unwatchable, sanitized cable version), Revenge of the Nerds tells the intrepid tale of a group of young social outcasts and weirdos forced to overcome the  anti-intellectualism ingrained in the 1980s American university. Naturally, this involves belching contests, binge drinking, marijuana and rampant sex. Well, come on, how else do you attack society's most intractable social mores?\n\nClearly, it's a good film if you don't think about it too much. It's also full of Jews. Frankly, it's easier to list the characters who are NOT Jewish: Coach Harris, Jock Stan Gable, Foreign exchange student Toshiro Takashi, closet(?) homosexual Lamar Latrell, shiksa Betty Childs, and \"Booger\" Dawson. The rest? Jews. Including our good friend Lewis on the left.\n\nOrdinarily, this is the point where we rail against the negative stereotype of geeky Jews and declare that the movie is another disgusting example of the subtle anti-Semitism in American culture. \n\nBut we're not going there and here's why. Have you looked around lately? The guys hanging around their dorm room playing video games and working on the computer? That's... actually, that's everyone. \n\nThis is a world where professional baseball player Curt Schilling — a well-known musclehead — retired to work on his massively multiplayer online role playing game and no one blinked an eye. \n\nIt's a nerd's world, bitches! And y'know what? We're proud to bask in it.\n\nAt least until the inevitable \"Revenge of the Jocks\" comes out.",
  "pros": null,
  "cons": null,
  "score": 592,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/l/lewis_skolnick.jpg",
  "created_at": "2025-03-29T12:52:57+02:00",
  "updated_at": "2025-03-29T12:52:57+02:00"
}