{
  "name": "Lex Luthor",
  "url": "http://jewornotjew.com/profile.jsp?ID=1830",
  "verdict": "Not a Jew",
  "description": "Meanwhile, in the swamps of New Jersey, the Legion of Doom plots their next nefarious scheme...\n\nLuthor: All right, all right. Everybody calm down. Let's go through the status. 110054, the weather machine. Where is that at?\n\nCheetah: All is going puuurrrrfectly. Soon, the entire world will be covered in water!\n\nLuthor: OK, great. Don't forget to get your hours in before I close out the job.  What about job 110064, that's the... ah yes, this is that thing that's going to turn the sun into a giant hunk of kryptonite? \n\nBraniac: I am still waiting for the estimate from the contractor.\n\nLuthor: Can't we just... push it through? We were supposed to have started construction on the posi-negi-matter ray last week!\n\nSolomon Grundy: Grrrrr... Grundy says no can do that! Everything has to be triple...\n\nLuthor: Triple bid. Yes, yes, yes. I know. Well get after this guy, would you, please? We're already behind schedule on the project. Anything else?\n\nSinestro: Ahem, yes, well. Isn't anyone going to bring up the pernicious rumor regarding your... shall we say, heritage?\n\nLuthor: It's all nonsense. I'm not Jewish. It's just another antisemitic smear campaign.\n\nBizarro: Me Bizarro. Me am Jewish.\n\nGorilla Grodd: Don't be ridiculous. You're not Jewish, Bizarro.\n\nBizarro: Me Bizarro no am sure. Me think me am Jewish.\n\nGiganta: Oh for pete's sake...\n\nCaptain Cold: Wait, maybe he's doing that backwards talking thing again.\n\nBizarro: Yes, Cold is wrong. Bizarro am Jewish.\n\nLuthor: Argh! All of this is giving me a colossal headache. I'm not Jewish. That's it. Can we please just move on now?\n\nSinestro: Of course. Oh, also, before I forget, the moon laser has been delayed another week.\n\nLuthor: God...! Fine. You know what? Fine. Just... just let's all get back to work...",
  "pros": null,
  "cons": null,
  "score": 1830,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/l/lex_luthor.jpg",
  "created_at": "2025-03-29T13:17:09+02:00",
  "updated_at": "2025-03-29T13:17:09+02:00"
}