{
  "name": "Little Mac",
  "url": "http://jewornotjew.com/profile.jsp?ID=623",
  "verdict": "Jew",
  "description": "What is Punch-Out? Well, if you haven't played the game, Nintendo's Punch-Out puts players in the shoes of the young, talented Little Mac, beating up blatant racial stereotypes in an attempt to win the world boxing title. \n\nYes, really. G-d Bless Japan. In any case, the game was just re-released for the Wii and it made us wonder: With so many borderline bigoted portrayals, where's the Jew?\n\nLet's pretend to be organized and do this all alphabetical-like (with an assist from The Nintendo Wiki):\n\nAran Ryan is a \"crafty, cheating Irishman\"\nBald Bull is Turkish and charges at you\nBear Hugger is the Canadian champion who \"lives in the woods and trains with a bear\"\nDisco Kid is black (he's basically Billy Blanks)\nDon Flamenco is Spanish and tells us not to mess with his hair\nGlass Joe is a Frenchman who falls down after one hit (seriously, you can't make stuff like this up)\nGreat Tiger is Indian and uses magic\nKing Hippo is an overweight Pacific Islander who can't keep his pants from falling down\nMr. Sandman is black (he's from Philly. Is he Black Rocky?)\nPiston Honda is Japanese and donates his winnings to his community\nSuper Macho Man is white and from California. He'd be a possibility except no Jew has ever been referred to as Super Macho, so he's out.\nSoda Popinski (formerly Vodka Drunkenski) is a Russian with a drinking problem\nVon Kaiser is German and likes to shine his boots\n\nLet's all say it together now: Yes, really. In any case, how is it that Little Mac fights so many other groups, but not Jews? Isn't the game just begging for a Torah Matzoh character or something? \n\nThere's only one possible explanation. Only one that explains the exploits of a character who fights so many historic Jewish enemies. For if Mac stands for anything, shouldn't it stand for Maccabee?\n\nThat's right, people, we're going there. Little Mac?",
  "pros": null,
  "cons": null,
  "score": 623,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/l/little_mac.jpg",
  "created_at": "2025-03-29T12:52:58+02:00",
  "updated_at": "2025-03-29T12:52:58+02:00"
}