{
  "name": "Lou Gehrig",
  "url": "http://jewornotjew.com/profile.jsp?ID=947",
  "verdict": "Sadly, Not a Jew.",
  "description": "Today (Today... today... todayyyyy) I consider myself... the unluckiest man... on the face of the Earth.\n\nI look around me at all you fans, at my teammates both current and former. And I think it should be pretty clear to every single person here:\n\nI got jobbed. \n\nReally, truly, fully jobbed in a sense that had never been formerly conceived as possible.\n\nLook at Babe here. He drank. Smoked. Womanized. He is an athlete only in the most perverted of definitions. I have seen Babe do some things... I did not believe even animals were capable of the things I've seen Babe do. And yet here he stands, a picture of health. While I have been stricken by this debilitating disease that has robbed me of my health, my body, my very humanity.\n\nI lived the way we've all been taught we're supposed to. I loved my mother. Was faithful to my wife. Attended university. Went to church, despite any rumors to the contrary. Stayed in peak physical condition. And now I've got this bullshit.\n\nIs there anything to learn from this? Anything to be gained from my tragedy? You betcha: Don't try. Seriously kids. Going out there, trying to be nice? Trying to be a good person? Fuck it. Go get wasted. Do a whole bucket of cocaine off a whore's ass while she bobs for apples. Read horse racing pamphlets, not books. Slam your penis into anything with a warm, wet hole.  It's all just a big fucking waste of time till G-d strikes you down for being anything but a rotten, spoiled asshole. Yeah, I'm talking to you Babe you fat, useless tub of home run hitting lard that will always be remembered better than me because for some unfathomable reason you do well with kids. Probably because you fathered so many illegitimate ones...\n\nFans, for the past two weeks you have been reading about the \"bad break\" I got. \"Bad break?\" You don't know the fucking half of it. You think of me the next time you're wiping your own ass. Cause now I need my wife to do it for me.\n\nI hope you all fucking rot.",
  "pros": null,
  "cons": null,
  "score": 947,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/l/lou_gehrig.jpg",
  "created_at": "2025-03-29T12:53:05+02:00",
  "updated_at": "2025-03-29T12:53:05+02:00"
}