{
  "name": "Louis Garrel",
  "url": "http://jewornotjew.com/profile.jsp?ID=3485",
  "verdict": "Barely a Jew",
  "description": "This is not the first time we're kvetching about film adaptations of \"The Three Musketeers\", which is what we said the last time we kvetched about film adaptations of \"The Three Musketeers\", so... let's kvetch.\n\nToday's subject of derision is the new French adaptation, a two-part production that came out last year. (It's not readily available in the US, but we were lucky(?) to watch the first part on an airplane.) It's critically and commercially acclaimed. Just not by us.\n\nWhere do we begin? The actor who plays d'Artagnan is completely free of charisma. Athos is played by a 55-year-old. Porthos is now into dudes. We're not even sure if Aramis is in the movie. The plot is completely mangled, from Athos immediately revealing his supposedly-secret identity to putting Athos in a middle of a court case (\"Law \u0026 Order: 17th Century Paris\"!?) to giving Athos a Protestant brother to... Oh, Athos doesn't deserve any of this! There are plenty of gun fights, which are fine in theory, but do the filmmakers know how long it took to load a gun in the early 1600s? They weren't rapid-firing, that's for sure.\n\nDid we like anything about the movie, and, because this is JONJ, are there any Jews? Yes! Milady is played by the wonderful Eva Green, who is not blond, but we'll (mostly) ingore this (minor) inconsistency. The Duke of Buckingham is played by also-previously-profiled Jacob Fortune-Lloyd. Louis Garrel, an acclaimed French actor of Jewish descent, has an interesting take on King Louis XIII, turning him from a milquetoast puppet of Richelieu to someone with an actual agenda.\n\nWe haven't seen the second part yet, which apparently turns Mordaunt into Athos' son... No. Just no. Oh, and the French are now putting out a new version of \"The Count of Monte Cristo\".\n\nWe bet we're gonna have to kvetch about that one as well.",
  "pros": null,
  "cons": [
    "istency. The Duke of Buckingham is played by also",
    "profiled Jacob Fortune"
  ],
  "score": 3485,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/l/louis_garrel.jpg",
  "created_at": "2025-03-29T13:17:52+02:00",
  "updated_at": "2025-03-29T13:17:52+02:00"
}