{
  "name": "Louis Brandeis",
  "url": "http://jewornotjew.com/profile.jsp?ID=931",
  "verdict": "Jew",
  "description": "Someone in a stereotypical state of mind might look at our little shetl and wonder why we choose such a small spectrum of careers. Of course, we have nearly a millennium of profiles proving this kind of broad categorization to be categorically incorrect. But even we must concede that certain jobs seem heavily Hebrew. So, we ask:\n\nWhy are so many doctors Jewish?: To be learned and to able to provide for your family (your large family. I want grandkids and I'm not getting any younger, y'know). Those are the two highest mitzvahs in the eyes of our most important evaluators (aka, our mothers). Yeah, so it doesn't take a brain surgeon to figure this one out, does it? \n\nWhy are so many dentists Jewish?: Well, not all of those Jewish-doctor-wannabes are smart enough for med school, right? (Kidding. Put down the drill. Put down the AAAAAAAAaaaaaaaa......)\n\nWhy are so many comedians Jewish?: Jews have been through a lot. Even our New Years' is depressing. The human brain only has one way to deal with that: humor. Or, y'know, death. We chose humor. So there ya go.\n\nWhy are so many lawyers Jewish?: Christianity (painting with a wide brush here, we grant you) provides laws that are unchangeable — as it is written, so it is done. Papal infallibility is a very Christian idea. Judaism, though, has nothing of the sort. Jewish law is meant to be debated. Argued. Preferably by large, sweaty men with long beards and repugnant BO. Rabbis, in many ways, are just another form of lawyer, debating the meaning of religious rather than government statutes. It just comes naturally to us.\n\nWhy are so many judges Jewish?: Y'know what? You've got us there. There's no ingrained Jewish need to weigh one person against the other. Sitting on high, answering an obscure question that is only interesting to a small subset of people using available evidence and then delivering a decision? Maybe that makes some people happy. \n\nBut to us? We just don't see the attraction.",
  "pros": null,
  "cons": null,
  "score": 931,
  "category": "Comedy",
  "image_url": "http://jewornotjew.com/img/people/l/louis_brandeis.jpg",
  "created_at": "2025-03-29T12:53:05+02:00",
  "updated_at": "2025-03-29T12:53:05+02:00"
}