{
  "name": "Mahmoud Ahmadinejad",
  "url": "http://jewornotjew.com/profile.jsp?ID=456",
  "verdict": "Not a Jew",
  "description": "In America, when someone tries to discredit a political rival, they usually go after one's sexual liaisons or financial transgressions.\n\nIn Iran, one would just say that their rival is Jewish.\n\nAll liaisons (and remember, there are no homosexuals in Iran, so that eliminates that area altogether) and transgressions would pale by comparison.\n\nSo it should come to no surprise that the son of Ayatollah Khazali, rival to Mahmoud Ahmadinejad, has written on his blog(!) that good old Mahmoud has Jewish roots.\n\nAccording to the younger Khazali, the Ahmadinejads changed their last name from Sabourjian, and that the origins of the Sabourjians should be investigated. You see, Sabourijan means \"thread painter\", an occupation that was once supposedly associated with Jews.\n\nA few months later, the story was investigated. And the findings were astonishing! Yes, the Ahmadinejads changed their name. And no, Sabourijan does not mean \"thread painter\", but rather \"weaver of Sabour\", Sabour supposedly being a Jewish shawl! So...\n\nSo what? Which translation is correct, and what does the new one prove (and why Sabour, a region of Pakistan, a country neighboring Iran, is not considered as a possible name origin)? Seriously, so what? Take a look through our website. There are many, many non-Jews with last names that seem obviously Jewish. But Mahmoud himself is clearly not Jewish. There's no proof that his parents were either. Exactly how many generations do we have to go up that family tree to find that supposed Jewish thread painter or shawl weaver?\n\nSo is it possible? Well, it's not impossible that if a number of flimsy assumptions hold, Ahmadinejad would not be just an antisemite, but an antisemite... with Jewish ancestry.\n\nBut we doubt it.",
  "pros": null,
  "cons": null,
  "score": 456,
  "category": "Politics",
  "image_url": "http://jewornotjew.com/img/people/m/mahmoud_ahmadinejad.jpg",
  "created_at": "2025-03-29T12:52:53+02:00",
  "updated_at": "2025-03-29T12:52:53+02:00"
}