{
  "name": "Malachi Throne",
  "url": "http://jewornotjew.com/profile.jsp?ID=3124",
  "verdict": "Jew",
  "description": "Star Trek, the original TV series, ran on NBC from 1966-1969. The follow-up series, Star Trek: The Next Generation, began broadcasting in 1987. This 18-year gap means that there is a very small group of actors and actresses who appeared on both shows.\n\nExclude the big names who appeared as the same characters (Leonard Nimoy as Spock, DeForest Kelley as McCoy, James Doohan as Scotty, Majel Barret who voiced the ship's computer, and Mark Lenard as Sarek). Discount the movie Generations — where both casts appeared together, sort of — as a different thing (removing William Shatner as Kirk and Walter Koenig as Chekhov). Now you've got a pretty exclusive group!\n\nPerhaps the most famous of those is Diana Muldaur who appeared on the original series twice (in two different roles) and then played Dr. Pulaski in season 2 of TNG. But there's also Michael Pataki, who goaded Scotty into a bar fight as a Klingon and later was a vengeful governor who tried Picard's patience. And then there was Brian Tochi, who played a superpowered child (at age 9!) and then reappeared as an ensign on the bridge of the Enterprise-D.\n\nAnd that leads us to Malachi Throne, who actually appeared in the original, unaired pilot(!) The Cage, returned as a Commodore in the episode that reused that footage, The Menagerie, and then came back AGAIN to play a Romulan Senator in the two-part TNG episode, Unification.\n\nThat's a small club, indeed (to be fair, if we include Deep Space 9, then the list practically triples). But Throne has one more advantage in his favor. He also played False-Face in the camp classic Batman series!\n\nTwo stints on Star Trek AND a Batman role? Even Frank Gorshin can't keep up with that!",
  "pros": null,
  "cons": null,
  "score": 3124,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/m/malachi_throne.jpg",
  "created_at": "2025-03-29T13:17:42+02:00",
  "updated_at": "2025-03-29T13:17:42+02:00"
}