{
  "name": "Marcel Proust",
  "url": "http://jewornotjew.com/profile.jsp?ID=1009",
  "verdict": "Borderline Jew.",
  "description": "Oh, to be writers...  That's all we really want, America!  Ah, imagine it: sitting in front of the screen (or the notepad, hey, we can be all retro and stuff), putting our thoughts to the page and getting paid for it. Sigh....\n\nWriters like Marcel Proust. He of the seven-volume novel \"A la recherche du temps perdu\", or \"In Remembrance of Things Past\", or \"In Search of Lost Time\". Oh sure it's 4300 pages, 2000 characters, 1.3 million words and no plot. But W. Somerset Maugham called it \"the greatest fiction to date\". And anyone with a name that pretentious has to know what he's talking about, right? \n\nLots of other people love it too, including JONJ hero Michael Chabon, and it is considered to be one of the greatest novels of the 20th century. And who are we to judge, anyway? All we do is write a website about who may or may not be Jewish and we don't even get paid for it. We can say with certainty that Proust's mother was Jewish. But we're not qualified to judge literary greatness.\n\nOf course, Proust died before he could really reap the rewards of his novel. In fact he died before he could even finish the damned thing (to be fair, 1.3 million word novel — he should have seen that coming, no?). And he was turned down by every publisher he submitted it to, so had he not published it himself we'd never even know who Marcel Proust was. And pretty much everyone he knew and loved had already died by the time he was delivered to that great big Barnes \u0026 Noble in the sky, which is why he was so distraught as to be writing said longwinded pointless novel in the first place.\n\nAlone. Broke. Underappreciated. And that's not just Proust's fate, but the fate of most writers: only truly loved long after they've slipped off the mortal coil and joined the choir invisible.\n\nFeh.\n\nOh, to be musicians... That's all we really want, America!",
  "pros": null,
  "cons": null,
  "score": 1009,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/m/marcel_proust.jpg",
  "created_at": "2025-03-29T12:53:07+02:00",
  "updated_at": "2025-03-29T12:53:07+02:00"
}