{
  "name": "Marion Ravenwood",
  "url": "http://jewornotjew.com/profile.jsp?ID=995",
  "verdict": "Sadly, Not a Jew.",
  "description": "As we mentioned before, we love Indiana Jones here at JONJ. But where are the Jews?\n\nOh sure, there are plenty of Jews in front and behind the camera. Harrison Ford himself, director Steven Spielberg, even Kate Capshaw and Shia LeBeouf — with the latter two, we'll take what we can get. But where are the Jewish characters?\n\nLet's use the old process of elimination. It's not Indy himself (remember, he is Henry Jones Jr. — we called the dog Indiana!), and it's not his father (we tried to figure out if Indy's unseen mother might be, but various sources can't even agree on what her name is, never mind her ethnicity). It's not Indy pals Marcus Brody or Sallah — one is a prototypical WASP, the other a prototypical Egyptian. It's definitely not Short Round.\n\nIt's clearly none of the bad guys — Arnold Toht is a Nazi. Herman Dietrich is a Nazi. Rene Belloq is a French Nazi (sure, he performs a ritual in Jewish formal robes, but that's clearly dress-up). Everyone in Temple of Doom is Indian, presumably Hindi. (Or Muslim? Doesn't matter. No Jews.) Elsa Schneider is an Austrian Nazi. Walter Donovan is a WASPy Nazi. (In summary, Nazis: we hate these guys.) We gave some thought to Crystal Skull villainess Irina Spalko, but she is ethnically Ukrainian. So unlikely there.\n\nWhich leaves us with two: Willie Scott and Marion Ravenwood. Scott's full name is Wilhelmina, so we're gonna discount her. (No arguments here, please. Willie Scott, ditsy blonde, is not a Jew. Not by any stretch of imagination.)\n\nAnd then there's Marion. Feisty. Brunette. Indy's true love. We'd take her over any female character in history of film. But... we can't have her, as hard as we try.\n\n\"Ravenwood\" is anything but Jewish. Her father does have a Jewish first name, Abner, but that's neither here nor there. Her mother is unknown. We could postulate, we could grasp, we could say that she was Jewish, but who are we kidding...\n\nWell, one small hope. Karen Allen said that in playing Marion, she created a whole backstory for the character, a backstory that never made it onto film. Who knows, maybe Karen figured Marion to be Jewish? It's a small chance, but it's a chance, right?\n\nOr not.",
  "pros": null,
  "cons": null,
  "score": 995,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/m/marion_ravenwood.jpg",
  "created_at": "2025-03-29T12:53:07+02:00",
  "updated_at": "2025-03-29T12:53:07+02:00"
}