{
  "name": "Marty Turco",
  "url": "http://jewornotjew.com/profile.jsp?ID=976",
  "verdict": "Not a Jew",
  "description": "For years, we've had a thorn in our side. A person whose Jewishness, or lack there of, we could not determine. Someone who we've been asked about countless times, always responding with a \"we don't know\" and a look of deep shame. We, Jew or Not Jew, the knowers of all Jewish and Not!\n\nWe had no idea if Marty Turco is Jewish.\n\nCue the majority of our readers scratching their head. Marty... who? And why on earth would anyone wonder why he's Jewish?\n\nFor those who don't follow hockey, Turco is a veteran goaltender who spent a decade with the Dallas Stars. While he's not Martin Brodeur (but then, who is?), he's been a solid netminder for a long period of time.\n\nSo why are people wondering if he's Jewish? Well, we can't put our finger on it. Supposedly, there are rumors around the NHL. And every now and then, when a website decided to come up with its Top Jews in Sports list, Turco keeps popping up. Even though there is nothing out there to support that he is. Except another website with its list of Jews in sports.\n\nSo we get asked and asked. And we looked and looked. Nothing. We even emailed the Stars, and got no response. And we were about to drop Turco in our lost cases folder, when the Stanley Cup champion Chicago Blackhawks had to dump their starting goaltender Antti Niemi for salary cap reasons.\n\nTurco, a free agent, went to Chicago. And we, in our last hope to crack the case, emailed the Blackhawks. Two days later, we got our response. (See, Dallas front office? This is a way to handle public relations.) Turco is not Jewish. Case closed.\n\nNow for our next unsolved case: is anyone still gonna care about Marty Turco?",
  "pros": null,
  "cons": null,
  "score": 976,
  "category": "Art",
  "image_url": "http://jewornotjew.com/img/people/m/marty_turco.jpg",
  "created_at": "2025-03-29T12:53:06+02:00",
  "updated_at": "2025-03-29T12:53:06+02:00"
}