{
  "name": "Martin Niemoller",
  "url": "http://jewornotjew.com/profile.jsp?ID=2609",
  "verdict": "Not a Jew",
  "description": "Some of us were away from America for a week, landing back on October 27, 2018. At the airport, we were greeted by TV screens telling us that a gunman opened fire in a Pittsburgh synagogue, killing 11. Shocked, we re-entered our country. Thoughts and prayers...\n\nPerhaps we shouldn't have been shocked. The current political climate, with hate speech spewing from the White House itself, has empowered the fringe to the point of insanity. Spare us the cries that it's coming from both sides: it's NOT. With their avatar in charge, the American fascists are feeling in power. Blacks and Muslims were an easy target; now they're coming for Jews. \"Jews are the children of Satan,\" reads the Twitter profile of the murderous sociopath. Do you think he is the only one in America who is thinking that? Do you think he is the only one with an arsenal at his disposal?\n\nOh, and our buffoon president, for we can't help but mention the response of the lunatic who is running our country! Armed guards in the synagogue are his answer... because nothing helps stopping gun violence than more guns.\n\nThe problem is with you, America, the gun culture that is embedded in your soul, the interest groups, corporations, and lobbyists that do not allow reform, and the politicians that enable it all to happen. Thoughts and prayers are an empty thought.\n\nAnd for those of you who are not black, Muslim, or Jewish, let us quote the German PASTOR Martin Niemoller:\n\n\nFirst they came for the communists, and I did not speak out — \nBecause I was not a communist.\nThen they came for the Jews, and I did not speak out — Because I was not a Jew.\nThen they came for the trade unionists, and I did not speak out — \nBecause I was not a trade unionist.\nThen they came for the Catholics, and I did not speak out — Because I was a Protestant.\nThen they came for me — and there was no one left to speak for me.",
  "pros": null,
  "cons": null,
  "score": 2609,
  "category": "Art",
  "image_url": "http://jewornotjew.com/img/people/m/martin_niemoller.jpg",
  "created_at": "2025-03-29T13:17:29+02:00",
  "updated_at": "2025-03-29T13:17:29+02:00"
}