{
  "name": "Marvin Miller",
  "url": "http://jewornotjew.com/profile.jsp?ID=707",
  "verdict": "Jew",
  "description": "Imagine you graduate from college with a degree in... oh, let's say advertising. Just for the heck of it. \n\nAnd let's say you're rewarded for your great grades by being forced to work for the worst advertising agency in the country, located 1400 miles away from anyone you know and love. \n\nNo matter how hard you work and sacrifice for the company, every year they renegotiate your contract to insure you're underpaid. And even if you grow to love the little town you work in, enjoy your co-workers, et al, the agency can ship you off to wherever they like without so much as a 'thank you' note. \n\nAnd if you decide that you're unhappy with any of this — no problem — they'll just fire you and blacklist you from the advertising industry forever.\n\nThis is the life that professional baseball players (all professional athletes, really) were forced into before Marvin Miller. And whether you think these athletes are overpaid, greedy jerks or not, you cannot argue that Miller changed the landscape of professional sports forever.\n\nYou would be forced to assume that a league that was altered so much by this one man would reward him by putting him in the Hall of Fame. But thus far both the executives he fought and the players he enriched have shut him out.\n\nThe last straw came in December 2007 when Miller's main adversary (being charitable here) all time dope Commissioner Bowie Kuhn was elected to the Hall while Miller was told to wait on the sidelines. Miller responded with anger, calling the Hall \"full of villains\" and it's election process \"a farce.\" Even going so far as to tell his next of kin to reject the honor if it were to be given posthumously (Miller is in his 90s. Time is running out).\n\nAnd y'know what? We don't blame him. We can only hope his enshrinement as a 14 here at JewOrNotJew.com helps salve his wounds. After all, Miller now joins such luminaries as Sandy Koufax, Marc Chagall and Jack Kirby — heck even Moses! — while outscoring modern ignoramuses (ignorami?) like Rod Carew and Alex Rodriguez.\n\nIt's the least we can do for this great, great man.",
  "pros": null,
  "cons": null,
  "score": 707,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/m/marvin_miller.jpg",
  "created_at": "2025-03-29T12:52:59+02:00",
  "updated_at": "2025-03-29T12:52:59+02:00"
}