{
  "name": "Mary Hart",
  "url": "http://jewornotjew.com/profile.jsp?ID=986",
  "verdict": "Jew",
  "description": "Back in the early 90s, when our goatees were long and luxurious, there was a classic episode of Seinfeld where Kramer (played by Michael Richards) was having seizures.\n\nIt turns out that these seizures were caused by the voice of one Mary Hart (Jew, she converted), co-host of Entertainment Tonight, a half hour program entirely dedicated to the news of the celebrity. It was a neat little crossover, the kind that Seinfeld did often, and is probably a Tier 2 (funny and memorable but not fully iconic) Seinfeldian episode. \n\nAt the time, Seinfeld was just one of many sitcoms literally littering the landscape, while Entertainment Tonight was somewhat unique — clinging to it's 7:30 timeslot like a struggling man hanging onto the side of the primetime mountain. Mary, 90's pretty with big hair, and co-host John Tesh (not a Jew, thank Hashem), somehow (somehow!) filled a whole half hour talking about new movies, possible spin-offs and David Hyde-Pierce's birthday. Happy Birthday David!\n\nOh, and giving Kramer seizures, apparently.\n\nWhich, nowadays, seems oddly metaphoric. The sitcom, the bread and butter of television, is now more like TV's meatloaf, something that we all used to eat, despise, and so no longer cook for our children. There are a few shows left (Big Bang Theory FTW!), but in defining the genre, Seinfeld sort of killed it. Nothing was ever that good, and since nothing could ever top it, why try?\n\nEntertainment Tonight, however, or ET as it's now known, has become part of a cottage industry. And while Michael Richards has been sent to his room to think about what he's done, Mary Hart is still hosting the show (Tesh, thankfully, has moved on to... something. We may not have gotten our wish that he fuck off and die, but clearly his career did). Which maybe makes some people think she's won, but we, the people certainly didn't.  \n\nThere she is, waiting for us all. Same time, same music, different hair thankfully, but the voice is still the same. Just try not to swallow your tongue while you convulse on the floor.",
  "pros": null,
  "cons": null,
  "score": 986,
  "category": "Art",
  "image_url": "http://jewornotjew.com/img/people/m/mary_hart.jpg",
  "created_at": "2025-03-29T12:53:06+02:00",
  "updated_at": "2025-03-29T12:53:06+02:00"
}