{
  "name": "Mata Hari",
  "url": "http://jewornotjew.com/profile.jsp?ID=863",
  "verdict": "Sadly, Not a Jew.",
  "description": "Silas Shoemaker arrived in Paris on a drab February morning. The City of Lights met him not with luminance, but with an ever-increasing rain that tricked its way into Silas' galoshes and was making inroads up his pant leg.\n\nThe accommodations were barely spartan. A solitary light bulb hung from the ceiling, delivering the promise of electricity with a humming flicker. A shabby wardrobe, a stool, and a nightstand completed the grim picture.\n\nBut the absurdly named \"Le Savoy Grand\" was of no concern for Silas. Neither was his new boss, the overstuffed H. M. Rutherford IV, who made it clear that if it was up to him, his new employee would be replaced by a petite ingenue.\n\nSilas was under strict orders to keep his true reasons for being in Paris clandestine. His official title was \"Secretary to the Cultural Attache\"; the most formidable part of the day job was enduring the giggling of the other secretaries as Silas was attempting to stuff yet another sugar cube into Rutherford's hourly gargantuan glass of tea.\n\nEvery evening, Silas would visit the post office to pick up his poste restante. His correspondent, after an initial flurry of instructions, reverted to silence.\n\nSilas was bored. His initial excitement of working in Paris was replaced by the monotony of his new existence. Even the promise of a Parisian spring seemed to fall on nature's deaf ears, as March turned into April without its usual aplomb.\n\nSilas took to wandering the streets at night. The cabaret lights drew him in with their pomposity; he did his best to stay away, stay away, until one evening his legs dragged him past the doorman and plopped him into a seat in the darkest corner of the room.\n\nSilas shooed away the waiter with a flicker of his wrist, and intended to pass the time by reading the evening's newspaper. He shot rapid glances at the stage, only to bring his eyes down time and again.\n\nThe clock was about to strike midnight, when Silas started to hear a murmur in the crowd. The cabaret, which was half empty when he came in, was humming with excitement. Several patrons were standing against the wall, cordoned off by a velvet rope, anxiously glancing at the stage.\n\nSilas looked up.\n\nHe wouldn't call her beautiful; her face, with its dark, almost Mongoloid, possibly Jewish, features, was an expressionless veneer. \nSilas couldn't look away.\n\nTo simply say that she danced would not do her justice, for the audience was swept away by her waves. When it was over, she rushed off the stage, the clientele bursting into a cacophony of applause. Silas attempted to add to the ovation, only to look at his hands.\n\nThey were soaked with sweat, black from the newspaper ink.\n\nThe next day was a blur; Silas spilled the tea on Rutherford's dickey, brushed off his ersatz boss' berating, and asked out of work early, citing a headache.\n\nThat night, Silas came to the cabaret early, stalking a seat at the foot of the stage. The dancer started to notice his presence by the end of the week. After a fortnight, Silas built up enough courage to mouth her a kiss; in his dreams that night, her mouth connected to his. The next evening, he threw a red rose onto the stage at the dance's conclusion; the day after, that rose was tucked into her hair.\n\nSilas was in heaven.\n\nAfter the dance, the doorman sought out Silas and pointed him to the door in the back. He stood by the locked boudoir for what seemed like hours, his trembling hands squeezing the felt out of his hat.\n\nThen the door opened and a majestic index finger demanded Silas' entry.\n\nHe did most of the talking during their nights together; all he knew about her is that her name was Margaret. It came as a complete surprise when she requested for them to meet at his place.\n\nHe tried to tell her that \"Le Savoy Grand\" was no place for a woman like her, he suggested renting a real hotel room, he pleaded and implored, but she would have none of it. And with one sway of her hips, he acquiesced.\n\nThe next morning, Silas telephoned the embassy, referenced an unmentionable illness, and got his reprieve for the day. He went to the market, purchased a colossal bouquet, got his hair pomaded at the barber, his shoes done at the shoe shiner, bought a bottle of the most exclusive champagne, did everything possible to conceal the awfulness of his room, and was anxiously waiting for his fashionably late mistress.\n\nWhen he woke up the next morning, her dress was lying on the floor, where they left it in a moment of passion. But she — she was gone, as was Silas' suit. Bewildered, he opened the wardrobe, only to find it empty. And it wasn't just the clothes. The wardrobe's carefully installed false bottom was dismantled, its contents now barren.\n\nSilas rushed to the window, nervously twisting the slippery handle to swing it open. He looked onto the street, hoping it was some kind of a mistake, thinking that she walked out to get coffee — she liked coffee in the morning, didn't she — wishing to catch a glimpse, hoping against hope to just see her silhouette...\n\nIt started to rain.",
  "pros": null,
  "cons": null,
  "score": 863,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/m/mata_hari.jpg",
  "created_at": "2025-03-29T12:53:03+02:00",
  "updated_at": "2025-03-29T12:53:03+02:00"
}