{
  "name": "Maurice de Hirsch",
  "url": "http://jewornotjew.com/profile.jsp?ID=1677",
  "verdict": "Jew",
  "description": "After a sleepless night spent on bumpy, windy roads, Leibowitz was dropped off in front of a large field. The coachman sped away, leaving Leibowitz to stare into acres of nothingness. He sighed and started walking.\n\nAfter what must have been at least five miles, his pants covered in layers of dirt and dust, Leibowitz finally saw a sign of life. A man on horseback was driving a heard of cattle. Leibowitz let out a loud yell, then collapsed to the ground.\n\nThe man turned around, stared into the distance, spurred his horse, and galloped towards Leibowitz. He jumped off and stood over the fallen man. Drops of sweat dripped off his chin and onto Leibowitz.\n\n\"Stein... is that you?\", Leibowitz whispered.\n\nThe man removed a flask from his belt and poured the contents into Leibowitz's throat. Leibowitz gulped it down feverishly.\n\nThe man standing over Leibowitz looked like a typical gaucho. A wide-brimmed hat covered his forehead, a hefty mustache adorned his face. His chaps covered his long boots. His eyes... his eyes were Stein's.\n\n\"What are you doing here?\", Stein asked.\n\n\"I've come for you!\", answered Leibowitz. \"I've come to take you back!\"\n\n\"Why?\"\n\n\"What do you mean, why? Look at... this! This horse, these cows, these boots, this hat! This is not you, Stein, this is not you!\"\n\n\"It is me, Leibowitz.\"\n\n\"This life...\"\n\n\"This life is my life now, Leibowitz.\"\n\n\"But... you are a learned man! You don't belong here!\"\n\n\"Where do I belong, Leibowitz? There? In the old world? They don't want us there, Leibowitz!\"\n\n\"It will change! You will see!\"\n\n\"Will it? I'm tired of waiting for it to change, Leibowitz. Thankfully, Baron de Hirsch was tired as well. He got us out, Leibowitz! Argentina? Why not Argentina? It beats the alternative!\"\n\n\"Bullshit!\"\n\n\"Actually, cow shit, Leibowitz,\" quipped Stein, pointing to the other man's shoes.\n\nLiebowitz took a look at his feet, and wretched.\n\n\"Come on,\" said Stein, effortlessly hopping on his horse. \"Get on behind me, we'll get you cleaned up. Mrs. Stein is getting Shabbat dinner ready...\"\n\n\"Shabbat?\"\n\n\"Just because we're half the world away, doesn't mean we have to forget old traditions...\"\n\n\"Mrs. Stein?\"\n\n\"Come, Leibowitz. I'll fill you in on the way.\"",
  "pros": null,
  "cons": null,
  "score": 1677,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/m/maurice_de_hirsch.jpg",
  "created_at": "2025-03-29T13:17:05+02:00",
  "updated_at": "2025-03-29T13:17:05+02:00"
}