{
  "name": "Max Greenfield",
  "url": "http://jewornotjew.com/profile.jsp?ID=1948",
  "verdict": "Jew",
  "description": "As a young Jewish man, you have many important decisions to make. Should I study accounting or dentistry? Should I go to the Jewish summer camp or the Jewish summer camp? \n\nBut no decision will affect your life more than your choice of bar mitzvah theme. Not to have the bar mitzvah, itself. That's happening. But after the bar mitzvah. After you've stood in front of hundreds of family members and your parents' work friends singing in a language you do not understand. After the rabbi has placed his (or her!) withered, no doubt unwashed, hands upon your head and blessed you. After Jeffrey Rosenblatt has cut one right in the middle of the silent prayer. After all that, you will have a party. And you must choose the theme of that party.\n\nThis is not a decision to be taken casually. Oh sure, you might be way into Teenage Mutant Ninja Turtles now, but when you're 35 and someone asks you \"what was the theme for your bar mitzvah?\"  will you still be comfortable crediting Donatello, et al?\n\nSo don't just be... willy nilly about it! Think, man! Not of today nor tomorrow, but in 20 years — what will I be able to proclaim proudly? And what will I have to whisper and hope no one hears?\n\nAny kind of sport is a safe choice. Baseball, football, basketball, heck, even Nascar — those are damned good ideas. Music, so long as you pull from the U2, Kanye set and not Miley Cyrus, One Direction, or *gasp* the Biebs. Max Greenfield, the man once described by Seth Green as too attractive to be truly Jewish, had a Saturday Night Live themed bar mitzvah. That's a great call.\n\nBut for the love of hashem, no matter how much you like it, how strongly it appeals, do not, do NOT have a Star Trek themed bar mitzvah party.\n\nNot that we'd know from personal experience or anything...",
  "pros": null,
  "cons": null,
  "score": 1948,
  "category": "Religion",
  "image_url": "http://jewornotjew.com/img/people/m/max_greenfield.jpg",
  "created_at": "2025-03-29T13:17:12+02:00",
  "updated_at": "2025-03-29T13:17:12+02:00"
}