{
  "name": "Maxwell Sackheim",
  "url": "http://jewornotjew.com/profile.jsp?ID=2348",
  "verdict": "Jew",
  "description": "Have you ever seen a website that advertises a deal that is too good to be true? Say, a pair of pants for just $20? Who doesn't want nice new pants?!\n\nSo you sign up on the website, and buy your pants, and they only cost you $20, and arrive quickly by mail, and you put them on — and, wow! They fit perfectly — cheap, wonderful, stylish pants.\n\nAnd then, a month later you get a bill. What's this, you ask. There must be a mistake! Why is this website charging you a $50 monthly subscription fee?! All you wanted were some pants!\n\nSo you go on the website, and dig for the contact info, and end up finding an email address that doesn't give a response, and place a call that puts you on indefinite hold, and then you finally, finally, reach a person, who says, sorry! Should have read the fine print. When you bought those wonderful pants, you also signed up for the site's monthly subscription. It's not a big deal, you can cancel... but not the current month, the deadline has passed. Maybe you want to use the $50 as store credit? No, you can't buy a pair of pants for that... that deal is only available to new members!\n\nBah!\n\nOf course, this predatory practice is not exactly new to the Internet. It was invented by Maxwell Sackheim in the 1920s, when he created the Book of the Month club. Originally, he charged customers a yearly fee to send them a book, well, every month. When people started to cancel, Sackheim changed his strategy: he would tell them in advance the book they are about to receive, and if they didn't physically send him a letter saying they cancel, they would get billed.\n\nSackheim sold off his business, but the model lived on through various similar ventures, most famous with Columbia House records. Now, it's revived on the Internet.\n\nAnd no, we didn't buy any pants. The above was definitely NOT autobiographical. Not at all, promise!",
  "pros": null,
  "cons": null,
  "score": 2348,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/m/maxwell_sackheim.jpg",
  "created_at": "2025-03-29T13:17:22+02:00",
  "updated_at": "2025-03-29T13:17:22+02:00"
}