{
  "name": "Mayim Bialik",
  "url": "http://jewornotjew.com/profile.jsp?ID=1008",
  "verdict": "Jew",
  "description": "When we started this whole Jew rating website thingie we had some idea that we might get some feedback. Suggestions for people to profile (check). Support from fans (check). Poorly spelled, barely comprehensible, curse-word littered, anti-semitic hate mail (sadly, check-a-roo).\n\nThe one thing we thought might happen though that hasn't is no one we've written about has complained to us about their profile. Yet. See, we know people Google themselves (especially them hot shot celebrity types) and we thought maybe someone might happen upon one of our more... thorough critiques. \n\nWe've had some family members of people we've profiled contact us. And one person we profiled wrote to complain about someone else. But no one-to-one-why-did-you-give-me-a-five-you-dirty-no-talent-SOBs kinda e-mails. Yet.\n\nAll of this is a nice digression, but what does it have to do with Mayim Bialik? Well, not to go all meta here but we're probably going to be meeting her in person soon. Or, depending on when you're reading this, we'll have already met her. Or maybe, just maybe, we're talking to her RIGHT NOW. Time travel gives quite the headache, non?\n\nSo how do we profile someone knowing there's a good chance they're gonna be reading what we write? How do we, say (hypothetically now) discuss their early foray into an early 90s girlie girl's coming of age TV show most famous for launching the career of (gah) Joey Lawrence? How do we, honestly, write about someone's perhaps, not so flattering appearance on \"What Not to Wear\"? On the flip side, how would we talk about this imaginary person's recent career resurgence on one of our favorite shows without coming off as mere sycophants? \n\nThe answer, of course, is that we can't. Not without putting ourselves, our site, our financial futures in danger. So, ummmm, Mayim Bialik. \n\nShe's nice.",
  "pros": null,
  "cons": null,
  "score": 1008,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/m/mayim_bialik.jpg",
  "created_at": "2025-03-29T12:53:07+02:00",
  "updated_at": "2025-03-29T12:53:07+02:00"
}