{
  "name": "Menachem Begin",
  "url": "http://jewornotjew.com/profile.jsp?ID=1978",
  "verdict": "Jew",
  "description": "You are six years old. You are living in a small Eastern European capital in what was then the Soviet Union. It's your first day of school.\n\nThere it is, your new home away from home! The place where you will spend so many of your formative years! A drab, gray brick building. It's the Soviet Union. What else do you expect?\n\nAcross the street, there is another building. It's... different. There is no drab facade. In fact, you can't really make it out: it's hidden behind a wall. A tall, tall wall topped with barbed wire. A watch tower with a gun-holding soldier rises above it. And then it hits you: you are going to school across from a prison.\n\nThis is not just a prison. It's living history. It survived three empires. Its roster of inmates lists some renowned names. (Menachem Begin?) Some might even call it a historical monument. But you don't care. You are six years old.\n\nSo, for the next few years, smack in the middle of this Eastern European capital, mere blocks away from the statue of Lenin that points its stretched arm toward the KGB building, you go to school. You sit in class, and try to learn, and peek outside, and see the prisoners sweep the streets, as the gunned watchman looks down. This is your life.\n\nYears pass. The school and the prison are but a distant memory. Your son is now six years old, going to his own school, thankfully not across from a prison. But one day, you return, and it all starts to come back. And you look at the school, and you look at the prison, and you think of your life, where it was, has been, and going.\n\nIt's all gonna be fine.\n\nWritten on the train back, November 7, 2014, 6 AM.",
  "pros": null,
  "cons": null,
  "score": 1978,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/m/menachem_begin.jpg",
  "created_at": "2025-03-29T13:17:13+02:00",
  "updated_at": "2025-03-29T13:17:13+02:00"
}