{
  "name": "Michael Douglas",
  "url": "http://jewornotjew.com/profile.jsp?ID=657",
  "verdict": "Jew",
  "description": "We're big fans of Bill Simmons here at JONJ. For those who don't follow sports or are over the age of 50, Simmons, aka the Sports Guy (Not a Jew), is the highly popular columnist, podcaster, and Teen Wolf connoisseur over on ESPN.com.\n\nOne of Simmons' running jokes is the \"Reggie Cleveland All-Stars\", athletes whose names sound black but who are really white, such as the eponymous baseball player Reggie Cleveland. So imagine our joy when on a recent podcast Simmons introduced his newest group of All-Stars, the \"Michael Douglas All-Stars\": people whose name doesn't sound Jewish, but who are.\n\nAnd y'know what? That's not a bad choice. Douglas is Jewish through his father's side (the previously profiled Kirk Douglas). Most importantly however, he self-identifies as a Jew, so it's all good (we would have gone with Yaphet Kotto All Stars ourselves, but hey, it's his Internet, we're just writing on it). In any case, it's a neat idea and lots of fun to hear someone other than ourselves obsess about Jews for once. So, yeah, hooray for Bill Simmons! He's the greatest! Except...\n\nSimmons then continues: \"why aren't there any websites that talk about who's Jewish and who isn't?\"\n\nUmmm... hello? Over here? \n\nSheesh. Come on, Simmons. We've forgiven you for writing only one column every six months. The least you could do is check Google every once in a while.\n\n(Editor's update: Perhaps this should say we USED to be big fans of Simmons. He has since turned into a stooge, and we wasted the profile of one of the greatest Jewish actors ever to discuss a goy's foray into Jew identification. Come to think of it, we're now wasting this editor's update as well. Let's cut it short: Bill Simmons now sucks, Not a Jew. Michael Douglas, still awesome, still Jew!)",
  "pros": null,
  "cons": null,
  "score": 657,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/m/michael_douglas.jpg",
  "created_at": "2025-03-29T12:52:58+02:00",
  "updated_at": "2025-03-29T12:52:58+02:00"
}