{
  "name": "Michael Jackson",
  "url": "http://jewornotjew.com/profile.jsp?ID=580",
  "verdict": "Not a Jew",
  "description": "One of the dirty secrets of JONJ (besides the poker shack in the swamp) is our death pool: a number of not-yet-profiled possibly-Jewish celebrities that might expire relatively soon. These might deserve a profile in order to increase site traffic and ummmm, respect the dead. But mostly the first thing.\n\nAnyway, someone like Martin Landau or Jerry Lewis makes a good candidate for the death pool. But not Michael Jackson, of course.\n\nNot because of his age (our death pool does include Corey Haim, after all), but because no one in their right mind would ever think that Jackson was Jewish.\n\nBut Jackson's first two children, Prince Michael I and Paris Michael Katherine (very creative naming, Mr. Jackson) are, in fact, Jewish, at least Halachically. Their mother is Jackson's former nurse, Debbie Rowe, who is Jewish. Jackson was mum on the identity of the mother of the third, Prince Michael II (seriously. What creativity!), but that gives us at least two of three.\n\nNow, they weren't raised Jewish, and frankly we're not going to speculate on what their childhood may have been like. But, y'know what? We'll take it. At least until the inevitable scandal shows up.\n\nAnd oh, there's more. Did you know that recently Jackson befriended a rabbi, started to attend a synagogue, and was a regular at Shabbat dinners?\n\nNow, does that make Jackson a Jew? No. His infatuation with Judaism was temporary; he never intended to convert. According to the rabbi, \"he needed some sort of spiritual base\". That said, the thought of Jacko in a temple, wearing a yarmulke, holding a siddur, is a tad... unsettling. But there it is.\n\nStill, if only we had known sooner we could have queued this up in the pool and been so timely and... respectful.",
  "pros": null,
  "cons": null,
  "score": 580,
  "category": "Religion",
  "image_url": "http://jewornotjew.com/img/people/m/michael_jackson.jpg",
  "created_at": "2025-03-29T12:52:56+02:00",
  "updated_at": "2025-03-29T12:52:56+02:00"
}