{
  "name": "Michael Phelps",
  "url": "http://jewornotjew.com/profile.jsp?ID=337",
  "verdict": "Sadly, Not a Jew.",
  "description": "We are often asked, how do we select who to profile for this website. Our answer was, we let a trained monkey pick names out of a hat.\n\nOh, if it was only so simple! Ever since the monkey left us for the great beyond, we are stuck with making the decisions by ourselves. The handy suggestion box helps, of course.\n\nPicking the Jews is simple enough. Our landsmen has achieved great success in almost every field imaginable. Selecting one to profile is like shooting fish in a barrel.\n\nPicking non-Jews is trickier. There are just too many of them out there (don't get us started). Ideally, we like to pick subjects who someone out there might think are Jewish. Chuck Norris is a perfect example. No, he is not Jewish, but there are internet rumors that he is. So we write a few jokes, and squash those rumors with a low Jew Score and a \"Not a Jew\" verdict. Perfect.\n\nBut there are no such rumors about Michael Phelps. In fact, other than a couple of his relay teammates, there is not much that ties him to Jews in any way. However, that hasn't stopped his name from being one of the highest-searched ones on our website, with multiple readers asking us to profile him.\n\nAnd we understand those readers. We ourselves would love it if the greatest Olympic champion of all time was Jewish. Hell, we often thought of starting that rumor in this very space... but then the whole integrity thing comes in.\n\nSo Phelps is not Jewish. And neither is the other most-requested person out there: George Bush, and we have no idea why anyone would think otherwise. So he is not getting his own profile, no matter how many times we are asked. We even removed his name from the hat in case we ever get a new monkey.",
  "pros": null,
  "cons": null,
  "score": 337,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/m/michael_phelps.jpg",
  "created_at": "2025-03-29T12:52:50+02:00",
  "updated_at": "2025-03-29T12:52:50+02:00"
}