{
  "name": "Michael Eisner",
  "url": "http://jewornotjew.com/profile.jsp?ID=2697",
  "verdict": "Jew",
  "description": "Michael Eisner saved Disney!\n\nIt's easy to forget with today's behemoth mega-mouse owning every IP imaginable, but back in the 70s and 80s, Disney was dying. Especially their animation division, the thing that most people associated with the company. Remember The Black Cauldron, The Great Mouse Detective, and Oliver \u0026 Company? The Disney people really wish you didn't.\n\nEnter Michael Eisner, the former Senior Vice President of Paramount. Remember The Little Mermaid, Beauty and the Beast, Aladdin, and Lion King? Hell yeah you do! Those were amazing movies, all released under Eisner's aegis as CEO. Eisner was also responsible for the acquisition of ABC (and all the little goodies that came with it, including ESPN). \n\nWhen Eisner joined Disney, the company stock averaged about a dollar a share. After a little more than a decade, it was worth FORTY TIMES THAT. \n\nOn the other hand... Eisner was notoriously cheap. He oversaw the construction of Disney's California Adventure (a disaster), Disneyland Paris, nee EuroDisney (financially successful but a cultural bomb), and Hollywood Studios, a park Disney still doesn't know what to do with exactly.\n\nEventually Eisner butted heads with members of the Disney family itself and found himself summarily fired. The company has spent the past decade and a half trying to undo much of what Eisner originally oversaw.   \n\nMichael Eisner ruined Disney?!",
  "pros": null,
  "cons": [
    "Eventually Eisner butted heads with members of the Disney family itself and found himself summarily fired. The company has spent the past decade and a half trying to undo much of what Eisner originally oversaw.",
    "Michael Eisner ruined Disney?!"
  ],
  "score": 2697,
  "category": "Business",
  "image_url": "http://jewornotjew.com/img/people/m/michael_eisner.jpg",
  "created_at": "2025-03-29T13:17:31+02:00",
  "updated_at": "2025-03-29T13:17:31+02:00"
}