{
  "name": "Michele Bachmann",
  "url": "http://jewornotjew.com/profile.jsp?ID=1158",
  "verdict": "Not a Jew",
  "description": "What is the craziest way someone considers themselves Jewish? For years, we thought it was cross-dressing figure skater Johnny Weir, who thinks of himself as a Jewish girl reincarnated. Pretty nutty, right? An undisputed champion of make-believe Jewishness, right?\n\nPerhaps you were, Johnny. Perhaps you were... That is, until Michele Bachmann came along. Of course, it's so strange to mention you both in the same paragraph, since according to her, homosexuality is a sin, and...\n\nWhere were we? Oh, sorry, we got startled looking into those cold dead eyes. Yes, Michele Bachmann. Chiseled Minnesota congresswoman. Wannabe President. Wannabe Jew. But let's hear her side of things:\n\n\"I consider my heritage Jewish, because it is the foundation, the roots of my faith as a Christian.\"\n\nWait, wait, wait, wait, wait, wait, wait. WAIT! What?\n\nLet us get this straight, Michele. You are Jewish (OK, fine, your heritage is Jewish) because Judaism is the foundation of Christianity. OK. Fine. But this means, according your definition that every Christian, from the pope to Mel Gibson, is Jewish as well! Might as well scrap our website, right?\n\nAnd, sadly, there are some out there who can't see through the absurdity. There are many Republican Jews who are supporting Bachmann, who are giving her money, because they think she is Jewish.\n\nSigh.\n\nOh, how we long for the days of Johnny Weir...",
  "pros": null,
  "cons": [
    "Wait, wait, wait, wait, wait, wait, wait. WAIT! What?",
    "Let us get this straight, Michele. You are Jewish (OK, fine, your heritage is Jewish) because Judaism is the foundation of Christianity. OK. Fine. But this means, according your definition that every Christian, from the pope to Mel Gibson, is Jewish as well! Might as well scrap our website, right?",
    "Oh, how we long for the days of Johnny Weir..."
  ],
  "score": 1158,
  "category": "Politics",
  "image_url": "http://jewornotjew.com/img/people/m/michele_bachmann.jpg",
  "created_at": "2025-03-29T13:16:52+02:00",
  "updated_at": "2025-03-29T13:16:52+02:00"
}