{
  "name": "Mickey Cohen",
  "url": "http://jewornotjew.com/profile.jsp?ID=1154",
  "verdict": "Jew",
  "description": "Who is the best mob boss of all time?\n\nSeems like a strange question to ask —  like asking who was the most successful serial killer or who was the best ever Cincinnati Bengal — but hey, it's a Friday, we're at work, what else is there to do, really?\n\nFirst, a few criteria. One, they can't be from the modern era. The romance is only there if they're from the golden age of the mob. So no Gottis or whatever. Two, they have to be actual mob bosses. No well-regarded lackeys or whatever. Oh, and they have to be real. Fictional mob bosses are out.\n\nWith all those rules established, we're essentially left with three candidates: Arnold Rothstein, who ruled New York, Al Capone, who ran Chicago, and Mickey Cohen, king of California.\n\nRothstein was nice and all (he fixed the World Series and everything!), but he was killed by a rival for not paying a gambling debt, which is pretty much game over as far as we're concerned.\n\nCapone seems like a frontrunner, but then think about how he went down: tax evasion. That's just silly. So no.\n\nThat leaves Mickey C. and, well, here we're looking pretty darn good. First, they may have caught Mickey a few times, but unlike Capone he got out lickety split and got right back in charge of things. And because he was LA's big man, he's a player in just about every film noir/pulp detective story that's worth a damn. And how did Cohen die? In his sleep, at home, at age 62.\n\nOh, and he was Jewish, of course. So that always helps.\n\nYup, Mickey Cohen, the mob boss of all other mob bosses. At least until someone threatens to make us sleep with the herrings till we say otherwise.",
  "pros": null,
  "cons": null,
  "score": 1154,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/m/mickey_cohen.jpg",
  "created_at": "2025-03-29T13:16:52+02:00",
  "updated_at": "2025-03-29T13:16:52+02:00"
}