{
  "name": "Mike Greenberg",
  "url": "http://jewornotjew.com/profile.jsp?ID=943",
  "verdict": "Jew",
  "description": "And on the 234th day, G-d created Sports Radio. And it was... OK, it was terrible. Even Hashem could admit that. 24 hours of unathletic know-it-alls and former athlete know-nothings yammering back and forth at high, nasal pitch about whether or not the Mets should trade their best player for a bag of rotten walnuts or whatever (which the Mets actually did at one point).\n\nBut then, miracle of miracles, Mike and the Mad Dog (Mike Francesa and Chris Russo, Not Jews) appeared. OK, so it was still two unathletic know-it-alls (and one hall-of-fame level nasal voice). But it worked. For the first time, you didn't  want to reach into your car radio, grab them by the throat and shake them until your hands went numb. And that was all we really wanted: a couple of guys shooting the BS and talking sports while we sat in three hours of traffic because some doofus didn't realize you're supposed to avoid the jersey divider. \n\nBut, of course — as they always do — egos got in the way. Dog split for satellite radio and was never heard from again. Mike does his show solo with quite possibly the dumbest theme song ever written for anything. And thus were we back to the world of annoying, depressing, intelligence-destroying sports talk.\n\nBut not for long. \n\nOK, so Mike and Mike (on ESPN radio) aren't perfect: they're on in the mornings for one thing. It's shorter than we'd like. And more than a little commercial heavy. But who cares, really, when it's so entertaining to listen to? Even better, it's got a Jew: Mike Greenberg (yes, the nerdy one. Shocker).\n\nYou may not see the point in all this but trust us, when we're sitting in traffic because some peabrain decided that he was too important to go the speed limit and slammed into the car in front of him, there's nothing that makes us happier.\n\nIt's a heck of a lot better than listening to real news.",
  "pros": null,
  "cons": null,
  "score": 943,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/m/mike_greenberg.jpg",
  "created_at": "2025-03-29T12:53:05+02:00",
  "updated_at": "2025-03-29T12:53:05+02:00"
}