{
  "name": "Mikhail Perlman",
  "url": "http://jewornotjew.com/profile.jsp?ID=3151",
  "verdict": "Jew",
  "description": "The Soviet Union first entered the Olympics in 1952. They waited for so long because of one major reason: they were afraid they would not win.\n\nYou see, there was absolutely no way that Soviet heroes could be bested by capitalist pigs; and yet, these capitalist pigs held superiority in so many sports! So, in order to claim Olympic victory, the Soviets came up with a new way to score the Olympics.\n\nNo, not by gold medals. That is too simplistic. No, not by total medal count. That is too obvious. The Soviets decided to award seven points for first place, six for second, and all the way down to one for 7th. The idea was that the sheer number of Soviet athletes would dwarf western nations in this fantastic scoring system with their non-medal placements.\n\nLet's look at gymnast Mikhail Perlman as an example, a rare Jewish athlete on the Soviet team. Perlman participated in the team competition, which the Soviets won, so that's seven points. He also got fourth in the pommel horse, which usually is the worst possible finish: there is no medal! And yet, the Soviet system earned him four vital points.\n\nThe US trounced the Soviets, 40 gold medals to 22, and beat them in the overall count, 76 to 71. But when all the points were added up, the Soviets were declared winners! Well, there was one caveat: they actually tied the Americans at 494. That didn't stop the Soviet sports machine from claiming victory!\n\nThere was a second caveat, too: the Soviets miscounted on purpose. Yes, if their scoring system was correctly used, they would have still finished second to the Americans...\n\nOf course, in the years since, the Soviet-cum-Russian sports machine has been a shining example of athletic glory and fair competition.\n\nOr, you know, not.",
  "pros": null,
  "cons": null,
  "score": 3151,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/m/mikhail_perlman.jpg",
  "created_at": "2025-03-29T13:17:43+02:00",
  "updated_at": "2025-03-29T13:17:43+02:00"
}