{
  "name": "Milton Hershey",
  "url": "http://jewornotjew.com/profile.jsp?ID=1488",
  "verdict": "Not a Jew",
  "description": "Hey there, goyim! Nice of you to stop by and put the NJ in JONJ. Anyway, we've noticed that some of you seem to struggle with discerning the difference between super-serious Jews (like the Hasidim) and the Amish. Well, sure, we can see that. After all, both are kinda strange sorts with crazy outfits, funky facial hair, and the annoying tendency to throw rocks at you for laughing at them. So here's a handy dandy chart to help.  \n\n\nHasidAmish\nBeard QualityAwesomeLegendary\nReligious FervorRidiculousRidiculous +1\nBase of OperationsBrooklyn, parts of North Jersey, Eastern PA, and Sitka, AK in an alternate universe created by Michael Chabon.Central PA, some parts of Western New York and Ohio, and just north of the Everglades for reasons that have yet to be fully explained.\nDQ (Dick Quotient)Say you're going to suffer in eternity unless you're one of them, but you're more than welcome to join.Say you're going to suffer in eternity unless you're one of them, and no, you are most certainly not welcome to join.\nMovieIn A Stranger Among Us, Melanie Griffith pretends to be a Hasidic Jew. Enough said. Or there is Yentl... Yikes.We're down to Witness, in which the Amish are shown as closeted, close-minded jerks and treated with respect, or Kingpin, in which the Amish are shown as closeted, close-minded buffoons and treated with contempt. So it's kinda lose-lose.\nDessertRugelach is pretty bad. Macaroons are worse. And the chocolate tastes like crumbly, brown sadness.Best. Pies. Ever. And while Milton Hershey wasn't Amish, he was raised in Amish country, so they can claim the premier American chocolate, too. Oh, and their pretzels might be better than any of these things.\n\n\nSo there ya go, goyim. Hope this helps the next time you need to yell an inappropriate epithet and don't know whose name to take in vain.",
  "pros": null,
  "cons": null,
  "score": 1488,
  "category": "Religion",
  "image_url": "http://jewornotjew.com/img/people/m/milton_hershey.jpg",
  "created_at": "2025-03-29T13:17:00+02:00",
  "updated_at": "2025-03-29T13:17:00+02:00"
}