{
  "name": "Mitch Albom",
  "url": "http://jewornotjew.com/profile.jsp?ID=926",
  "verdict": "Jew",
  "description": "Y'know, in the end, we didn't create this website to label who is Jewish and who isn't. We didn't start this because we wanted to get thousands of complimentary e-mails, or a couple of disturbing hateful ones, or to be featured in a Jewish-themed post on a pseudo-pornography site (although all those things have happened). \n\nWe did it because, regardless of our day jobs, in our hearts we're writers. We were born with this innate need to express ourselves in the printed word. In the way that other people have an innate need to breathe or eat or read Jewish-themed posts on pseudo-pornography websites. \n\nThe truth is, if you don't absolutely need to write it's not something you do anyway. It's nothing that you can describe as glamorous or fun (mostly, the word painful comes to mind). Nor is it particularly lucrative.\n\nAnd, when writing somehow does become lucrative (for about 1% of 1% of those of us who try to do this on a regular basis) people are immediately out there decrying you as a sellout (notably, the people who scream the loudest happen to also be the ones who would sell out the fastest if someone were stupid enough to offer them half the opportunity).\n\nSo, Mitch Albom was a solid sportswriter for the Detroit Free Press who occasionally appeared on ESPN (usually The Sports Reporters) because he had an odd shaped head and people liked to stare at it on Sunday mornings for whatever reason. Then he wrote a solid little book, Tuesdays With Morrie, which sold like it was made of hot fudge brownie and provided Albom with a new career as a kinda sorta Christian philosopher type. It also made him a shit-ton of money (shit-ton being the most correct mathematical term, of course). \n\nSo off Albom goes with his \"good ol' days\" sports reporting and his skinny brown books telling us how to live and sometimes you even think he might believe some of this crap, which, let's be fair, is almost scarier than if he doesn't.\n\nThis is the point where we get up on our high, circumcised horse (hi ho Zev!) and point out what a mid-level, money-grubbing hack Mitch Albom is and how he should just shut up and return to the Planet of The 4'3\" Sportswriters. But we're not going to. Albom writes for the same reason we all do — we are physically and emotionally incapable of stopping. And, bless his grubby little heart, he actually found a way to get paid for it.\n\nLike you, or us, or anyone would say no to that.",
  "pros": null,
  "cons": null,
  "score": 926,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/m/mitch_albom.jpg",
  "created_at": "2025-03-29T12:53:05+02:00",
  "updated_at": "2025-03-29T12:53:05+02:00"
}