{
  "name": "Montblanc International",
  "url": "http://jewornotjew.com/profile.jsp?ID=905",
  "verdict": "Not a Jew",
  "description": "It is the morning after your bar mitzvah. You wake up early — a little hungover on flat orange soda and wilted kreplach — and pad down to the living room in your pajamas to examine \"your haul\": the pile of gifts you have received from family, friends, loved ones, and people your parents know from work.\n\nYou want to start small. You reach for a wrapped rectangle, slightly larger than your hand, with a surprising amount of heft. Your mind races with possibilities. Too thin for a video game. Too heavy for an iPod. The anticipation can be held back no longer. You rip the paper back and reveal....\n\nA pen.\n\n\"Ooo, a Montblanc,\" your Tanta Gezunta (who is only staying at the house because, oy, the prices of hotels these days you'd have to be a ganef to afford them) exclaims.\n\n\"You got the fat one!\", your Uncle Nudnik declares, \"That's a nice pen. You'll sign your ketubah with that pen someday.\"\n\n\"You know,\" Tanta Gezunta rolls towards you conspiratorially, \"Montblanc is made by Jews.\" She grabs the pen from you and turns it so you're looking at the top. It looks like a bird defecated on it.\n\n\"See the star? See the star of David?\", she points. You squint. Without the rounded edges, you suppose. But with one hand around your neck and the other driving this physical embodiment of disappointment toward your eye you're hardly in any position to disagree.\n\n\"That's a myth!\", your Uncle Nudnik yells, \"there all a bunch of Germans with maybe one guy who might've been Jewish. It's just a coincidence, you old hag!\"\n\n\"Oh look who suddenly knows everything,\" Tanta Gezunta drops the pen and rounds on her doting spouse. You turn back to your less promising pile of presents. You need a gift that will turn this day around and fast. You reach for the largest, heaviest, thing you can find. From behind the torn paper, five words stare back at you: \"The Jewish Book of Why.\"\n\nAnd that's when you realize — all those years of Hebrew school were a complete fucking waste of time.",
  "pros": null,
  "cons": null,
  "score": 905,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/m/montblanc_international.jpg",
  "created_at": "2025-03-29T12:53:04+02:00",
  "updated_at": "2025-03-29T12:53:04+02:00"
}