{
  "name": "Mordecai \"Three Finger\" Brown",
  "url": "http://jewornotjew.com/profile.jsp?ID=909",
  "verdict": "Not a Jew",
  "description": "While all of us get uber-excited for 100mph fastballs, if the pitch is straight as string, all that velocity just makes the ball leave the park faster. No, it's movement that gets the guys out, wins the big game, earns you the big money, and beds the supermodels (ahhh, precious, precious supermodels.... wait, what were we talking about? Oh yeah, baseball). \n\nAnyway, because of this, people are always looking for ways to add a little bounce to their ball. Some do it illegally: spitballs, vaseline balls, sandpaper balls, fondling balls... there are infinite, non-approved substances that allow for some seriously wacky wobbling.\n\nOther people are simply genetically blessed. Pedro Martinez's freaky long fingers mean he couldn't throw the ball straight if he wanted to. Antonio Alfonseca has an extra digit (yup, six fingered man. Don't tell Inigo Montoya.) which also affects his ball movement. But good luck creating such things artificially.\n\nSo how DO you get yourself some million-dollar-movement in a way that is both legal and attainable? How about... cutting off some of your freakin' hand? Hey, it worked for Mordecai Brown (and, more recently, Bob Wickman). \n\nBrown was a farm boy when he accidentally STUCK HIS HAND IN A THRESHER (and thus, not a Jew. No Jew will have that sentence written about them ever. Lost a finger to a dental drill, perhaps...). On the negative side, it took off his whole index finger and crippled the rest of his hand. But he did have one heck of a curveball, so all good right?\n\nYeah, call us out for lack of dedication if you want. But, frankly, we'd rather just forget the baseball career and keep the hand. Weirdos that we are.",
  "pros": null,
  "cons": null,
  "score": 909,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/m/mordecai_three_finger_brown.jpg",
  "created_at": "2025-03-29T12:53:04+02:00",
  "updated_at": "2025-03-29T12:53:04+02:00"
}