{
  "name": "Morris Michtom",
  "url": "http://jewornotjew.com/profile.jsp?ID=1183",
  "verdict": "Jew",
  "description": "If you live in a major city then you take the subway (Yes, this implies that LA is not a major city. We're comfortable with that). And so you've had that moment, sometimes more than a moment, when you're sitting underground between stations for no frickin' reason sweating your genitalia off and realizing that the meeting you were 10 minutes early for? Yeah, now you're 20 minutes late.\n\nAnd why? Bears. \n\nBears in the tunnels. Hundreds of them. And every time one of them wanders in front of a train the conductor has to go out there and push ol' Cujo back into the deeper recesses before the cars can move forward.\n\nHow did they get there? No one knows. But we know who to blame: Morris Michtom. Y'see, back in the 1900s, American bears were in very real danger of going extinct. But then Michtom invented the Teddy Bear (named for Teddy Roosevelt, SO not a Jew) and bears went from loud, aggressive, jerkwads to cute and cuddly friends in the national consciousness.\n\nAnd thus, we have bears everywhere now. Eating from dumpsters, getting treed by domestic cats, and yes, keeping us from having a quick, comfortable commute.\n\nAt the very least they could give back to the community and let those of us who live in the country bolt cell phone towers to their backs so we could have decent coverage for once, right?",
  "pros": null,
  "cons": [
    "And thus, we have bears everywhere now. Eating from dumpsters, getting treed by domestic cats, and yes, keeping us from having a quick, comfortable commute.",
    "At the very least they could give back to the community and let those of us who live in the country bolt cell phone towers to their backs so we could have decent coverage for once, right?"
  ],
  "score": 1183,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/m/morris_michtom.jpg",
  "created_at": "2025-03-29T13:16:52+02:00",
  "updated_at": "2025-03-29T13:16:52+02:00"
}