{
  "name": "Mort Goldman",
  "url": "http://jewornotjew.com/profile.jsp?ID=640",
  "verdict": "Sadly, a Jew.",
  "description": "Let's talk about stereotypes.\n\nAt its best, a stereotype is a kind of cultural shorthand, an observed and accepted commonality. It's never \"good\" in the politically correct parlance of our time, but it's something we can appreciate — perhaps a little ruefully, no doubt — and begrudgingly accept.\n\nBut at its worst — and we've all seen it at its worst — a stereotype becomes a bigoted whitewash. Not a mirror but a caricature with all the negatives called out and exaggerated for the purposes of belittling the person being described. It stops being funny or knowing and instead becomes obscene. Insulting. \n\nAs a culture, we are unable to really pick our stereotype — that's for others to decide — but we have our preferences: Jews are smart, good with money, nerdy, obsessed with food, humorous. We understand and we can live with that.\n\nBut then there's this crap: Jews are weak, greedy, terrified of women, ugly, clowns. In other words, the shlemiel pictured here, Mort Goldman. \n\nWhen it's familiar and friendly, we're happy to laugh along with the crowd, \"ha ha, you got us.\" But there's a certain point we're pushed to stop and say, \"hey, that's not funny.\"\n\nAnd Mort Goldman is not funny. Not on occasion, not ever.  He's not a playful tweaking of our oversized noses, but a punch to the face with with the implied question \"why aren't you laughing?\" as the blood runs down our chins.\n\nLook, it's Family Guy. Everybody takes it in the crotch and the more offensive it is the more likely you'll see it on next week's episode. Getting mad at them is like getting mad at Howard Stern — they're looking for a rise out of you. So we watch. We smile. And when Mort Goldman comes on, well, we pay a little less attention. We just hope everyone else does, too\n\nJust remember, he's a Jewish character. A Jewish stereotype. But only in a fictional sense.",
  "pros": null,
  "cons": null,
  "score": 640,
  "category": "Politics",
  "image_url": "http://jewornotjew.com/img/people/m/mort_goldman.jpg",
  "created_at": "2025-03-29T12:52:58+02:00",
  "updated_at": "2025-03-29T12:52:58+02:00"
}