{
  "name": "Mose Solomon",
  "url": "http://jewornotjew.com/profile.jsp?ID=1116",
  "verdict": "Jew",
  "description": "As part of JONJ's continued dedication to our long history and the Jewish community, we occasionally reprint profiles from our historical archives. Today we present Mose Solomon, written by Fievel Frankel and published in the \"New York Jewish Daily\" on October 1, 1923.\n\n\n\n\nThe twelve thousand spectators who packed the Polo Grounds were not embittered by today's result, as John McGraw's Giants earned their now customary place as champions of the Senior Circuit. The two-time defending World Series victors will once again challenge their cross-town rival, the New York Yankees, for the crown.\n\nToday's contest saw the visiting Boston Braves take the lead into the eighth inning, with McGraw's men equalizing through the heroics of Travis \"Stonewall\" Jackson. In the extra frame, a new hometown hero emerged, spearheading the Giants towards the pennant.\n\nMose Solomon, originally of the Lower East Side and aged a mere 23 years, scooped by McGraw out of the remote wilderness of Hutchinson, Kansas, became that hero. Solomon, dubbed by some the \"$100,000 Jew\" due to the prodigious price paid by the Giants, entered the game in right field early in the contest. Three hitless at-bats had many wondering if McGraw overspent for the Hebrew, but their fears soon subsided.\n\n\n\n\nBoston hurler Joe Oeschger, two years removed from winning 20 games but now reduced to relief assignments, gave up a double to \"The Fordham Flash\", Frankie Firsch. Solomon, drops of sweat drooping off his brow, was up next. Oeschger delivered; Solomon, with a ferocious swing that made him famous throughout the minor circuits, made contact. The crowd, hushed with anticipation, leaned out of their seats, watching the white speckle of the ball drop, then burst with jubilation. Solomon bagged a double, Firsch scored, and the fever of victory swept the Grounds. Giants four, Braves three. Champions once more.\n\nThe Bronx Bombers and their paunchy \"Sultan of Swat\", George Herman \"Babe\" Ruth, now await, doubtlessly eager to transpose the results of the last two World Series. A tantalizing competition will surely ensue, and one can be certain that the Giants' new \"Rabbi of Swat\" will have his say in determining its outcome.\n\n\n\nSolomon would go on to appear for the Giants in the meaningless regular season finale, get two hits, and never play in the majors again.",
  "pros": null,
  "cons": null,
  "score": 1116,
  "category": "Religion",
  "image_url": "http://jewornotjew.com/img/people/m/mose_solomon.jpg",
  "created_at": "2025-03-29T13:16:51+02:00",
  "updated_at": "2025-03-29T13:16:51+02:00"
}