{
  "name": "Mountain Jews",
  "url": "http://jewornotjew.com/profile.jsp?ID=1434",
  "verdict": "Jew",
  "description": "On a blistering summer morning, two men were walking up a winding mountain path. The leader, a tall gentleman in high laced-up boots, steadily made his way up the incline. He was followed by a stout man, who was clearly having difficulty. His heavy breathing was interrupted by constant swigs from the flask that was tied to his belt.\n\n\"You better ration that water, Stein,\" said the tall man, dropping a quick glace at his comrade.\n\n\"It is just too hot!\"\n\nThe tall man looked up in the sky, where the sun was nowhere near its zenith.\n\n\"It'll only get hotter.\"\n\n\"How much longer, Leibowitz?\", asked the stout man. There was no response.\n\nA few hours passed. Stein, his water supply down to the last drops, was barely dragging his feet through the rocks. Leibowitz determinedly continued to look forward, until a faint noise stopped him in his tracks. The tall man jumped behind a large stone on the side of the path. Stein, unsure what happened, stood startled, until Leibowitz's arm dragged him behind cover.\n\nThe two watched as a man on a horse raced down the path. Somehow, the animal was adept to the twists and turns of the mountain, swiftly kicking up piles of dust. The man, wearing a tall black hat and a gangly beard, looked straight ahead. A long knife was peeking from behind his belt. Leibowitz had to put his hand over Stein's mouth to prevent a sneeze.\n\n\"That's a Mountain Jew,\" said Leibowitz, as the last clicks of the horse's hoofs disappeared in the distance.\n\n\"That's... a what?\"\n\n\"A Mountain Jew, Stein. Also known as Juhuro. They've made their home in the Caucasus for fifteen centuries.\"\n\n\"I don't believe it. A Jew... here!\"\n\n\"Oh yes, Stein. A Jew, here. Thousands of them, actually, living in the mountains. They grow grain and rice, make wine... Sure, they don't look like you and me, but they keep up all Jewish customs.\"\n\n\"Even circumcision?\"\n\n\"That's right, Stein, even circumcision. Why do you always ask about that one?\"\n\nLeibowitz peeked his head over the stone.\n\n\"Alright, Stein, the coast is clear. Let's go. We have to make it by nightfall.\"\n\nStein sighed, looking up at the sky. In the distance, he could see three vultures circling.",
  "pros": null,
  "cons": null,
  "score": 1434,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/m/mountain_jews.jpg",
  "created_at": "2025-03-29T13:16:59+02:00",
  "updated_at": "2025-03-29T13:16:59+02:00"
}