{
  "name": "Mr. Hooper",
  "url": "http://jewornotjew.com/profile.jsp?ID=1027",
  "verdict": "Jew",
  "description": "Recently, the original seasons of Sesame Street were released on DVD for the viewing pleasure of Gen X-ers like ourselves who remember the good old days of children's TV before Elmo showed up and smeared his furry red poop all over everything.\n\nThose of us who checked out the DVD were in for a surprise though: in big block lettering on the back of the DVD box, \"Not suitable for children\".\n\nWait. What? That's is as dumb as saying Q-tips shouldn't be used in your ears. Wait, they do say that?! Craminy Crap!\n\nWell, apparently you can puncture your eardrum with a Q-tip. And Sesame Street when we were kids was just way too \"real\" for the children of today. Oscar the Grouch was actually grouchy. The city streets looked like real city streets. And when a character died, they actually (*gasp*) died.\n\nIn this case, the character was Harold Hooper — Mr. Hooper to his friends — who ran the corner store, was fluent in Yiddish, and was wished a Happy Chanukah every year in the Christmas Special. \n\nWhen the actor playing him died of a heart attack — rather than do the usual thing and simply write him out or hire a new actor to play him — Sesame Street dedicated a whole episode to the character's death: treating it like a real thing that actually happens that we actually have to deal with. The fact that we were five when it happened yet we still remember the episode says a lot about how well done it was.\n\nBut, apparently, the modern child couldn't handle such things. And so we ask that you protect their fragile psyches and keep them far, far away from such dangerous \"knowledge.\"\n\nAfter all, it's not like they'll ever have to deal with dirty streets or grouchy people or death in real life.",
  "pros": null,
  "cons": null,
  "score": 1027,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/m/mr__hooper.jpg",
  "created_at": "2025-03-29T13:16:48+02:00",
  "updated_at": "2025-03-29T13:16:48+02:00"
}