{
  "name": "Murder, Inc.",
  "url": "http://jewornotjew.com/profile.jsp?ID=1692",
  "verdict": "Borderline Jew.",
  "description": "The magic number is 10. It takes 10 Jewish men (or 10 men and/or women and/or colobus monkeys if you're Reform), called a minyan,  to hold an official service and pray to G-d. If you've only got 9, the almighty — blessed be He — will go back to catching up on old episodes of The Wire.\n\nOr something like that. Of course, this being Judaism and all, you can cheat the system. The temple you're in, for example, can count as 1 person. The Ark where you keep your torahs, that's a person, too. Even the big guy (or gal, please to not smite) will put Stringer and MacNulty on pause and chip in to fill your minyan.\n\nMurder Inc., on the other hand, well these were not exactly your stereotypical temple-going Jews. Based out of a candy shop in Brooklyn (you cannot make this stuff up, people), the kosher kill squad was at the beck and call of La Cosa Nostra during the 30s and 40s, \"erasing\" anyone who happened to \"run afoul\" of \"the family\" for around five grand a (literal) pop.\n\nMurder Inc. was brought down after multiple members turned state's evidence in the 40s and have gone into history as the Jewish murder squad.  But were they actually all Jewish?\n\nNot really. There were plenty o' Jews natch, including major players Louis \"Lepke\" Buchalter, Martin \"Bugsy\" Goldstein, and Abe \"Kid Twist\" Reles. But other important members such as Albert Anastasia (the Lord High Executioner) and Joe Adonis were not. \n\nEnough to form a minyan, though? Well we doubt the men of Murder Inc. were calling on temples and torahs to make their 10. But chances are they could scare up enough nice Jewish boys to pray to G-d if they so desired.\n\nWe can't imagine it was a frequent problem, however.",
  "pros": null,
  "cons": null,
  "score": 1692,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/m/murder,_inc_.jpg",
  "created_at": "2025-03-29T13:17:06+02:00",
  "updated_at": "2025-03-29T13:17:06+02:00"
}