{
  "name": "Nero",
  "url": "http://jewornotjew.com/profile.jsp?ID=476",
  "verdict": "Not a Jew",
  "description": "As part of JONJ's continued dedication to our long history and the Jewish community, we will occasionally republish profiles from our historical archives. Today we present Nero, which originally appeared in \"Jew or Not Jew Scroll XVI\" written in the year 250 by former staff writer Rabbi Natan ben Eliezar (translated from the original Ancient Hebrew by JONJ house translation expert Pincus Horowitz).\n\nTo our notice tis come a new book which hath been titled The Talmud. Having thus received an advanced copy, we — those learned and holy enough to compose this volume thou now holds in thine hands — hath set about to review it, forthwith. \n\nIn this Talmud is contained much of interest, though not much to discuss with one so engaged as thou. However, this tome doth contain one claim worthy of discussion: that Nero — hated Nero of Rome who didst begin the war ending in the destruction of our Temple on Tish B'Av — hadst converted to the holy and rightful worship of Hashem before his death.\n\nThe story moves thusly: Nero, cowed upon seeing the works of the one G-d, King of the Universe, hallowed be his name, chose to convert to our own religion rather than face the wrath of the Lord in the year 3826 (66 by the count of this new Christian calendar which hath suddenly gained so much popular acclaim).\n\nForsooth! Couldst such a claim contain the word of truth? It seemeth unlikely that one so Roman as Nero wouldst consider such a decision, so entrenched in their beliefs were they. Further, if Nero was Jewish, wouldst he really have continued his violent campaign against our people?\n\nAnd even if there was some scent of possibility amongst these passing scents, do we really want a matricidal brigand best known for fiddling with his lyre as the great city of Rome didst burn?\n\nWe say nay, which leads to the following verdict, easily declared with the most honest of intentions and veracity.",
  "pros": null,
  "cons": [
    "ider such a decision, so entrenched in their beliefs were they. Further, if Nero was Jewish, wouldst he really have continued his violent campaign against our people?",
    "And even if there was some scent of possibility amongst these passing scents, do we really want a matricidal brigand best known for fiddling with his lyre as the great city of Rome didst burn?",
    "We say nay, which leads to the following verdict, easily declared with the most honest of intentions and veracity."
  ],
  "score": 476,
  "category": "Religion",
  "image_url": "http://jewornotjew.com/img/people/n/nero.jpg",
  "created_at": "2025-03-29T12:52:54+02:00",
  "updated_at": "2025-03-29T12:52:54+02:00"
}