{
  "name": "Nikki Reed",
  "url": "http://jewornotjew.com/profile.jsp?ID=611",
  "verdict": "Jew",
  "description": "\"Another one?\"\n\nThe old man looked at his glass.\n\n\"Sure, darling, fill it up. The same.\"\n\nHis long, pale, brittle fingers reached for the glass.\n\n\"You see those kids?\", he said, pointing to a table in the back.\n\nI glanced over. A girl and a boy, all decked in black.\n\n\"Yep... vampires.\"\n\n\"Vampires?\"\n\nThe old man got up from the barstool. I could hear the bones creak.\n\nHe dragged his feet to the young couple's table.\n\n\"And who are you supposed to be?\"\n\nThe boy picked up his head from the cheese fries. His eyes were smudged with black eyeliner.\n\n\"Excuse me?\"\n\n\"You... you, young man. Who are you supposed to be?\"\n\n\"Supposed to be? I'm Edward Cullen.\"\n\n\"And you?\", the old man addressed the girl.\n\n\"Rosalie Hale.\"\n\nHer died-blond hair was showing its roots.\n\n\"Nice to meet you, Edward and... Rosalie. I'm Fred... Fred Tompkins.\"\n\nHe drew forward his hand. The boy, grimacing, shook it. The girl stayed still.\n\n\"I hear you're vampires,\" the old man said.\n\n\"That's right,\" the boy answered.\n\n\"Waiting for twilight, then?\"\n\n\"Huh?\"\n\n\"Twilight... waiting for twilight?\"\n\n\"I heard you the first time, Mr... Tompkins. Do you mean, waiting for the release of Midnight Sun? Twilight has been out for years.\"\n\n\"Midnight Sun? Haven't heard anyone use that term for... a long time.\"\n\nThe girl shot a piercing look to her friend.\n\n\"Look, sir,\" the boy said. \"My girlfriend and I are just trying to have dinner together. I appreciate that you're also a fan, but...\"\n\n\"A fan?\"\n\n\"Yes. A fan of the Twilight books. Isn't that what you said?\"\n\n\"Books?\"\n\nThe girl finally spoke.\n\n\"Let's go, Jerry. I've had enough.\"\n\nThe boy reached into his wallet, took out a bill and some coins, and dropped them on the table. The two got up and left.\n\nI walked over and picked up the money.\n\n\"Kids!\", the old man said.\n\n\"Tell me about it,\" I sighed, counting the loose change.\n\nHe slogged back to the bar.\n\n\"We're closing soon,\" I said.\n\n\"One for the road?\", he asked.\n\n\"Sure, honey.\"\n\nI poured him another Bloody Mary.\n\n\nVampire Rosalie Hale, the so-called \"most beautiful person in the world\", is played in the movie by the Jewish Nikki Reed. This is the only Jewish link to Twilight we could find.",
  "pros": null,
  "cons": null,
  "score": 611,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/n/nikki_reed.jpg",
  "created_at": "2025-03-29T12:52:57+02:00",
  "updated_at": "2025-03-29T12:52:57+02:00"
}