{
  "name": "Nim Chimpsky",
  "url": "http://jewornotjew.com/profile.jsp?ID=3169",
  "verdict": "Not a Jew",
  "description": "One of the great forgotten websites of the early Internet is The Monkey Shakespeare Simulator, which attempted to simulate the Infinite Monkey Theorem:\n\n\nAn infinite amount of monkeys on typewriters given an infinite amount of time will eventually accidentally type out the complete works of Shakespeare.\n\nAlas, the website maxed out at 24 characters of \"Henry IV, Part 2\" after \"2,737,850 million billion billion billion monkey-years\". Not even close to infinity.\n\nWe guarantee that our own Monkey Shakespeare Simulator will not improve on that, but give it a whirl! We named it after Nim Chimpsky, the monkey who tried to develop human language. (Who, in turn, is named after self-loathing Jew Noam Chomsky.) Because we also do not have infinite time, we limited our monkeys to the 26 letters, ignoring capitalization, spaces, and punctuation... and limited Shakespeare's library to 133 of his most well-known quotes.\n\n\n\n\n\n\n\n\n\n\n\n\nchars = \"ABCDEFGHIJKLMNOPQRSTUVWXYZ\";\nclean = new Array(\n\"To be, or not to be: that is the question\",\n\"Neither a borrower nor a lender be; For loan oft loses both itself and friend, and borrowing dulls the edge of husbandry\",\n\"This above all: to thine own self be true\",\n\"Though this be madness, yet there is method in 't.\",\n\"That it should come to this!\",\n\"There is nothing either good or bad, but thinking makes it so\",\n\"What a piece of work is man! how noble in reason! how infinite in faculty!\",\n\"The lady doth protest too much, methinks\",\n\"In my mind's eye\",\n\"A little more than kin, and less than kind\",\n\"The play 's the thing wherein I'll catch the conscience of the king\",\n\"And it must follow, as the night the day, thou canst not then be false to any man\",\n\"This is the very ecstasy of love\",\n\"Brevity is the soul of wit\",\n\"Doubt that the sun doth move, doubt truth to be a liar, but never doubt I love\",\n\"Rich gifts wax poor when givers prove unkind\",\n\"Do you think I am easier to be played on than a pipe?\",\n\"I will speak daggers to her, but use none\",\n\"When sorrows come, they come not single spies, but in battalions\",\n\"All the world 's a stage, and all the men and women merely players\",\n\"Can one desire too much of a good thing?\",\n\"I like this place and willingly could waste my time in it\",\n\"How bitter a thing it is to look into happiness through another man's eyes!\",\n\"Blow, blow, thou winter wind! Thou art not so unkind as man's ingratitude\",\n\"True is it that we have seen better days\",\n\"For ever and a day\",\n\"The fool doth think he is wise, but the wise man knows himself to be a fool\",\n\"Now is the winter of our discontent\",\n\"A horse! a horse! my kingdom for a horse!\",\n\"Conscience is but a word that cowards use, devised at first to keep the strong in awe\",\n\"So wise so young, they say, do never live long\",\n\"Off with his head!\",\n\"An honest tale speeds best, being plainly told\",\n\"The king's name is a tower of strength\",\n\"The world is grown so bad, that wrens make prey where eagles dare not perch\",\n\"O Romeo, Romeo! Wherefore art thou Romeo?\",\n\"It is the east, and Juliet is the sun\",\n\"Good Night, Good night! Parting is such sweet sorrow, that I shall say good night till it be morrow.\",\n\"What's in a name? That which we call a rose by any other name would smell as sweet\",\n\"Wisely and slow; they stumble that run fast\",\n\"Tempt not a desperate man\",\n\"For you and I are past our dancing days\",\n\"O! she doth teach the torches to burn bright\",\n\"It seems she hangs upon the cheek of night like a rich jewel in an Ethiope's ear\",\n\"See, how she leans her cheek upon her hand! O that I were a glove upon that hand, that I might touch that cheek!\",\n\"Not stepping o'er the bounds of modesty\",\n\"But love is blind, and lovers cannot see\",\n\"If you prick us, do we not bleed? if you tickle us, do we not laugh? if you poison us, do we not die?\",\n\"The devil can cite Scripture for his purpose\",\n\"I like not fair terms and a villain's mind\",\n\"Why, then the world 's mine oyster\",\n\"This is the short and the long of it\",\n\"I cannot tell what the dickens his name is\",\n\"As good luck would have it\",\n\"Our doubts are traitors, and make us lose the good we oft might win, by fearing to attempt\",\n\"Some rise by sin, and some by virtue fall\",\n\"The miserable have no other medicine but only hope\",\n\"He will give the devil his due\",\n\"The better part of valour is discretion\",\n\"He hath eaten me out of house and home\",\n\"Uneasy lies the head that wears a crown\",\n\"A man can die but once\",\n\"I do now remember the poor creature, small beer\",\n\"We have heard the chimes at midnight\",\n\"The smallest worm will turn, being trodden on\",\n\"Suspicion always haunts the guilty mind; The thief doth fear each bush an officer\",\n\"Delays have dangerous ends\",\n\"Of all base passions, fear is the most accursed\",\n\"The first thing we do, let's kill all the lawyers\",\n\"Small things make base men proud\",\n\"True nobility is exempt from fear\",\n\"Having nothing, nothing can he lose\",\n\"I 'll not budge an inch\",\n\"We have seen better days\",\n\"Friends, Romans, countrymen, lend me your ears; I come to bury Caesar, not to praise him\",\n\"But, for my own part, it was Greek to me\",\n\"A dish fit for the gods\",\n\"Cry ''Havoc,'' and let slip the dogs of war\",\n\"Et tu, Brute!\",\n\"Men at some time are masters of their fates: The fault, dear Brutus, is not in our stars, but in ourselves, that we are underlings\",\n\"Not that I loved Caesar less, but that I loved Rome more\",\n\"Beware the ides of March\",\n\"This was the noblest Roman of them all\",\n\"When that the poor have cried, Caesar hath wept: Ambition should be made of sterner stuff\",\n\"Yond Cassius has a lean and hungry look; He thinks too much: such men are dangerous\",\n\"For Brutus is an honourable man; So are they all, all honourable men\",\n\"As he was valiant, I honor him; but, as he was ambitious, I slew him\",\n\"Cowards die many times before their deaths; The valiant never taste of death but once\",\n\"There 's daggers in men's smiles\",\n\"what 's done is done\",\n\"I dare do all that may become a man; Who dares do more is none\",\n\"Fair is foul, and foul is fair\",\n\"I bear a charmed life\",\n\"Yet do I fear thy nature; It is too full o' the milk of human kindness.\",\n\"Will all great Neptune's ocean wash this blood clean from my hand?\",\n\"Double, double toil and trouble; Fire burn, and cauldron bubble.\",\n\"Out, damned spot! out, I say!\",\n\"All the perfumes of Arabia will not sweeten this little hand.\",\n\"When shall we three meet again in thunder, lightning, or in rain? When the hurlyburly 's done, when the battle 's lost and won\",\n\"If chance will have me king, why, chance may crown me\",\n\"Nothing in his life became him like the leaving it\",\n\"Look like the innocent flower, but be the serpent under 't.\",\n\"I have no spur to prick the sides of my intent, but only vaulting ambition, which o'erleaps itself, and falls on the other.\",\n\"Is this a dagger which I see before me, The handle toward my hand?\",\n\"Out, out, brief candle! Life's but a walking shadow, a poor player that struts and frets his hour upon the stage and then is heard no more\",\n\"How sharper than a serpent's tooth it is to have a thankless child!\",\n\"I am a man more sinned against than sinning\",\n\"My love's more richer than my tongue\",\n\"Nothing will come of nothing.\",\n\"Have more than thou showest, speak less than thou knowest, lend less than thou owest\",\n\"The worst is not, So long as we can say, 'This is the worst.'\",\n\"'T'is neither here nor there.\",\n\"I will wear my heart upon my sleeve for daws to peck at\",\n\"To mourn a mischief that is past and gone is the next way to draw new mischief on\",\n\"The robbed that smiles steals something from the thief\",\n\"My salad days, when I was green in judgment.\",\n\"The game is up.\",\n\"I have not slept one wink.\",\n\"Be not afraid of greatness: some are born great, some achieve greatness and some have greatness thrust upon them\",\n\"Love sought is good, but giv'n unsought is better\",\n\"We are such stuff as dreams are made on, rounded with a little sleep\",\n\"Men of few words are the best men\",\n\"The course of true love never did run smooth\",\n\"Love looks not with the eyes, but with the mind, and therefore is winged Cupid painted blind\",\n\"Everyone can master a grief but he that has it\",\n\"These words are razors to my wounded heart\",\n\"What 's gone and what 's past help should be past grief\",\n\"You pay a great deal too dear for what's given freely\",\n\"Out of the jaws of death\",\n\"Thus the whirligig of time brings in his revenges\",\n\"For the rain it raineth every day\",\n\"The common curse of mankind, - folly and ignorance\",\n\"Nature teaches beasts to know their friends\"\n)\nmatch = new Array(clean.length);\nfunction randomString(r) {\n  r = '';\n  for (i=0;i\u003c20;i++) {\n    r += chars.charAt(Math.floor(Math.random() * 26));\n  }\n  return r;\n}\nfunction getMatch(a, b) {\n  if (a.length \u003e b.length) a = a.substring(0, b.length);\n  else if (b.length \u003e a.length) b = b.substring(a, b.length);\n  for (i=0;i\u003ca.length;i++) {\n    if (a.charAt(i) != b.charAt(i)) {\n      return a.substring(0, i);\n    }\n  }\n  return a;\n}\nfunction stripString() {\n  for (i=0;i\u003cclean.length;i++) {\n    match[i] = clean[i].replace(/[^a-z]/gi, '').toUpperCase();\n  }\n}\nrecord = 1;\ncounter = 1;\nbest = '';\nd0 = document.getElementById(\"blurb\");\nd1 = document.getElementById(\"dump\");\nd2 = document.getElementById(\"current\");\nstripString();\nstripString();\nfunction generate(mx, ev) {\n  ms = mx;\n  if (ev != null \u0026\u0026 ev.shiftKey) ms *= 100;\n  d0.style.display = 'none';\n  d1.innerHTML = '';\n  d2.innerHTML = \"Monkeys #\"+dec(counter)+\"-\"+dec(counter+ms-1)+\" typing...\";\n  setTimeout('monkeys('+ms+')',10);\n}\nfunction monkeys(mx) {\n  better = false;\n  top = 0;\n  save = new Array(4);\n  save[0] = 0;\n  for (w=0;w\u003cmx;w++) {\n    cw = counter+w;\n    r = randomString();\n    for (q=0;q\u003cmatch.length;q++) {\n      m = getMatch(r, match[q]);\n      if (m.length \u003e record) {\n        better = true;\n        output(cw, m, r, q, better);\n        record = m.length;\n      }\n      if (!better \u0026\u0026 m.length == record \u0026\u0026 save[0] == 0) {\n        save[0] = cw;\n        save[1] = m;\n        save[2] = r;\n        save[3] = q;\n      }\n    }\n  }\n  counter += mx;\n  if (!better \u0026\u0026 save[0] != 0) {\n    output(save[0], save[1], save[2], save[3]);\n  } else if (!better) {\n    fail();\n  }\n}\nfunction decorate(s1, s2) {\n  return \"\u003cb\u003e\"+s2.substring(0, s1.length)+\"\u003c/b\u003e\"+s2.substring(s1.length,15)+\"...\";\n}\nfunction output(c, m, r, q, b) {\n  t = '\u003cp\u003eMonkey #' + dec(c) + ' matched ' + m.length + ' characters! \"' + decorate(m, r) + '\": \u003ci\u003e' + clean[q] + '\u003c/i\u003e\u003cbr\u003e';\n  if (b) best = t; else best += t;\n  d1.innerHTML += t;\n}\nfunction showBest() {\n  if (best == '') restart(100000);\n  d1.innerHTML = best;\n}\nfunction fail() {\n  d1.innerHTML += \"\u003cp\u003eCould not match previous record...\";\n}\nfunction restart(x) {\n  record = 1;\n  counter = 1;\n  best = '';\n  generate(x);\n}\nfunction dec(x) {\n  return x.toLocaleString();\n}",
  "pros": null,
  "cons": null,
  "score": 3169,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/n/nim_chimpsky.jpg",
  "created_at": "2025-03-29T13:17:44+02:00",
  "updated_at": "2025-03-29T13:17:44+02:00"
}