{
  "name": "Olive Oyl",
  "url": "http://jewornotjew.com/profile.jsp?ID=994",
  "verdict": "Not a Jew",
  "description": "When we were children, Popeye was considered sort of... respectable. Even a role model.\n\nHere was a hero whose powers were gained by eating healthy food! That's right, kids, eat your spinach and you'll grow up to be strong! Just like Popeye. Isn't that nice? Certainly a lot more attainable than coming from a different planet or being bitten by a radioactive spider or whatever.\n\nOf course, nowadays, telling kids to be like Popeye and smoke a pipe, mutter nonsense under your breath, and beat up Native Americans (seriously, go find the old cartoons. He spent an inordinate amount of time getting chippy with the Cherokee) seems downright daffy. \n\nAnd what of Popeye's \"friends\"? Wimpy: an unrepentant moocher taking advantage of someone who's a little soft in the head. Jeep: a creature that could only exist as a schizophrenic hallucination. In this light, even Bluto comes off as a well-intentioned fellow, trying to rescue Olive Oyl from spending the rest of her life with this loon (either that or he's a serial rapist. Ah, the thirties...). \n\nAnd what of this always-wanted woman? Well, some people would have you believe that Olive Oyl was actually Jewish (see, we're getting there). Yeah, not so much. Tall, skinny-as-a-stick, helpless? No Jewish woman we know. The Jewish woman is usually a shorter sort, with good meat on those bones (and in the chest, Hashem bless them!), and a robust attitude to match. Your Idas and your Sarahs don't need some spinach swilling, one-eyed (possibly autistic) brute. They'll rescue themselves, thank you very much.\n\nNo, sadly, if we were going to say that anyone acts Jewish in Popeye, it would be the aforementioned Wimpy. And, well, we all know better than to go there.",
  "pros": null,
  "cons": null,
  "score": 994,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/o/olive_oyl.jpg",
  "created_at": "2025-03-29T12:53:07+02:00",
  "updated_at": "2025-03-29T12:53:07+02:00"
}