{
  "name": "Oscar Straus",
  "url": "http://jewornotjew.com/profile.jsp?ID=1271",
  "verdict": "Jew",
  "description": "You know what we want (besides, y'know, the usual, obvious stuff like food, shelter and the financial wherewithal to afford such things plus a really nice sports car)? We want a Jewish themed travel book series. Something called Frommerstein's or Kvetchy Planet or something that would tell the Jewish traveler where to go and what to see all around America. After all, there are gay travel guides, so why not Jewish ones?\n\nFor instance, the Washington D.C., Fodorberg's would tell you all about the great kosher delis to visit while you're there (Eli's for one) and explain that while Ben's Chili Bowl isn't kosher, such deliciousness is worth risking G-d's ire. It would have a whole section on the D.C. sports scene, including how the Nationals' starting third baseman and star starting pitcher aren't Jews, but the owner of its football team is.\n\nAnd, of course, it would tell you all about the various Jewish locations you have to visit including the Jew-ier sections of the Smithsonian, the Holocaust museum and the one and only Jewish monument.\n\nYes, there really is a Jewish monument: erected for Oscar Straus, the first Jewish member of the cabinet (Secretary of Commerce and Labor, he served under Teddy \"Rough and Ready\" Roosevelt). Ok, so the monument looks like two men in bed together, but that's for the gay guide book to discuss (it's meant to represent the greek ideals of religious freedom and capitalism but, ummm). Anyway, it's more than we ever could have hoped for, so we'll take it.\n\nBut how would any mensch of a traveler have known to visit this wonderful memorial if it weren't for their handy-dandy Hebrew guide book?\n\nOur point exactly.",
  "pros": null,
  "cons": null,
  "score": 1271,
  "category": "Religion",
  "image_url": "http://jewornotjew.com/img/people/o/oscar_straus.jpg",
  "created_at": "2025-03-29T13:16:55+02:00",
  "updated_at": "2025-03-29T13:16:55+02:00"
}