{
  "name": "Oscar Goodman",
  "url": "http://jewornotjew.com/profile.jsp?ID=1010",
  "verdict": "Jew",
  "description": "What is the best job on earth (besides professional Jew-rater, because that's just, like, a given)?\n\nSome people would tell you that it's backup quarterback for a professional football team. There are caveats, of course. For example, it would have to be for a team with a good, durable QB (so you never have to play). But for the most part, that's a career you can live with: carry a clipboard all season, collect seven figures and maybe even celebrate a Super Bowl without ever even elevating your arm. Not bad. But then the QB's knee snaps and there goes your perfect gig...\n\nOthers might say professional gamer or candy taster or mattress comfort connoisseur but none of those jobs are real (wait, professional gamer is REAL?).\n\nSo what is the best job ever? Mayor of Las Vegas.\n\nFor one, Vegas is about as fun a town as one can find. We all think of the gambling and that's fine for those that like that sort of thing. But then there's all the food — you can eat like a king's obese older, wiser, more king-ly king. The weather is pretty much year round pleasant, as well, with the summer heat covered for by the almost ubiquitous A/C.\n\nAnd sure you can kvell about a bunch of other cities this way: NYC, Miami, Chicago, Boston, San Fran... But here's the thing: Las Vegas (secretly) has fewer of the urban issues you'd expect to put up with as the big mayor on campus of those other burgs. Yup, mayor of Las Vegas is a pretty sweet setup. The events. The celebrity photo-opps. The declaring of various gambling related holidays...\n\nOf course, there can only be one and right now that person is Oscar Goodman, Jew, and fairly fine fellow (so we're told). So for now, you'll have to wait to grab the greatest job on earth. But while you're waiting, you may as well fill out an application for professional Jew rater. After all, we do have an opening or two.",
  "pros": null,
  "cons": null,
  "score": 1010,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/o/oscar_goodman.jpg",
  "created_at": "2025-03-29T13:16:48+02:00",
  "updated_at": "2025-03-29T13:16:48+02:00"
}