{
  "name": "Paul Goldschmidt",
  "url": "http://jewornotjew.com/profile.jsp?ID=1654",
  "verdict": "Barely a Jew",
  "description": "Baseball is a simple game: throw ball, hit ball, catch ball. So how come we have so many complicated arguments about it?\n\nFor instance, the (stupid, useless, exasperating) MVP award. You'd think something like that would be pretty easy to figure out. But nooooooo.\n\nSome people think that the MVP award is only for the people who stand at the plate and wave the big wooden thing around. Despite the fact that the word hitter (or batter, or offensive player...) is nowhere to be found in the words Most or Valuable or Player. Or that several pitchers have actually won the award.\n\nOther people seem to think that the word \"valuable\" is the most important part of Most Valuable Player. So we get all kinds of moronic arguments over what \"valuable\" means. \n\nA player who is 10 times better than another might not win because his team isn't good, and only winning teams have valuable players. A player who does well in certain statistical categories is more valuable than one who does well in other (actually important) categories because that's the way they set it up over a century ago and damned if we'll change now. And so forth.\n\nThen there are people who choose the MVP because he gave them a nice quote that one time or because the player seems like (accent on the seems) a nice family man or because they're just certain certain certain that the player is not using performance enhancing drugs. At least till the blood tests come back, anyway.\n\nAll of this means... well, frankly we're not sure, except that the MVP award is now about as meaningful as the Rice-A-Roni Best Mustache of the Month Award.  \n\nWhich is too bad, because Paul Goldschmidt would make a really nice MVP this year: he's outplaying almost every other hitter in baseball.\n\nThe Most Valuable Jew award, though? Even though Goldschmidt was raised Christian? That choice is actually quite simple.",
  "pros": null,
  "cons": null,
  "score": 1654,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/p/paul_goldschmidt.jpg",
  "created_at": "2025-03-29T13:17:05+02:00",
  "updated_at": "2025-03-29T13:17:05+02:00"
}