{
  "name": "Peter Engel",
  "url": "http://jewornotjew.com/profile.jsp?ID=2594",
  "verdict": "Barely a Jew",
  "description": "The Christian Broadcasting Network, which (we assume) is a network that broadcasts Christian shows, has a profile of producer Peter Engel. It's a doozy! All the quotes below are direct and are NOT taken out of context, but we had to crop out some lines for brevity.\n\nPeter grew up Jewish and had his bar mitvah at 13. He produced sports programs and then moved to Hollywood in 1967.\n\nThey misspelled \"mitzvah\". Should we cut them some slack? No.\n\nWhen his wife left him in 1977, things in his life began to fall apart. He got heavily into cocaine, saw his psychiatrist three times a week, and consulted his psychic and astrologer weekly. There was also a parade of women in his life.\n\nWe love this paragraph so much! Yet we have so many questions... Let's just ask one: is seeing a psychiatrist a bad thing? OK, another: he had a psychic AND an astrologer? And... you know, let's just move on.\n\nOne night in 1979, Peter had a heart attack in bed. Then he heard the Voice of the Lord telling Peter that He loved him and that He had never left Peter's side through all his times of suffering. Peter was then supposed to tell others, especially his fellow Jews.\n\nYou know what? It beats Son of Sam getting orders from a dog.\n\nAfter telling several people, including his psychiatrist, they didn't get it, and after a couple of months, Peter turned back to a life of drugs.\n\nThat's an unreadable sentence, but let us guess: that psychiatrist must have been Jewish, right? Anyway, long story short...\n\nThe Lord lifted the veil from his eyes, and his whole life changed. Peter turned away from drugs and surrounded himself with strong, Christian men.\n \nSo let's thank \"the Lord\" that Peter survived his horrible ordeal,  preached the word of Jesus to others (especially his \"fellow Jews\"), surrounded himself with \"strong, Christian men\", and completely turned around his miserable life. Before switching to the Christian network, he went on to create the most important, ground-breaking, life-affirming television program of the 20th century.\n\nSaved by the Bell.",
  "pros": null,
  "cons": null,
  "score": 2594,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/p/peter_engel.jpg",
  "created_at": "2025-03-29T13:17:29+02:00",
  "updated_at": "2025-03-29T13:17:29+02:00"
}