{
  "name": "Peter Eisenman",
  "url": "http://jewornotjew.com/profile.jsp?ID=2709",
  "verdict": "Jew",
  "description": "We were in Berlin recently, and it's amazing how one city can capture an entire century. From World War I to the rise of Nazism to World War II to the duration of the Cold War, Europe's modern history runs through its streets. To see the Reighstag, with its modern glass dome replacing the one destroyed, to stand on the steps where horrible atrocities were launched, to gasp at the green grass that separates the two halves of the Wall... It's not a city that can leave one apathetic.\n\nAnd then there is the Memorial to the Murdered Jews of Europe. Smack in the middle of the city, a minute's walk from Brandeburg Gate, lie 2711 concrete slabs\nof various heights. There are no inscriptions. There are no signs anywhere, in fact — without knowing what it is, you would have no idea. Kids run through it, hiding in the maze. Tourists sit on the slabs, listening to their guide. There is no interpretation, the guide says. Sculptor Peter Eisenman designed it to be so. It's purposely open-ended. You see in it what you see in it. Now see you on the other side.\n\n\n [X]\n\n\nSo we walked, along the stone paths in between the slabs. And then we turned — it's all right angles, it's all rows and columns, and it doesn't matter where you turn. If the goal is to make it to the other side, you won't get lost. It's really not a labyrinth, it's just that an every intersection, you have a choice. Turn or go straight. Then, again, turn or go straight. No matter what you do, you'll make it to the end.\n\nAnd then it hit us... the choice doesn't matter. Those murdered Jews, they all spent their lives making choices, and none of them mattered. They all ended up in the same way. They all made it to the same end.\n\nIt definitely did not leave us apathetic.",
  "pros": null,
  "cons": null,
  "score": 2709,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/p/peter_eisenman.jpg",
  "created_at": "2025-03-29T13:17:31+02:00",
  "updated_at": "2025-03-29T13:17:31+02:00"
}