{
  "name": "Pierre Niney",
  "url": "http://jewornotjew.com/profile.jsp?ID=3581",
  "verdict": "Jew",
  "description": "If some of us are asked what our favorite book of all time is, the answer is the same as to what our LEAST favorite movie of all time is... \"The Count of Monte Cristo\".\n\nThe book is perfect (alright, its 1200 or so pages could use a little trimming), full of intricate plot (and plot! and plot!), the ultimate story of (spoiler alert!) ultimately pointless revenge. The movie... and here we are talking specifically of the 2002 film, starring the pre-Jesus Jim Caviezel, takes everything great about the book, sticks it in a meat grinder, and produces a hot pile of steaming dreck. (We might be mixing metaphors here, so be it.)\n\nOf course, adapting this gargantuan novel is difficult; many have tried through the years, and many have failed. The less can be said about the French miniseries starring the 300 pounds of Gerard Depardieu, the better. (It still beats the Caviezel version!) So we were very apprehensive when the French went back to the well and brought a new variant to the silver screen. After all, the same production team did not do a great service to \"The Three Musketeers\". (You can read all about that in the profile of Louis Garrel, linked below.)\n\nWe really liked it! No, not because Monte Cristo was played by a Jew, Pierre Niney. It's because they managed to adhere to the core of the book without any major sacrifices. Sure, some characters and actions were changed around, some things were obviously omitted, but some notes were hit perfectly and the spirit of the novel remained. (Which cannot be said about the merde that is the Caviezel version, which completely subverts it. What a piece of garbage that movie is.)\n\nSo, Dumas fans, if you can tolerate three hours of subtitles, some of us recommend!",
  "pros": null,
  "cons": null,
  "score": 3581,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/p/pierre_niney.jpg",
  "created_at": "2025-03-29T13:17:54+02:00",
  "updated_at": "2025-03-29T13:17:54+02:00"
}