{
  "name": "Porpentina Goldstein",
  "url": "http://jewornotjew.com/profile.jsp?ID=2306",
  "verdict": "Jew",
  "description": "J.K. Rowling is a wonderful writer. The worlds she builds are amazing, the characters are riveting, the suspense is engrossing. We're not just talking about Harry Potter. Her Robert Galbraith mysteries are excellent as well.\n\nWhat J.K. Rowling is not is a screenwriter. The eight Potter films were not scripted by her. The new sort-of-prequel, \"Fantastic Beasts and Where to Find Them\", was. Now, the movie is not bad... but it's not exactly great either.\n\nPerhaps the fault lies in trying to build a world out of a throw-away textbook title, which is what \"Fantastic Beasts\" is in the Potter universe. The beasts are the worst part of the movie, almost extraneous to the main plot. (Although the eight-year-old really liked them. So what do we know?)\n\nThe major new characters introduced fall flat as well: the beast-finding Newt Scamander proves that a Hufflepuff should never be the lead of anything, and the best part of Tina Goldstein is her supposed Jewishness. (Is she related Anthony Goldstein, the background character in the Potter books, J.K.?)\n\nNow, there is enough positive there to carry through the planned five films; J.K. lays down the foundation, and pieces of it definitely work, especially the muggle-wizard struggle. (The one thing that doesn't is the major twist that was telegraphed from the opening credits on. Your twists in the books are fantastic, J.K.!) And considering this all leads to the epic Dumbledore vs Grindelwald battle, we have no choice but to be there for the ride.\n\nThat being said, maybe J.K. could write them up in book form, and let someone else adapt them?\n\n(Editor's update: G-d, the sequels are a mess. We bailed on the ride.)",
  "pros": null,
  "cons": null,
  "score": 2306,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/p/porpentina_goldstein.jpg",
  "created_at": "2025-03-29T13:17:21+02:00",
  "updated_at": "2025-03-29T13:17:21+02:00"
}