{
  "name": "Rachel Uchitel",
  "url": "http://jewornotjew.com/profile.jsp?ID=696",
  "verdict": "Sadly, a Jew.",
  "description": "Once upon a time, there lived a Nubian warrior.\n\nSome warriors use swords. Some use knives. Some strange ones throw a bladder covered in hog's skin. Our warrior used a club.\n\nAnd no other club-wielding warrior was a match for him. Not the Angles, not the Saxons, not the Gauls, not the Vikings or the Jews. The first four not for the lack of trying; the latter because the Angles and the Saxons did not allow them on the battlefield.\n\nSo our warrior defeated all comers, and grew rich and powerful. He had built for himself an enormous castle surrounded by palm trees, he drove the most exclusive chariot, he was revered throughout the lands. But one thing was missing. The warrior wanted love.\n\nOne day he was feasting in the hall of a Viking warrior. The Nubian has bested him in many battles, but the two have grown to be friends. A fair maiden caught the Nubian's eyes. Her skin was like the whitest snow, he hair like the golden sun, her eyes like the bluest lakes in all of Norland.\n\n\"Who is that fair maiden?\", the warrior asked.\n\n\"It is my children's servant,\" answered the Viking.\n\n\"I must have her!\", said the Nubian.\n\n\"Then have her you will. Come forth, maiden,\" said the Viking.\n\nThe young Nordic beauty was smitten by the warrior. Soon, they were married. Rivers of ale drowned the cheers of revelers. There was much rejoicing.\n\n* * *\n\nTime passed. The Nordic beauty loved her life. Everything was new and wonderful: the tropical birds serenading her morning, the extravagant castle she roamed at will, the lavish feasts she was now invited to, the loving husband who couldn't wait for her to bear him beautiful, Nubio-Nordic children.\n\nBut the Nubian warrior grew tired of his lovely bride. Yes, she was everything he ever wanted, but she was only one woman. And for our warrior, one was just not enough.\n\nSo what was he to do? Sure, any woman in the world would throw herself into his arms. But what would the people say? For our warrior did not want his revered image tarnished.\n\nOne day, a battle was fought in the Valley of Apples. The warrior vanquished his foes, but it was not an easy fight. Weakened from the battle, he sought refuge in a tavern before the long road home.\n\nAs the warrior was finishing his jug of ale, a beautiful sorceress approached him.\n\n\"I hear you're not happy,\" the sorceress said.\n\n\"What makes you say that?\", asked the Nubian. \"I have everything I ever wanted!\"\n\n\"Yet here you are, all alone, drinking the night away.\"\n\n\"Just celebrating another battle won!\"\n\n\"And with whom are you celebrating?\", asked the sorceress. \"I see no friends toasting your victory. I see no woman on your arm.\"\n\nThe Nubian warrior nodded his head.\n\n\"You looked inside my soul, oh sorceress! How did you know what I long for?\"\n\n\"I come from a long line of Jewish women. We're taught from a young age to meddle in other people's problems.\"\n\n\"Then help me with my problem, oh Jewess!\"\n\n\"I'll help you, noble warrior. But there is a price. A steep price indeed.\"\n\n\"Then name it! What do you want, oh sorceress? You don't mean... my soul?\"\n\n\"Your soul? Don't make me laugh. All I want is your money.\"\n\n\"Then my money you shall have!\"\n\nFor the next few years, the sorceress followed the warrior whenever he went. During the day, when he fought his battles, she hid herself in the shadows, but at night, when another victory was to be celebrated, she would come out in all her Hebrew glory.\n\nOn some nights, the sorceress would bring the Nubian a new maiden. Oh, the Jewess knew how to pick them! The warrior was always left satisfied, and the maidens left as swiftly as they appeared. On other nights, it was the Jewess herself that danced the dance of passion. And the warrior rewarded her handsomely.\n\n* * *\n\nYears passed. The Nubian's fame grew louder by the day. The Nordic beauty bore the warrior two beautiful children. Everything could not have worked out better.\n\nThen, one autumn night, after a holiday feast with his wife and family, the Nubian warrior left his house befuddled, saddled up his chariot, and...",
  "pros": null,
  "cons": null,
  "score": 696,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/r/rachel_uchitel.jpg",
  "created_at": "2025-03-29T12:52:59+02:00",
  "updated_at": "2025-03-29T12:52:59+02:00"
}