{
  "name": "Ralph Benjamin",
  "url": "http://jewornotjew.com/profile.jsp?ID=2371",
  "verdict": "Jew",
  "description": "Oh, good, you're reading this on a computer. Then you will get the full experience of this profile! Aren't you glad that you put down that phone or tablet?\n\nMove your mouse a bit, please. Hmmm. Are we waiting for something? It seems we're waiting for something. Why is that?\n\nIt's that pesky mouse cursor, spinning and spinning! Why on earth is it spinning? What are we waiting for? Make it stop!\n\nAlright, click here to make it stop. Isn't it interesting? The mouse cursor has conditioned you!\n\nWe'll tell you what you were waiting for: an explanation. Ralph Benjamin, the subject of this profile, invented the mouse. The invention is usually credited to Douglas Engelbart, but Benjamin preceded him by a good 20 years. He was working for the British navy (he got out of Germany to escape the Holocaust), and came up with the predecessor of the modern mouse.\n\nWhy didn't Benjamin get the credit? His invention was more like a trackball than a regular mouse... and the navy decided to go with a joystick instead, reducing Benjamin's invention to a place on dusty shelves.\n\nYears passed, Engelbart unknowingly followed in Benjamin's footsteps, and the rest is computing history. Soon, it was unimaginable for a computer to be without a mouse...\n\nUntil today, that is, when computers are getting replaced by phones and tablets, and that mouse and pointer is replaced by... your finger. But you know what? As hard as you try, you can't make your finger spin!\n\n\n\n\nfunction isMobile() {\n ua = navigator.userAgent.toLowerCase();\n b = (ua.match(/Android|BlackBerry|iPhone|iPad|iPod|Opera Mini|IEMobile/i));\n return b != null;\n}\nism = isMobile();\nm = document.getElementById(\"mobile\");\nif (ism) { t = \"Looks like you're reading this on a mobile device. Feel free to continue, but to get the full experience of this profile, could you please switch to a computer? Yeah, I know, we're acting like we're stuck in the 20th century. Come on, throw us a bone here. Go to a computer. We'll wait.\u003cp\u003eAlright, fine. Who is Ralph Benjamin? He is a mostly-forgotten British scientist who nevertheless created one of the most important inventions of the 20th century. Yes, 20th century. Now switch to a computer, please!\";\ndivHide(\"normal\")\nm.innerHTML = t;\n}\nif (!ism) {\n swapCursor(\"wait\");\n}\nfunction swapCursor(x) {\n document.body.style.cursor = x;\n}",
  "pros": null,
  "cons": null,
  "score": 2371,
  "category": "Science",
  "image_url": "http://jewornotjew.com/img/people/r/ralph_benjamin.jpg",
  "created_at": "2025-03-29T13:17:23+02:00",
  "updated_at": "2025-03-29T13:17:23+02:00"
}