{
  "name": "Ralph Branca",
  "url": "http://jewornotjew.com/profile.jsp?ID=1168",
  "verdict": "Barely a Jew",
  "description": "What makes a Jew? Hard to imagine we've written nearly 1200 of these things and still don't have a definitive answer. And yet, here we are.\n\nThis question came to national notice recently when the New York Times revealed that reviled (in some circles) reliever Ralph Branca was, to his own surprise, Jewish. Sort of. Let's break it down.\n\nRalph Branca's mother was Jewish. There is no dispute there. And thus many Jews would say, done and done. Jewish mother, Jewish blood, Jewish man.\n\nBut Branca's mother also converted when she came to America (her maiden name was Berger). Branca was raised Catholic. So he didn't celebrate the New Year two days before the fateful moment on October 3, 1951 when he did that most Jewish of things: become a scapegoat for a mistake that, in many ways, was not even his own fault.\n\nThis makes Branca a heck of a schlemiel, but it clouds his Judaism some, doesn't it? He didn't even know his own mother was Jewish until he was in his 80s. So how can a man who never immersed himself in his religious or cultural heritage — never even knew he was Jewish — be, in fact, a Jew?\n\nIn the end, it depends on how we see, or choose to see, ourselves. Are we a religion? A nation? A race? This question, for a people full of contentious issues, may very well be our most divisive. After all, it bores down to the core of who we really are.\n\nWhat makes a Jew? We suppose it is a matter of degrees. Of numbers and silly pictures and (in this case) a wishy-washy verdict. At least that's what we've come up with thus far. But really? A Jew is whoever he/she decides they want to be. And we wouldn't have it any other way. (Except for Jews for Jesus. Those people are just deluding themselves.)",
  "pros": null,
  "cons": null,
  "score": 1168,
  "category": "Religion",
  "image_url": "http://jewornotjew.com/img/people/r/ralph_branca.jpg",
  "created_at": "2025-03-29T13:16:52+02:00",
  "updated_at": "2025-03-29T13:16:52+02:00"
}