{
  "name": "Ray Kurzweil",
  "url": "http://jewornotjew.com/profile.jsp?ID=1767",
  "verdict": "Jew",
  "description": "Many have heard of the Bacon Number. You pick an actor and try to connect him to Kevin Bacon in as few movies as possible. For example, Natalie Portman and Martin Short appeared in \"Mars Attacks!\", Martin Short and Kevin Bacon appeared in \"The Big Picture\". Therefore, Natalie Portman's Bacon Number is 2.\n\nSome have heard of the Erdos Number. The wacky (and previously profiled) Hungarian mathematician Paul Erdos got his name on many scientific papers. Therefore, many researchers can be quickly connected to Erdos. For example, Natalie Portman, who co-authored a psychology paper at Harvard, has an Erdos Number of 5. (We will not rehash the path.)\n\nFew have heard of the Sabbath Number. By now, you have figured out the drill: musicians are connected to the band Black Sabbath. For example, Natalie Portman performed something called \"Natalie's Rap\" (this is real?) on the album of the comedy group The Lonely Island. Following another path we dare not to rehash, gives her a Sabbath Number of 3.\n\nAnd, wonders of the Internet: there is a website that combined the three for the all-important Erdos-Bacon-Sabbath Number! So, Natalie Portman's is 5+2+3=10, which beats Albert Einstein by a point. Other notables: Thomas Edison is a 17, Condoleeza Rice is a 13, Buzz Aldrin is an 11, Mayim Bialik is a 10, Carl Sagan is a 9. Which brings us to Ray Kurzweil.\n\nKurzweil, an inventor and futurologist, an expert on artificial intelligence and text recognition, is currently the Director of Engineering at Google. He has the lowest Erdos-Bacon-Sabbath Number on record, 8, tying him with Stephen Hawking. If you're curious how he connects to Black Sabbath, Kurzweil's voice appears on the album of an alt rock group, Our Lady Peace, that was inspired by his book.\n\nAren't you glad the Internet exists?",
  "pros": null,
  "cons": null,
  "score": 1767,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/r/ray_kurzweil.jpg",
  "created_at": "2025-03-29T13:17:07+02:00",
  "updated_at": "2025-03-29T13:17:07+02:00"
}