{
  "name": "Red Klotz",
  "url": "http://jewornotjew.com/profile.jsp?ID=1235",
  "verdict": "Jew",
  "description": "Perhaps coincidentally, two of the greatest basketball coaches were Jews nicknamed Red: Arnold Auerbach, who orchestrated Boston's unmatchable dynasty, and William Holzman, the man behind New York's two (still, only two!) titles.\n\nOn the surface, Louis \"Red\" Klotz's name clearly doesn't belong in the discussion. In fact, one can make the case that Klotz is the WORST basketball coach ever, for his team lost 15,000 games and has not won since 1971.\n\nIt didn't start out so horribly. Klotz, a 5'7\" guard, contributed to the Baltimore Bullets' championship in 1948. He then switched to the minor league Philadelphia Sphas, whose own amazing Jewish history we already profiled.\n\nKlotz took over as the Sphas' owner, and his team beat the Harlem Globetrotters (aha! You see where this is going now!) in an exhibition. Trotters owner (and fellow Jew) Abe Saperstein offered Klotz to create a foil for his barnstorming team. So the Washington Generals were born, with Klotz as owner, coach, and player.\n\nAnd while the Globetrotters trotted the globe, goofed around in front of popes and peasants, solved mysteries with Scooby-Doo, and tried to get Gilligan off that forsaken island, Klotz's Generals lost. And lost. And lost.\n\nKlotz played into his 60s, sinking the winning shot back on that fateful day in 1971. The Generals, masquerading as the New Jersey Reds, somehow veered off the script and upset the unbeatable Trotters. They haven't tasted success since.\n\nBut while Auerbach and Holzman have passed on to that coach's bench in the sky, Klotz is still going. Still coaching. Still losing. And losing.\n\nPerhaps we need to amend that opening sentence. Three of the greatest basketball coaches are Jews nicknamed Red.",
  "pros": null,
  "cons": null,
  "score": 1235,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/r/red_klotz.jpg",
  "created_at": "2025-03-29T13:16:54+02:00",
  "updated_at": "2025-03-29T13:16:54+02:00"
}