{
  "name": "Red Holzman",
  "url": "http://jewornotjew.com/profile.jsp?ID=1095",
  "verdict": "Jew",
  "description": "New York Knicks fans have been waiting for a championship for close to 40 years. Those who have won the only two titles in franchise history have become legendary: Willis Reed. Walt Frazier. Bill Bradley. And the man who brought it all together, head coach Red Holzman.\n\nBut if not for the desire to please the Jewish population of Rochester, NY, none of that would have happened.\n\nIn 1945, the NBL was a fledgling basketball league, trying to get its footing after the war. The Rochester Royals entered the league that year, and their coach, Les Harrison, decided to fill the team with various ethnicities to please the local populace. Rochester had a sizable Jewish community, so Harrison signed a Jew: Andrew Levane. Or so he thought, for Levane turned out to be Italian. Thankfully, the pseudo-Jew had a suggestion: his friend Bill \"Red\" Holzman, who just returned from the Navy. Harrison signed Holzman without ever seeing him play. Anything to please the Jews of Rochester.\n\nAnd please the Jews of Rochester Holzman did: he was named NBL Rookie of the Year and helped the Royals to a title a year later. In 1949, the Royals made their jump to the newly-formed NBA, and Holzman won another championship in 1951. (The Royals, after making a cross-country trip, are now the Sacramento Kings, still trying to revive their early glory.)\n\nHolzman would follow Levane to the Milwaukee Hawks, where his friend was now head coach. Red would take over the Hawks in 1953, coaching them for three years, as they moved to St. Louis during his tenure. (They are now in Atlanta.)\n\nThen, in 1958, Levane helped out Holzman once more. He was now the head coach of the Knicks, and offered his friend the job of a scout. Holzman, who was on his way to become an insurance salesman, accepted. Nine years later, he became the Knicks head coach, and led the team to their only two titles, in 1970 (when he was named Coach of the Year) and 1973. And Holzman even helped Levane, hiring him a scout.\n\nSo there you have it. A tale of lifelong friendship that was helped by a desire to please Rochester's Jews.\n\nHmmmm. There are many more Jews in New York City than there ever were in Rochester. Are we sure the Knicks current Italian coach, Mike D'Antoni, doesn't have a Jewish friend?",
  "pros": null,
  "cons": null,
  "score": 1095,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/r/red_holzman.jpg",
  "created_at": "2025-03-29T13:16:50+02:00",
  "updated_at": "2025-03-29T13:16:50+02:00"
}