{
  "name": "Regina Spektor",
  "url": "http://jewornotjew.com/profile.jsp?ID=875",
  "verdict": "Jew",
  "description": "In the 1970s, under some pressure from the US government, the Soviet Union started to allow its Jews to emigrate. Being the Soviet Union, they didn't make it easy for Jews to come to the US: they would only allow an Israeli exit visa, forcing the America-desiring ones to endure a many-month, trans-European journey for a chance to cross the Atlantic. It was a modern Exodus.\n\nSoviet Jews were stripped of their passports, and, with very limited belongings and a token sum of foreign currency, were to go to Austria. There they would fall into the hands of Hebrew Immigrant Aid Society. HIAS would find them shelter in what was once Vienna's cheap hotels (read: brothels) whose owners realized there is more money to be made this way than from their regular clientele.\n\nAfter three or so bureaucratic weeks in Austria, the refugees were to go to Italy, where they would stay for an indefinite length of time. With little money, these once proud Jews often ended up on the streets of Rome's suburbs, peddling Soviet watches and linen to local passerby. The Jews were to petition the American government for an entry visa. Many were accepted; some were denied, and tried, tried again, or settled on going to Israel.\n\nSo how did the American government decide what Soviet Jews were good enough to enter? Supposedly, a person's profession had a lot to do with it. So if you were an engineer, you were much more than likely to get in than if you were a taxi driver. (The fact that all those engineers couldn't find a job when they came to America and were forced to become taxi drivers was somehow lost.)\n\nAnd what of the children? Forced into the journey by their well-wishing parents, thrust through foreign countries and then ending up in America, a world away from everything they knew? We guess some ended up alright, like antifolk/alternative singer/songwriter/pianist Regina Spektor, whose family was part of the last wave of such emigration, in 1989.\n\nAnd how do we know so much about all this?\n\nWell...",
  "pros": null,
  "cons": null,
  "score": 875,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/r/regina_spektor.jpg",
  "created_at": "2025-03-29T12:53:04+02:00",
  "updated_at": "2025-03-29T12:53:04+02:00"
}