{
  "name": "Rena Sofer",
  "url": "http://jewornotjew.com/profile.jsp?ID=1182",
  "verdict": "Jew",
  "description": "Rena Sofer had her breakthrough in \"A Stranger Among Us\", won a Daytime Emmy for her role on \"General Hospital\", and has appeared on numerous TV shows, from \"Seinfeld\" to \"Melrose Place\" to \"24\" to \"Two and a Half Men\".\n\nBut we're not gonna talk about that.\n\nWe're gonna talk about \"Saved by the Bell: Hawaiian Style\". You didn't see that one coming, did you?\n\nIn short, SBTB:HS was a TV movie that saw \"the gang\" go on a trip to, obviously, Hawaii. And there, hijinks ensued! Kelly's grandfather was in danger of losing his hotel, Mr. Belding led a group of traveling principals (of course Mr. Belding had to be involved!), and Screech was found to be some kind of a Hawaiian god. We wish we didn't remember any of this. Yet...\n\nYet the most fascinating part was the budding romance between Zack and a businesswoman named Andrea, played by Sofer. Now, this movie took place after Zack's junior year in high school, making him about 17 (Mark-Paul Gosselaar was 18 at the time). While Andrea's age was not revealed, Sofer was 25... and her character had a five-year-old daughter. Yes, really.\n\nNow, we know what you are wondering: the age of consent in Hawaii is 16. So it looks like Zack and Andrea were fine as far as that is concerned. But still... a high school kid and a sizably older businesswoman, one with a five-year-old daughter? What were the writers thinking? If baffles the mind! It baffles the mind!\n\nOh, and in real life, Sofer is a daughter of an Orthodox rabbi.\n\nBut what fun is it to talk about that?",
  "pros": null,
  "cons": [
    "ent in Hawaii is 16. So it looks like Zack and Andrea were fine as far as that is concerned. But still... a high school kid and a sizably older businesswoman, one with a five"
  ],
  "score": 1182,
  "category": "Religion",
  "image_url": "http://jewornotjew.com/img/people/r/rena_sofer.jpg",
  "created_at": "2025-03-29T13:16:52+02:00",
  "updated_at": "2025-03-29T13:16:52+02:00"
}