{
  "name": "Richard Lester",
  "url": "http://jewornotjew.com/profile.jsp?ID=2146",
  "verdict": "Jew",
  "description": "Today, we're going to talk about a 40-year-old movie, and, no, despite being headlined by (Jewish) director Richard Lester, this profile is not about \"Superman 2\". We're going to talk about \"The Three Musketeers\" (the 1973 version).\n\nThis is not the first time we discussed \"The Three Musketeers\" — hell, it's not even the first time we talked about its movie adaptations, but you know what? It's our website. Come back next week when we discuss a Jewish Nobel laureate or something. Today is for spewing vitriol.\n\nNow, the vitriol is not directed at Lester per se; it's directed at Hollywood. Why the hell is \"Three Musketeers\" so hard to translate to the screen?\n\nOn paper, it should be simple. The story is not overly complex. The themes of friendship, loyalty, honor, and revenge are eternal. One for all, all for one! Making such a classic into a movie should be a piece of cake.\n\nExcept it never is. Now, to be fair, the 1973 version is actually a bit better than Hollywood's last three attempts, but it makes a number of cardinal sins (pun fully intended).\n\nStart with the actors: Charlton Heston is actually alright as the scenery-chewing Richelieu, but toothless Michael York is horribly miscast as d'Artagnan. As bad as he is, the choice for his lover, Constance, is even worse.\n\nConstance is played by Raquel Welch, who looks... well, out of place in the 17th century, to say the least. Miss Welch, for all her, ummm, assets, can't exactly act, so the filmmakers, in their infinite wisdom, decided to make her the comic foil. In fact, the first part of the movie ends with Constance tripping. Everyone laughs.\n\nAnd then (spoiler alert!) Constance dies. Now, she dies in the book as well, but... you know, considering we were supposed to laugh at her just a few minutes earlier, it's just bad, bad, bad filmmaking.\n\nWhat's even worse? Somehow, they manage to make \"The Three Musketeers\" boring. And that's the cardinal sin.",
  "pros": null,
  "cons": [
    "tance, is even worse."
  ],
  "score": 2146,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/r/richard_lester.jpg",
  "created_at": "2025-03-29T13:17:17+02:00",
  "updated_at": "2025-03-29T13:17:17+02:00"
}