{
  "name": "Richie Scheinblum",
  "url": "http://jewornotjew.com/profile.jsp?ID=3398",
  "verdict": "Jew",
  "description": "Those familiar with the works of Japanese auteur Haruki Murakami know the recurring topics in his novels: Cats. Jazz. Spaghetti. Baseball. So it shouldn't have been strange that his latest collection, \"First Person Singular\", contains a short story on the latter subject.\n\nAnd yet, it was incredibly strange. In \"The Yakult Swallows Poetry Collection\", Murakami inserted a work of non-fiction into a fiction book, detailing his lifelong fandom of the usually-terrible baseball team. Apparently, Murakami would sit at the Swallows' stadium, drink beer, watch them lose, and write poetry.\n\nOne such poem, provided in the short story, is titled... \"Outfielders' Butts\". It is an ode to, well, arses of outfielders! You can't make this up: Haruki Murakami, perhaps Japan's greatest living novelist, wrote the following (translated, of course):\n\n\nThe butt of the Hiroshima Carp's player Shane\nIs deeply thoughtful, cerebral.\nReflective, you might say.\nPeople really should have called him by his full name, Scheinblum.\nIf for nothing else, then to show respect for that one-of-a-kind butt. \n\n\nThere is A LOT to unpack here. Murakami is writing about Richie Scheinblum, who spent eight years in the majors, playing for six teams. He was an all-star with the Royals in 1972 and finished out his career with the oh-so-delightfully-named Hiroshima Carp. In Japan, he was called \"Shane\", because \"Scheinblum\" was too hard to pronounce. Oh, those tongue-twisting Jewish names! And, yeah, apparently, he had a one-of-a-kind butt.\n\nIt gets even stranger. Apparently, Murakami admitted that even though the rest of the short story is true, one key part is a work of fiction: he didn't actually write those poems back in the day. This means that 40-some years later, Murakami not only recalled Scheinblum's thoughtful, cerebral, reflective butt, but also wrote an ode about it!\n\nScheinblum passed away in May 2021, one month after Murakami's short story was published in English. One can only hope he had a chance to read it?",
  "pros": null,
  "cons": null,
  "score": 3398,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/r/richie_scheinblum.jpg",
  "created_at": "2025-03-29T13:17:50+02:00",
  "updated_at": "2025-03-29T13:17:50+02:00"
}