{
  "name": "Ricky Williams",
  "url": "http://jewornotjew.com/profile.jsp?ID=988",
  "verdict": "Not a Jew",
  "description": "When people talk about Jews they always mention the obvious stuff: Jews like food, Jews like money (oy), Jews like their mothers (sometimes). Boy, this list is not flattering, is it?\n\nRarely mentioned? How much Jews like pot. Not that we'd know about such things ourselves of course. We've never touched the stuff. Because it's illegal. And bad for you. But many Jews seem to enjoy the wacky weed and we wonder how that hasn't hit the social consciousness just yet.\n\nIn any case, perhaps this would explain the strange case of the world's most famous living pothead: Ricky Williams (narrowly edging out Woody Harrelson and Kumar in case you were curious). Ricky — former Saint, current Dolphin, former Mike Ditka life-partner (seriously, google the pic) — was quite the talent coming out of college before he decided to smoke his career away. It was on 60 Minutes and everything.\n\nAnyway, that's none of our concern. He wants to put his future in a bong and see what happens, so be it. We're pretty sure he's self-medicating anyway (his whole history just screams manic depressive disorder). More germane to this discussion however is Ricky's latest crazy obsession: Judaism.\n\nYes, Ricky's been studying Hebrew and observing Shabbat. None of this Kabbalah BS for him. We can't imagine how he decided this was his (dime) bag, but we can't help but wonder if maybe all his pot smoking has something to do with it. After all, one can't purchase or consume marijuana without running into a good many Jews in the process. We hear. Wouldn't know for ourselves cause pot's illegal, remember? And it's bad for you? Something like that.\n\nAnyhoo, chances are Ricky was hitting the ganja and hearing about how wicked cool the Judaism was and decided to sign himself up. Sure he'll have to let out those dreads into a super-cool Jewfro, but it's a small price to pay for all the spiritual fulfillment that Judaism provides.\n\nOr he'll just hit a fast food place in a week, feel better and decide that this whole Judaism thing isn't for him. \n\nWe're betting on the latter.",
  "pros": null,
  "cons": null,
  "score": 988,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/r/ricky_williams.jpg",
  "created_at": "2025-03-29T12:53:06+02:00",
  "updated_at": "2025-03-29T12:53:06+02:00"
}