{
  "name": "Rick Berman",
  "url": "http://jewornotjew.com/profile.jsp?ID=1532",
  "verdict": "Jew",
  "description": "Some of us here at JONJ, the more refined we grant you, are Yankee fans. We came of this honestly, having grown up in the area during the one era when the Mets were young, winning, and wonderful and the Yankees were... not those things. \n\nBut do you know what we hate about our beloved Bombers? Yankees fans. Is there anyone who is more of an insufferable, stuck up, self-important, jerk than a Yankee fan? Actually yes, yes there is.\n\nSome of us here at JONJ, OK all of us here at JONJ, are nerds. We may not eat everything served at the all-you-can-eat buffet of dorkiness (comics, science fiction, video games), yet we all have reservations for lunch.\n\nBut do you know what we hate about being geeks? Yeah. Other geeks.\n\nInsufferable, stuck up, self-important, exclusionary, assholes with nothing better to do than to do unto others as was done unto them. You think you've met a bully? Try taking on a Star Wars nerd. He won't take your lunch money, just whatever joy you think you might have had when watching the films. Spending time with these schmucks makes us want to give someone a wedgie.\n\nSo yeah, Rick Berman, the so-called destroyer of Star Trek. What did Berman do? Took the reins of the franchise given him by series-creator Gene Roddenberry, transformed Next Generation from syndicated schlock into actual good television (seriously, go watch the pre-Berman seasons. Holy CRAP is that bad TV), co-created Deep Space Nine, Voyager and (admittedly) Enterprise. \n\nBut, because some 2000 legitimately great episodes of television later there was no more Trek, a group of people who are perfectly content to tell you they're better than you at everything — save personal hygiene and the female anatomy — have declared that Berman's the man who \"killed\" the franchise.\n\nIt's enough to make us want to throw on a varsity jacket and start issuing out swirlies.",
  "pros": null,
  "cons": null,
  "score": 1532,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/r/rick_berman.jpg",
  "created_at": "2025-03-29T13:17:02+02:00",
  "updated_at": "2025-03-29T13:17:02+02:00"
}