{
  "name": "Rita Hayworth",
  "url": "http://jewornotjew.com/profile.jsp?ID=675",
  "verdict": "Not a Jew",
  "description": "She was tall and lithe — the kind of heights and handholds that made me want to climb to her auburn summit and take photographs like a hopped up Ansel Adams.\n\nThe rest of her might have been chiseled out of stone as well, perfect lips and nails. Cold eyes. But she moved like water. I set her as a horseback rider or a dancer. Comfortable in her skin with a look that made men kill to join her in there.\n\nShe started in without so much as a hello.\n\n\"I'm looking to do some research,\" she said. The alcohol on her breath settled in the room like last night's bad decisions — loaded with conviviality and remorse.\n\n\"Most people start in a library,\" I offered, lighting up and filling my lungs with smoky happiness.\n\n\"Good for them,\" she snapped. \"My family has some... history. I'd like to hire you to look into it.\"\n\n\"Anything I should be looking for in particular? Daddy's indiscretions? Mommy's secret cousin? Grandma Moony's lost gold?\"\n\nShe smiled, not unkindly, \"Nothing so... sordid. I just want to look into my father's family background. There are some rumors going around about his family and I'm concerned... after all, I'm a good Catholic girl.\" \n\n\"I find that hard to believe,\" I sneered.\n\n\"Thank you,\" she curtsied slightly.\n\n\"It wasn't a compliment.\"\n\n\"It doesn't have to be,\" she vamped. \"After all, a girl is... well, a girl. It's nice to be told you're successful at it.\"\n\n\"And if I find what you're looking for?\"\n\n\"Then you'll be rewarded... handsomely,\" she smiled.\n\n\"I think you'll be happier keeping your reward to yourself. All you find when you dig up trees are dead roots and dirt. Better off appreciating the branches.\"\n\n\"I think it doesn't matter what you think. We are all tied to our destiny and there is no way we can liberate ourselves.\"\n\nShe turned and walked out. The sun scattered behind a cloud as the door clicked behind her. Two hundred dollars and millions of questions were the only things she left me to go on.",
  "pros": null,
  "cons": null,
  "score": 675,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/r/rita_hayworth.jpg",
  "created_at": "2025-03-29T12:52:59+02:00",
  "updated_at": "2025-03-29T12:52:59+02:00"
}