{
  "name": "Rodrigo Lopez",
  "url": "http://jewornotjew.com/profile.jsp?ID=2082",
  "verdict": "Borderline Jew.",
  "description": "England, 1593.\n\nDr. Barber: I tell you, I don't like the looks of that new doctor!\n\nDr. Clifford: Never cared for the Portuguese.\n\nDr. Barber: He is worse than those heathens!\n\nDr. Clifford: Worse than Catholic?\n\nDr. Barber: He is a Jew!\n\nDr. Clifford: Didn't I see him in church?\n\nDr. Barber: All lies! Those people will do anything to curry favor!\n\nDr. Clifford: I knew it! No wonder he got into the queen's graces so quickly!\n\nDr. Barber: Oh, they are a crafty tribe, with their dark arts and thick books and everything.\n\nDr. Clifford: This explains it all!\n\nDr. Barber: Remember when the queen had a fever?\n\nDr. Clifford: Of course, this past winter. I prescribed leeches.\n\nDr. Barber: So did I.\n\nDr. Clifford: Everyone knows that leeches are the best cure for a fever. For anything, really: fever, gout, broken arm, memory loss...\n\nDr. Barber: Do you know what the Jew prescribed?\n\nDr. Clifford: ... tooth pain, ingrown toenail, fever... Not leeches, I assume.\n\nDr. Barber: He moistened a cloth and put it on the royal forehead!\n\nDr. Clifford: He moistened it with what? Blood of Christian babies? Those Jews!\n\nDr. Barber: Not blood. WATER.\n\nDr. Clifford: Ridiculous!\n\nDr. Barber: And he fed her soup...\n\nDr. Clifford: Made from Christian babies?\n\nDr. Barber: Made from chicken!\n\nDr. Clifford: How dare he feed her highness such filth!\n\nDr. Barber: Now, the queen did get better...\n\nDr. Clifford: That's because her majesty spent a lot of time praying for her recovery. All of England did!\n\nDr. Barber: There is that. But I think the Jew's dark charms had a lot to do with it as well...\n\nDr. Clifford: You don't say!\n\nDr. Barber: What do you expect from a Jew?\n\nDr. Clifford: Right, right, you're exactly right...\n\nDr. Barber: We need to save our queen.\n\nDr. Clifford: We must! But what can we do?\n\nDr. Barber: Well, he did try to poison the queen, didn't he?\n\nDr. Clifford: With that chicken... soup.\n\nDr. Barber: We need to let authorities know! Quick, fetch me a parchment and a quill! To whom it may concern: it has come to my attention, that the her majesty the queen's royal physician...\n\nOn June 7, 1594, Dr. Rodrigo Lopez, a marrano from Portugal, accused of attempting to poison Queen Elizabeth I, was hanged, drawn, and quartered.",
  "pros": null,
  "cons": null,
  "score": 2082,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/r/rodrigo_lopez.jpg",
  "created_at": "2025-03-29T13:17:15+02:00",
  "updated_at": "2025-03-29T13:17:15+02:00"
}