{
  "name": "Ronan Farrow",
  "url": "http://jewornotjew.com/profile.jsp?ID=2666",
  "verdict": "Borderline Jew.",
  "description": "This profile will try its best to stay out of Woody Allen's transgressions, supposed or otherwise. It will also not delve into Ronan Farrow's journalistic work, which has taken down the monster that is Harvey Weinstein, Les Moonves, and others. This profile will try to answer one simple (oh, very complex!) question: is Ronan Farrow Jewish? (Hey, isn't that the purpose of our website?)\n\nThe background: Farrow is the son of Woody Allen and Mia Farrow, the only biological offspring of the two. (Hold that thought.) Woody is obviously Jewish, Mia is obviously goyishe, so Ronan should probably fall in that \"Borderline Jew\" category that allows us to welcome potential Jews with open arms, while hedging our bets just a little.\n\nOr is he?\n\nIf Mia is to be believed, Ronan is not Woody's son at all. His real father is \"possibly\" (her words) Frank Sinatra, who was married to Mia 20 years prior to Ronan's birth. (Her words again: \"We never really split up.\") Now, Sinatra was 30 years Mia's senior, but that has nothing to do with Ronan, especially in that family. (Regardless of Woody's original relationship with Soon-Yi, she is obviously both Ronan's sister AND his stepmother. But we digress. Oh, do we digress!)\n\nAfter Mia's revelation was announced, similarities in appearance between Ronan and Sinatra were found. It was pointed out that Ronan looks nothing like Woody. Woody himself was not sure: \"I think he is [my son], but I wouldn't bet my life on it.\" Now, considering Mia is a piece of work herself, everything that comes out of her mouth should be taken with a grain of salt...\n\nSo... We'll stick with \"Borderline Jew\"?",
  "pros": null,
  "cons": [
    "idering Mia is a piece of work herself, everything that comes out of her mouth should be taken with a grain of salt..."
  ],
  "score": 2666,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/r/ronan_farrow.jpg",
  "created_at": "2025-03-29T13:17:30+02:00",
  "updated_at": "2025-03-29T13:17:30+02:00"
}