{
  "name": "Rosa Kaganovich",
  "url": "http://jewornotjew.com/profile.jsp?ID=1288",
  "verdict": "Jew",
  "description": "One of the myths perpetrated by Neo-Nazis of the Intertubes is that Joseph Stalin had three Jewish wives. It's a completely erroneous statement that nevertheless leads to an intriguing mystery.\n\nFirst of all, Stalin was only married twice: to Ekaterina Svanidze and Nadezhda Alliluyeva. Neither of the two were Jewish. Svanidze was a Georgian who married Stalin in an Orthodox church. Alliluyeva was ethnically Russian, with Georgian, Gypsy, and German roots. She was Christened at birth. So: no Jews. Shut case.\n\nBut wife number three... Wait a minute, didn't we just say he was only married twice?\n\nThe rumor started in the 1930s, after Alliluyeva's suicide (living with Stalin must have been just peachy), and didn't stop until Stalin's death in 1953. Numerous western publications sited Rosa Kaganovich as Stalin's mistress and/or third wife. And Rosa was related to one of Stalin's sidekicks, Lazar Kaganovich, Jew. So...\n\nSo it gets pretty messy. When one starts digging, it seems that the story is rather shallow. First of all, Rosa's relationship to Lazar varies based on the source: she is either his sister, niece, daughter, or even wife. Her age changes as well, ranging from someone older than Stalin to that of a teenager. There is absolutely no record that someone with that name existed. The Kaganovich family sternly denies it as well.\n\nIt all looks like rumor-mongering that started in the 30s and continues to this day. One thing we're disappointed about, however: according to one of the rumors, Rosa poisoned Stalin to his death.\n\nA Jew responsible for killing one of history's worst monsters? If only that myth was real...",
  "pros": null,
  "cons": null,
  "score": 1288,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/r/rosa_kaganovich.jpg",
  "created_at": "2025-03-29T13:16:55+02:00",
  "updated_at": "2025-03-29T13:16:55+02:00"
}