{
  "name": "Rosalind Franklin",
  "url": "http://jewornotjew.com/profile.jsp?ID=1081",
  "verdict": "Jew",
  "description": "1962, Possible Heaven. Peter and Moses are huddled over a small black-and-white television set, watching the Nobel Prize announcements.\n\nTelevision: And the Nobel Prize in Physics goes to, for his pioneering theories for condensed matter...\n\nPeter: Yes! I got this one!\n\nTelevision: Lev Landau!\n\nPeter: Another point for me! Who do you got, chief?\n\nMoses: Landau. Jew, by the way.\n\nPeter: Rats. We're even again.\n\nTelevision: And the Nobel Prize in Literature goes to...\n\nPeter: Oh, there's no way you're getting this one, chief.\n\nTelevision: John Steinbeck!\n\nPeter: Score! He was due for years!\n\nMoses: Score one for me as well.\n\nPeter: No!\n\nMoses: Yes. And Steinbeck still puts me to sleep, Nobel or no Nobel.\n\nPeter: Damnation! 60 years we've been doing these pools, and you keep on winning!\n\nMoses: I told you, Pete, leave gambling to professionals.\n\nPeter: Well, it's not over yet, we've still got Medicine this year. And I tell you, ever since they started sharing the prize, this has gotten easier!\n\nMoses: If you say so.\n\nTelevision: And the Nobel Prize in Physiology or Medicine goes to, for their discoveries concerning the molecular structure of nucleic acids...\n\nPeter: Yes, yes, yes!\n\nTelevision: Francis Crick, James Watson, and Maurice Wilkins!\n\nPeter: What?\n\nMoses: Crick, Watson, and Wilkins. I got Crick. Whom do you have?\n\nPeter: Rosalind Franklin...\n\nMoses: Oooh. Tough one.\n\nPeter: But Rosalind Franklin was essential in the discovery of DNA. This is sexism! Antisemitism!\n\nMoses: Pete, Rosalind has been dead for four years. Ovarian cancer. They don't give Nobels to dead people.\n\nPeter: But... but... I would have seen her at the gates!\n\nMoses: Must have missed her, old chap.\n\nPeter: Don't tell me Judas was subbing for me that day!\n\nMoses: Might have been, might have been...\n\nPeter: Oh, that's not fair. You paid him off not to tell me she was dead, didn't you?\n\nMoses: I'm not saying I did, but if he voluntarily withheld information...\n\nPeter: You did, you did pay him off!\n\nMoses: Ha! Worth every penny!\n\nPeter: Oh come on, chief, that's just not fair...\n\nMoses: Life... err... death is not fair, old chap. Now pay up. Double or nothing next year?\n\nPeter: As always.",
  "pros": null,
  "cons": null,
  "score": 1081,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/r/rosalind_franklin.jpg",
  "created_at": "2025-03-29T13:16:50+02:00",
  "updated_at": "2025-03-29T13:16:50+02:00"
}