{
  "name": "Sabbatai Zevi",
  "url": "http://jewornotjew.com/profile.jsp?ID=1332",
  "verdict": "Borderline Jew.",
  "description": "How ya all doin', goyim?\n\nWhat have you been up to? Sitting around, twiddling your thumbs, waiting for the messiah to come? Thought so. Might as well put on a pot of coffee. It's gonna be a while.\n\nLet us tell you, goyim, the story of Sabbatai Zevi. Not exactly a household name like your Jesus, but perhaps he should be?\n\nYou, goyim, are waiting for your second messiah. We're still on our first! But in the 17th century, a bunch of us though we found one! Yes, his name was Sabbatai Zevi. You're quicker than we thought, goyim.\n\nAs a young man in Smyrna, Sabbatai didn't want to study Jewish law. Instead, he was drawn to Kabbalah. And one of Kabbalah's numerous numerical calculations claimed that 1648 was the year that the Jewish messiah will come. So, when the year hit, Sabbatai thought... why not me?\n\nSo he got himself some followers and started preaching. Sound familiar, goyim? The rabbis in Smyrna would have none of that and kicked him out. So he spent a few years wandering around the Mediterranean, eventually making his way to Jerusalem. His popularity grew and spread itself to Europe. Even some rabbis jumped on board. Many Jews decided to make the pilgrimage to the Holy Land.\n\nAnd then the year 1666 came. You, goyim, had always seen it as apocalyptic, so many thought that yes, it will finally happen! So Sabbatai made his way to Constantinople, where he was expected to be crowned king of all, Jew and goy...\n\nExcept when he got there, the sultan arrested him. But that only empowered Sabbatai's followers. Synagogues were inscribed with the phrase \"Bless our Lord and King, the holy and righteous Sabbatai Zevi, the Messiah of the God of Jacob\". His messiahship was at fever pitch.\n\nAnd then, Sabbatai converted to Islam.\n\nYep.\n\nThere is more to the story: exile, mysterious death, and many, many disillusioned followers.\n\nThey would have been better served twiddling their thumbs.",
  "pros": null,
  "cons": null,
  "score": 1332,
  "category": "Religion",
  "image_url": "http://jewornotjew.com/img/people/s/sabbatai_zevi.jpg",
  "created_at": "2025-03-29T13:16:57+02:00",
  "updated_at": "2025-03-29T13:16:57+02:00"
}