{
  "name": "Sada Jacobson",
  "url": "http://jewornotjew.com/profile.jsp?ID=3531",
  "verdict": "Jew",
  "description": "Beware: this might be the most \"inside baseball\" profile in JONJ history. Or should we say \"inside fencing\"?\n\nWhen we wrote about fencers Jackie Dubrovich and Maia Weintraub during our recent Olympic binge, we remembered that they were not the first American female fencers we had profiled. Sada Jacobson, who won three medals: one in Athens and two in Beijing, graced our website. Notice we said \"graced\". If you search for Sada (prior to today, natch), she would not be there.\n\nOn rare occasions, we removed profiles from this website before. There was one case of a child actor whose handlers complained that he didn't want people to know he is Jewish... even though his bar mitzvah was in the press. But this was not the case here! What happened to Sada's profile?\n\nSo we entered the depths of the Internet Archive. We knew that if we profiled Sada, it would have been around the 2008 Olympics. And there you have it! August 28, 2008, between Gina Gershon and Jason Biggs, there is Sada Jacobson! Profile #309!\n\n\n\n\n\nExcept... if you look at profiles from 2008 now, or go to #309 directly, it's not Sada at all. It's Jeno Fuchs. Huh?\n\nJeno Fuchs was, naturally, also a fencer. We think what happened here is that a profile that was originally dedicated to Jacobson (it really talks about our love of \"The Three Musketeers\" and then takes a turn to Olympic fencing) was re-written to feature Fuchs. Why? Well, Fuchs just might be the greatest Jewish fencer ever (four Olympic golds), while Sada had a silver and two bronzes. Also, Fuchs' name is much funner to say.\n\nBut that's not fair to Sada! G-d knows we've profiled athletes much less successful than her! Sada is a member of the US Fencing Hall of Fame, the International Jewish Hall of Fame, a two-time World Champion, and let's not forget, a two-time Jewish Scholastic Athlete of the Year!\n\nHere is your profile, Sada. #3531. We'll even give you an extra point from that original score. Sorry you had to wait.\n\nv = 8;\nfunction flip() {\n  if (v == 8) v = 9; else v = 8; \n  document.getElementById(\"sj\").src = \"img/other/sj200\"+v+\".gif\";\n}",
  "pros": null,
  "cons": null,
  "score": 3531,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/s/sada_jacobson.jpg",
  "created_at": "2025-03-29T13:17:53+02:00",
  "updated_at": "2025-03-29T13:17:53+02:00"
}