{
  "name": "Saint George",
  "url": "http://jewornotjew.com/profile.jsp?ID=2988",
  "verdict": "Not a Jew",
  "description": "\"Forgive me, father, for I have sinned. It's been two weeks since my last confession.\"\n\n\"George? Is that you?\"\n\n\"Err... isn't this supposed to be anonymous?\"\n\n\"Well, yeah, but it's you! George! Everyone knows the great hero!...\"\n\n\"About that...\"\n\n\"Slayer of the dragon! Rescuer of the princess!\"\n\n\"As I was saying...\"\n\n\"The bravest man in all the land!\"\n\n\"Father! I have sinned!\"\n\n\"You? George?\"\n\n\"Yes, father. My sin is... vanity.\"\n\n\"Vanity? That's not one of the seven!\"\n\n\"And yet, it troubles me to no end. You see, the dragon...\"\n\n\"Oh, the dragon, the great beast that had tortured our land for decades!\"\n\n\"There was no dragon.\"\n\n\"Oh?\"\n\n\"In fact, there are no such things as dragons. They are made up.\"\n\n\"Oh, I'm pretty sure there are dragons!\"\n\n\"No, father. Dragons are make-believe creatures, mostly based on crocodiles.\"\n\n\"Oh, I've heard of such savages! Deep in the deserts of Nubia, they bite each passerby in half! So you have slayed such a crocodile?\"\n\n\"It wasn't exactly a crocodile.\"\n\n\"Then a snake? A gangly, poisonous, deadly viper?\"\n\n\"Not a snake.\"\n\n\"Then tell me, George! What did you slay?\"\n\n\"A gecko.\"\n\n\"A what?\"\n\n\"A gecko. It's a small lizard.\"\n\n\"A small lizard? I don't understand!? The tales of the dragon are as old as time! He comes to our town, he eats one virgin a year!\"\n\n\"Lies. All lies. Started at this very church.\"\n\n\"What are you implying, George?\"\n\n\"Oh, nothing, father. But let's just say that our religion goes to great lengths to keep its people in check.\"\n\n\"You're absolved.\"\n\n\"What?\"\n\n\"Your sin, vanity, you're all good. Say five Hail Marys or something.\"\n\n\"That's it?\"\n\n\"Yeah, that's it, now go already! Saint George the Gecko Slayer! Well I'll be...\"",
  "pros": null,
  "cons": null,
  "score": 2988,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/s/saint_george.jpg",
  "created_at": "2025-03-29T13:17:39+02:00",
  "updated_at": "2025-03-29T13:17:39+02:00"
}