{
  "name": "Samm Levine",
  "url": "http://jewornotjew.com/profile.jsp?ID=1047",
  "verdict": "Jew",
  "description": "For years, we were told that we should watch \"Freaks and Geeks\", the short-lived, much-beloved television series about outsiders in high school. For years, we resisted. We went through this in real life, why do we have to watch it on TV?\n\nOh, how wrong we were.\n\nFor we finally watched the 18 (oh, why only 18?) episodes. We cringed, we cried, we put our hands in front of our face to obscure the television, we laughed. We remembered our high school years. We laughed. And then we cringed some more.\n\nBut let's talk about the Jews. Oh, there were some Jews.\n\nThe show was created by Paul Feig (Half a Jew) and executive produced by not-yet-very-known Judd Apatow (AHA!). And the amazing (and very Jewy) cast, plucked out of teenage obscurity, helped made \"Freaks and Geeks\" such an amazing character study.\n\nWhat's strange is the Jew/goyim divide between actors. You would expect the geeks to be Jewish, but the three main freaks were played, in some of their first roles, by James Franco, Jason Segel, Seth Rogen: Jew, Jew, Jew. All three went on to great things, many under Apatow's watch.\n\nThe geeks were played by the lesser successful John Francis Daley (Half a Jew), Martin Starr (Not a Jew), and Samm Levine. The latter is not only Jewish in real life, but was one on the show as well, playing the Caddyshack-quoting, Shatner-improvising, cheerleader-obsessing Neal Schweiber. Our favorite character, obviously.\n\n(Our favorite male character, that is. For how can you not fall in love with Linda Cardellini (Not a Jew) as Lindsay Weir? Wait, is the wife gonna read this? Better remove this paragraph before publishing.)\n\nLevine's greatest claim to fame after \"Freaks and Geeks\" was playing one of the lesser Inglourious Basterds. And, normally, we would get all snarky about peaking before puberty... But this time we can't.\n\nFor Levine peaked on \"Freaks and Geeks\".",
  "pros": null,
  "cons": null,
  "score": 1047,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/s/samm_levine.jpg",
  "created_at": "2025-03-29T13:16:49+02:00",
  "updated_at": "2025-03-29T13:16:49+02:00"
}