{
  "name": "Samuil Marshak",
  "url": "http://jewornotjew.com/profile.jsp?ID=807",
  "verdict": "Jew",
  "description": "On a snowy Moscow night, Politburo member Petr Petrovich Sidorov was woken by a ringing doorbell. He looked at the alarm clock; the hour hand just crept below the 3.\n\nSidorov slid into his slippers and draped a bathrobe over his shoulders. The doorbell rang again.\n\n\"Who on Earth could it be,\" Sidorov mumbled, opening the peephole.\n\nThe man staring it him from the other side of the door was Sidorov's young protege, Ivan Ivanovich Rubashkin. Sidorov sighed and opened the door.\n\n\"It's late, comrade,\" Sidorov said.\n\n\"I am sorry, Petr Petrovich! I just couldn't sleep! I need to talk to you!\"\n\nSidorov gestured into the living room. Rubashkin ignored the doormat. Sidorov sighed again as a trail of snowy steps emerged on the floor.\n\n\"Cognac?\", he asked.\n\n\"I don't drink, Petr Petrovich.\"\n\nSidorov nodded, and took out a bottle and two glasses from the cabinet. He filled them both and left one standing on the coffee table.\n\n\"Well, comrade?\"\n\n\"I couldn't sleep, Petr Petrovich!\"\n\n\"I heard that already, comrade.\"\n\n\"It's about tomorrow's report.\"\n\n\"What about it, comrade Rubashkin?\"\n\n\"Well, it's my first time talking in front of the Politburo. And... well...\"\n\n\"Get to the point, comrade.\"\n\n\"The report is on the influence of Jews in Soviet children's literature.\"\n\n\"I am aware of that, comrade. Need I remind you that we discussed it at length during the past month?\"\n\n\"No, Petr Petrovich, you don't! It's just... well...\"\n\n\"Comrade Rubashkin, if you don't get to the point, I will ask you to leave.\"\n\nRubashkin reached for the coffee table, took the glass, and emptied it in one gulp.\n\n\"They are ALL Jews, Petr Petrovich!\"\n\n\"Who are all... Jews, comrade?\"\n\n\"The children's writers! All the good ones, at least! Agniya Barto, Boris Zakhoder, Genrikh Sapgir, Lazar Lagin! And worst of all... Samuil Marshak! And to think, my mother used to read his stories to me every night! Beautiful, wonderful stories! My mother, Petr Petrovich!\"\n\n\"Calm down, comrade Rubashkin.\"\n\n\"But Petr Petrovich! Tomorrow I have to go in front of the Politburo and... expose Marshak as a Jew!\"\n\n\"We KNOW he is a Jew, comrade.\"\n\n\"You... do?\"\n\n\"Of course, we do. Who but a Jew to be named Samuil, after all. He even wrote for a Jewish magazine before the Revolution.\"\n\n\"He... did?\"\n\nSidorov poured another glassful into Rubashkin's shaking hand.\n\n\"You see, comrade Rubashkin, sometimes you have to accept the Jews.\"\n\n\"But... but...\"\n\n\"Accept the Jews, comrade Rubashkin. And then make sure that years of thorough Soviet ideology — at home, at school, at work — will erase whatever imprint Marshak and his ilk made at a young age. Do you understand?\"\n\n\"I... I understand, Petr Petrovich.\"\n\nRubashkin gulped down the glass.\n\n\"Is that all, comrade?\", Sidorov asked.\n\n\"Yes, Petr Petrovich. Thank you. Thank you. I'll show myself out.\"\n\nRubashkin got up from the sofa and extended his hand to Sidorov.\n\n\"They really are wonderful stories, Petr Petrovich, aren't they?\"\n\n\"Yes they are, comrade Rubashkin. Yes they are.\"",
  "pros": null,
  "cons": null,
  "score": 807,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/s/samuil_marshak.jpg",
  "created_at": "2025-03-29T12:53:02+02:00",
  "updated_at": "2025-03-29T12:53:02+02:00"
}