{
  "name": "Samuel Byck",
  "url": "http://jewornotjew.com/profile.jsp?ID=1588",
  "verdict": "Sadly, a Jew.",
  "description": "So... Samuel Byck... completely insane. But... maybe not totally unrelatable?\n\nByck was born 100% Jewish, served in the army, got married, had kids, perfectly normal dude. Then his wife divorced him, his business went bad, and he began to show signs of clinical depression (and maybe a little schizophrenia? kinda hard to mentally diagnose when 1. all you have to go on is a Wikipedia entry and 2. you have absolutely no clinical training). Anyway, you go through all that, see how mentally stable you come out.\n\nThen, in 1972, Byck latched on to the idea that the federal government was trying to oppress the poor. At the time, ok, a little out of left field. Nowadays? When a billionaire's housekeeper pays a greater percentage of his/her salary to the government than the billionaire? That dude was fricking prescient. Byck began sending tape recordings to President Nixon (yup), Senator Ribicoff of Connecticut (makes sense), Jonas Salk (ok....), and Leonard Bernstein (wait, what?!)\n\nIn 1974, Byck decided the only way to solve his problems (his campaign by audio tape was, shocker, not so successful) was to assassinate Nixon. Which, in 1974, heck everyone wanted in on that. His plan was a little off though...\n\nRather than shoot the soon-to-be-ex president like a normal psychopath, Byck had to get all clever and try to crash a passenger jet into the White House on a day when he knew Nixon would be home. Neither his plan, nor the plane, ever really got off the ground. Byck managed to shoot a few folks and gain control of the cockpit, but he couldn't actually fly the thing, or even get it moving a little and in the end he shot himself after federal agents had stormed the plane.\n\nSo, yeah, look... we're not saying we're planning on doing anything rash in the near future or anything. But things go really really bad, we have a break with reality, stuff happens... It's not completely out of the realm, right?\n\nThen we found out Byck dressed as in a Santa suit to protest in front of the White House. And that's just, like... come on man, have a little self respect, would ya?",
  "pros": null,
  "cons": null,
  "score": 1588,
  "category": "Politics",
  "image_url": "http://jewornotjew.com/img/people/s/samuel_byck.jpg",
  "created_at": "2025-03-29T13:17:03+02:00",
  "updated_at": "2025-03-29T13:17:03+02:00"
}