{
  "name": "Santa Claus",
  "url": "http://jewornotjew.com/profile.jsp?ID=960",
  "verdict": "Not a Jew",
  "description": "\"Jesus H. Christ!\"\n\n\"Hello, Claus. May I come in?\"\n\nJesus placed his hat on the kitchen table.\n\n\"Mr. Christ! What do we owe the pleasure?...\", shrieked Mrs. Claus, dropping her ladle.\n\n\"Linda, could you excuse us for a moment?\"\n\n\"Yes, sir.\" Mrs. Claus made her way over to her husband, removed a couple of crumbs from his coat jacket, and kissed him on the forehead. \"It will be OK,\" she whispered before heading out of the kitchen.\n\nJesus sat down at the table.\n\n\"What are you having?\", he asked.\n\n\"Po... potato pancakes,\" stuttered Claus. \"Would...\"\n\nJesus took a large stack from the center of the table and put it on a plate closest to him.\n\n\"Sour cream?\", asked Claus. \"Say when.\"\n\nJesus waited until the contents of the entire jar were plopped on his plate.\n\n\"An interesting take,\" he said, loudly chewing.\n\n\"Yes... Linda is trying to perfect her recipe.\"\n\n\"Pork?\"\n\n\"Yes, she stuffs them with ground pork. A little onion...\"\n\n\"Yes, an interesting take.\"\n\nJesus pushed away the half-finished plate.\n\n\"Alright, Claus, I think we both know why I am here.\"\n\n\"Actually, Mr. Christ...\"\n\n\"I've been going over your naughty and nice lists.\"\n\n\"Oh.\"\n\n\"Here's something that's confusing me.\"\n\nFrom his coat pocket, Jesus took a folded sheet of paper. He then took out a pair of glasses and carefully perched them at the end of his nose. Claus patiently waited as Jesus unfolded the paper.\n\n\"Samuel Abrahams,\" Jesus said, pointing to a name near the top of the list. \"That doesn't sound too Christian, does it, Claus?\"\n\n\"Well, Mr. Christ...\"\n\n\"Miriam Blume? Eli Cantor?\"\n\n\"Cantor's mother is Methodist, Mr. Christ.\"\n\n\"Alright, scratch Cantor. But these, look at all these names! What's going on, Claus?\"\n\n\"Well...\", Claus' gaze shifted from Jesus' face and landed somewhere at the tip of his shoes.\n\n\"I'm waiting, Claus.\"\n\n\"Would you read one of these letters, Mr. Christ?\"\n\nClaus ran into his office and brought out a file folder bursting with papers. Jesus pulled out a sheet.\n\n\"Dear Santa,\" he read. \"My name is Judy Duberstein. My parents said I am not supposed to write to you, but I just had to! Last year was the worst Hanukkah ever. All I got was some chocolate coins and seven pairs of tube socks. I am so jealous of Emma and Emily! They got so many presents for Christmas! Could you please, please, please, just bring me a Barbie. Just one. The fashion fairy tale one. Thank you, Santa. Love, Judy Duberstein.\"\n\n\"Are they all like this one?\", asked Jesus.\n\n\"Most of them,\" replied Claus.\n\nJesus let out a long sigh.\n\n\"We went over this, Claus. No Jews.\"\n\n\"But... Mr. Christ...\"\n\n\"Do I have to repeat myself, Claus? No. Jews.\"\n\n\"Mr...\"\n\n\"Remember, Claus, yours is a non-union job. I can get you replaced,\" Jesus snapped his fingers, \"just like that. There's a guy working the Short Hills Mall in Jersey that I think will do just fine.\"\n\n\"Mr. Christ, you wouldn't...\"\n\n\"Try me, Claus. Try me.\"\n\nClaus slopped down on his chair.\n\n\"Alright, Mr. Christ. No Jews.\"\n\n\"Attaboy.\"\n\nJesus got up and slapped Claus on the shoulder.\n\n\"See you in the office, old chap. Oh, and tell the wife, the latkes — I'd cut out the pork.\"\n\nAs Jesus slammed the front door, Linda caressed the sobbing Claus in her arms.",
  "pros": null,
  "cons": null,
  "score": 960,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/s/santa_claus.jpg",
  "created_at": "2025-03-29T12:53:06+02:00",
  "updated_at": "2025-03-29T12:53:06+02:00"
}