{
  "name": "Sarah Snook",
  "url": "http://jewornotjew.com/profile.jsp?ID=2889",
  "verdict": "Not a Jew",
  "description": "You're expecting us to comment on \"An American Pickle\". Well, here we are, commenting on \"An American Pickle\", even though we obviously can't have Seth Rogen headline it. (He was profiled a bar mitzvah ago!) We pretty much have no choice but to go with Sarah Snook, who has a small but pivotal role in the movie, and who is not Jewish in real life. (For those who want to ask, is it OK for goyim to play Jews (and vice versa), for the 100th time, YES!)\n\nFor those who spent the last century pickled in brine, \"An American Pickle\" stars Rogen as a Jew who spent the last century pickled in brine. It also stars Rogen as his modern-day great-grandson, who is obviously not as pious as his ancestor. Cultures clash! Jokes are made! Cucumbers are pickled! The reviews have been all over the map. We enjoyed it.\n\nYes, the movie is not without its faults. Its tendency to yadda-yadda over glaring plot holes can be remedied by its rather lean running time. (Seriously, it's a comedy! Who cares about plot holes?) It does bother us a bit that the pickled Rogen adapts to the modern world way too easily. (We bet there were a lot of jokes left on the cutting room floor.) That being said, the movie touched that area of cultural Judaism that we revel in ourselves, and a few jokes are simply outstanding. (We hope modern Rogen used our website to look up Jonas Salk.)\n\nMost importantly, \"An American Pickle\" automatically becomes the Jewiest modern comedy. (We're not talking Jew-adjacent, which is pretty much the entire Judd Apatow ouvre, but one where Jewishness is front and center.) What were the options before... \"Jewtopia\"? \"The Hebrew Hammer\"?\n\nHooray for \"An American Pickle\"!",
  "pros": null,
  "cons": null,
  "score": 2889,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/s/sarah_snook.jpg",
  "created_at": "2025-03-29T13:17:36+02:00",
  "updated_at": "2025-03-29T13:17:36+02:00"
}