{
  "name": "Sarah Palin",
  "url": "http://jewornotjew.com/profile.jsp?ID=364",
  "verdict": "Not a Jew",
  "description": "We give up, Internet. You win.\n\nWe're going to profile Sarah Palin.\n\nOh, it was such a joke at JONJ Headquarters; ever since John McCain put Sarah on the ticket and she started to appear in our searches, we laughed. Sarah Palin. Jewish? Why would anyone ever think so? The woman screams of her Christian values every chance she gets.\n\nWe should have known better.\n\nWith Palin's rise to prominence, every possible rumor has arisen. Sarah Palin is a lesbian? Check. Sarah Palin is a Nazi? Check. Sarah Palin is a communist? Check. Sarah Palin is a Satan worshiper? Check. Sarah Palin is a werewolf? We haven't heard that one... yet.\n\nBut one that we have heard, and are hearing louder and louder, is that Sarah Palin is, yes, Jewish. Supposedly her grandparents were Lithuanian Jews, Schmuel and Louise, who had their name changed on Ellis Island, from the oh-so-Jewish Sheigman to the oh-so-goyishe Sheeran.\n\nNow, you can believe that. You can even ignore the fact that no Sheigan or Sheeran came through Ellis Island during the supposed year of Sarah's grandparents' immigration. Godspeed.\n\nOr you can believe actual research, that traces Palins's roots all the way back to the 1700s. That actual research will tell you that Sarah's grandparents were not Schmuel and Louise, but Clement and Helen, and were not from Lithuania, but from Washington state. And their parents came from Minnesota and Wisconsin. They probably never saw a real Jew in their life.\n\nThere, Internet. You got your Sarah Palin profile. Satisfied? What's your next absurd Jewish rumor? George W. Bush?\n\nLet's not even joke about that one, OK?",
  "pros": null,
  "cons": [
    "in. They probably never saw a real Jew in their life."
  ],
  "score": 364,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/s/sarah_palin.jpg",
  "created_at": "2025-03-29T12:52:51+02:00",
  "updated_at": "2025-03-29T12:52:51+02:00"
}