{
  "name": "Sasha Mitchell",
  "url": "http://jewornotjew.com/profile.jsp?ID=1068",
  "verdict": "Jew",
  "description": "\"My goal is to become the first Jewish president.\" — Sasha Mitchell, 1988\n\nWe don't know where Sasha Mitchell is now, but we do know how he spent his 1990s. First he replaced Jean-Claude Van Damme as the face of the \"Kickboxer\" franchise, and then he appeared on TV's \"Step by Step\"... but let's delve in.\n\nThe original \"Kickboxer\" came out in 1989. Van Damme goes to Thailand, Van Damme kicks ass, etc. (Not to be confused with \"Bloodsport\", where Van Damme goes to Hong Kong, kicks ass, etc.) The movie made 10 times its budget domestically, plus tons more oversees, so a sequel just had to be made. But Van Damme passed. So what are the filmmakers to do?\n\nKill off Jean-Claude (or someone who remotely looks like him) in the opening scene, and hand off the franchise to his character's previously non-existent brother, played by Sasha Mitchell. And let Sasha kick through \"Kickboxer 2: The Road Back\", \"3: The Art of War\", and \"4: The Aggressor\". He didn't make it to \"5: The Redemption\", as it was his turn to be killed off in the opening scene. There was no \"6\". Alas, there was no \"6\"...\n\nNow, we don't know why Sasha turned down \"5\", for there is a certain charm in cheesy martial arts sequels. By then, he was a regular on \"Step by Step\", a sitcom that was part of ABC's TGIF block, together with \"Family Matters\" and \"Full House\" (is this where we admit we watched \"Full House\"? Never!)\n\n\"Step by Step\" dealt with a newly-married couple that brought six children together: three of his and three of hers (not to be confused with \"The Brady Bunch\", for this was set in 1990s Wisconsin, not 1970s California). You can rest assured that the two sets of step-children (Get it? \"Step by Step\"-children?!) started off hating each other, but, as the series ran, learned to become a loving family.\n\nSasha played Cody, the nephew of the family's father, who lived in a van in the driveway (does that mean everyone else had to park on the street?). Cody knew karate (of course), had a couple of catch phrases (\"Dude!\" \"No way!\"), and, beneath the tough exterior, had moments of wisdom and a good heart. Oh, cheesy, cheesy sitcoms...\n\nSadly for Sasha, his aspirations for a steady acting career were dampened in the mid 1990s, when he was accused of domestic violence. He was later acquitted of the charges, but it was too late. He was written off \"Step by Step\", and on the big screen? Well, he played \"Angry Driver\" in \"Dickie Roberts: Former Child Star\". So no, not exactly \"Kickboxer 6\".\n\nWell, there's still time to get into politics, isn't there?",
  "pros": null,
  "cons": null,
  "score": 1068,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/s/sasha_mitchell.jpg",
  "created_at": "2025-03-29T13:16:49+02:00",
  "updated_at": "2025-03-29T13:16:49+02:00"
}