{
  "name": "Saul Alinsky",
  "url": "http://jewornotjew.com/profile.jsp?ID=1305",
  "verdict": "Jew",
  "description": "Beelzebub: You rang, your lordship?\n\nSatan: Yes, Bub. There is some trouble being reported in Sector NRH-6270.\n\nBeelzebub: Sure thing, boss. Let me just fire up the Hell Maps app on my iPad... Yes... there are some agitators. Again.\n\nSatan: Again?\n\nBeelzebub: Yes, your lordship. It's that Alinsky fellow raising the damned.\n\nSatan: Alinsky, Alinsky... Why does that sound familiar?\n\nBeelzebub: When he was alive, he pretty much created community organizing.\n\nSatan: Oh yes, now I remember. Hillary wrote her thesis on him, didn't she?\n\nBeelzebub: Yes, boss! I'm astonished with your recollection!\n\nSatan: She and I exchange emails from time to time. But why is that Alinsky here? In life, he was a good Jew.\n\nBeelzebub: Well, he gave that interview to Playboy in 1972...\n\nSatan: Playboy?\n\nBeelzebub: It's a magazine...\n\nSatan: I KNOW WHAT PLAYBOY IS! I never actually read the articles.\n\nBeelzebub: Well, in the March 1972 issue...\n\nSatan: Ah... Ellen Michaels.\n\nBeelzebub: Yes, she was the centerfold... Quite lovely, if I might add. Anyway, Alinsky said, \"if there is an afterlife, and I have anything to say about it, I will unreservedly choose to go to hell.\"\n\nSatan: So he chose to come here...\n\nBeelzebub: \"Hell would be heaven for me,\" he said. \"All my life I've been with the have-nots. If you're a have-not in hell, you're short of virtue. Once I get into hell, I'll start organizing the have-nots over there. They're my kind of people.\"\n\nSatan: Well, I'll be damned!\n\nBeelzebub: So what do we do, your lordship?\n\nSatan: Call upstairs and offer them a trade. We'll give them Alinsky...\n\nBeelzebub: I can do that, boss, but you'll know they'll offer Gallagher in return again.\n\nSatan: Good point, Bub. Cancel the call. Agitators we might find a way to deal with. But Gallagher here? That will be the death of me.",
  "pros": null,
  "cons": null,
  "score": 1305,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/s/saul_alinsky.jpg",
  "created_at": "2025-03-29T13:16:55+02:00",
  "updated_at": "2025-03-29T13:16:55+02:00"
}