{
  "name": "Schlitzie",
  "url": "http://jewornotjew.com/profile.jsp?ID=834",
  "verdict": "Not a Jew",
  "description": "Being young'ns (at least in the eyes of a certain set, to others we're decidedly, ummm, old'ns?), we've often been subjected to long lectures on \"the good old days.\"  Which is basically the older generation's way of telling us that no matter what we do or have, it will never be as good as what they had or did.\n\nAh, the good old days... a time when a young man such as Schlitzie Surtees (or was it Simon Metz?) born with microcephaly (a developmental disorder that left him with an unusually small brain and skull) could be sold to the circus as a child.\n\nYes, that simpler, better, time when a man with the intelligence of a three year old child (and the vocabulary to match) was paraded around the country as a \"pinhead\" or \"the last of the Aztecs\" (y'know, because picking on the disabled wasn't bad enough, lets get the Native Americans in there, too) and forced to dress as a little girl for the entertainment and wonder of our \"greatest generation.\"\n\nNow, Schlitzie would probably be just another of the many poor souls forgotten to history if he hadn't appeared in one of the earliest groundbreaking films, \"Freaks.\" The title says it all, really. So now Schlitzie is something of a lost cult celebrity. People spend quite a bit of time obsessing over him. What was his real name? Who were his parents? Was Schlitzie Jewish? (Answer Key: Who knows. Who cares. He may have been born that way but there's no way to know and he was buried under a cross so it hardly seems relevant in any case.)\n\nThe days when a human being was treated as no better than an animal because he was different?  Thank G-d those \"good old days\" are as good as gone.",
  "pros": null,
  "cons": null,
  "score": 834,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/s/schlitzie.jpg",
  "created_at": "2025-03-29T12:53:03+02:00",
  "updated_at": "2025-03-29T12:53:03+02:00"
}