{
  "name": "Sean Kanan",
  "url": "http://jewornotjew.com/profile.jsp?ID=856",
  "verdict": "Jew",
  "description": "We'll never forget the summer of 1990.\n\nNo, not because of that year's World Cup, or Iraq invading Kuwait, or George Bush's \"no new taxes\" pledge. We'll never forget the summer of 1990 because of \"Karate Kid 3\".\n\nNow, an astute reader might know that \"Karate Kid 3\" was released in 1989. But we saw it a year later. For 1990 was our last summer spent in Jewish summer camp.\n\nOh, Jewish summer camp! Who can forget dozens of nonathletic kids attempting to kick the ball around? Who can forget our camp play, a Jewish version of \"Alice in Wonderland\"? (Don't ask.) Who can forget \"Karate Kid 3\"?\n\nFor one night, the counselors had a special treat for us. They brought out a video tape, and there it was, in all its glory, dozens of bar-mitzvah-age boys staring at the holy grail: \"Karate Kid 3\".\n\nThe third installment of the series took Daniel-san and Mr. Miyagi back to California. There, the two took on the EVIL businessman and his protege, culminating with Daniel-san beating the protege to win the karate tournament. It was AWESOME.\n\nWe were twelve years old.\n\nWe will never back down from the greatness of the first movie. We have a soft spot for the sequel. The third... where do we begin?\n\nOh, it's terrible. Our twelve-year-old eyes were immune to it then, but after re-watching the film, it's hard not to turn away in disgust. Daniel-san, who is supposed to be in his teens, is pushing 30 in real life. The new girlfriend, a pale substitute for Elisabeth Shue, is about as interesting as a rock. The relationship between Mr. Miyagi and Daniel-san is downright creepy. The amount of karate is minimal. And the plot... only a twelve-year-old would not be able to poke holes in it.\n\nBut we were twelve in 1990. So that entire army of Jewish boys stood up and cheered when Daniel-san beat the crap out of that stupid protege, Mike Barnes (played by the Jewish Sean Kanan). We high-fived each other and went to bed happy, an awesome ending to a day of camp.\n\nIt's great to be twelve, isn't it?",
  "pros": null,
  "cons": null,
  "score": 856,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/s/sean_kanan.jpg",
  "created_at": "2025-03-29T12:53:03+02:00",
  "updated_at": "2025-03-29T12:53:03+02:00"
}