{
  "name": "Semei Kakungulu",
  "url": "http://jewornotjew.com/profile.jsp?ID=1412",
  "verdict": "Borderline Jew.",
  "description": "\"Dr. Leibowitz, I presume?\"\n\nA tall man in a torn-up safari suit turned around. His face was covered by a tangled black beard.\n\n\"Oh, Stein, it's you,\" he responded, before turning back to look through the bushes.\n\n\"Dr. Leibowitz, I found you! All these years we thought you were lost!\"\n\nThe short man tried to make his way through the bushes, but Leibowitz stopped him with an extended arm.\n\n\"Shhhhh,\" he hissed.\n\n\"But Dr. Leibowitz! Your family is so worried! The whole country is! The whole world!\"\n\n\"Can't you tell I'm busy?\", Leibowitz gnarled.\n\n\"Busy?\"\n\n\"Alright,\" Leibowitz sighed. \"Come here. But QUIETLY.\"\n\nStein, careful not to snap a twig, took his place on Leibowitz's right.\n\n\"Look,\" said the tall man.\n\nStein peeked through the bushes. A group of Africans was standing in the middle of the field, rhythmically swaying back and forth.\n\n\"What are they doing?\", quietly asked Stein.\n\n\"Listen.\"\n\nStein turned his ear to the field before recoiling back.\n\n\"Am I hearing this right?\", he asked.\n\n\"You are.\"\n\n\"These negroes are... Jews.\"\n\n\"That's right.\"\n\n\"In Uganda?\"\n\n\"Yes, in Uganda! G-d damn it, Stein, why are you so dense!\"\n\n\"But... how?\"\n\n\"Apparently, their chief, Semei Kakungulu, decided to turn his entire tribe Jewish.\"\n\n\"Astonishing!\"\n\n\"What did I tell you about keeping your voice down?\"\n\n\"I'm sorry, Dr. Leibowitz. So you've been studying these... Jews all these years?\"\n\n\"Yes! Look how fascinating they are!\"\n\nStein quietly gazed at the tribesmen. Soon, the praying stopped, and one took out a long knife, while another pulled down his loincloth.\n\n\"NOOOOOOOOOOOOOOOOOO!\", Stein yelled out.\n\nHe attempted to run, but Leibowitz stuck out his long leg, tripping him. The commotion stopped the tribesmen, who were now looking directly at the bushes that concealed the two men.\n\n\"You ass,\" said Leibowitz through his teeth. \"You spooked them.\"\n\n\"But... but...\"\n\n\"But nothing!\"\n\n\"But the knife!\"\n\n\"Just your usual circumcision, Stein. I told you these were Jews.\"\n\n\"But...\"\n\n\"Oh, quiet!\"\n\nLeibowitz reached into his pocket, sighed, took out a well-worn yarmulke, placed it on his head, and made his way through the bushes.",
  "pros": null,
  "cons": null,
  "score": 1412,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/s/semei_kakungulu.jpg",
  "created_at": "2025-03-29T13:16:58+02:00",
  "updated_at": "2025-03-29T13:16:58+02:00"
}