{
  "name": "Seth Meyers",
  "url": "http://jewornotjew.com/profile.jsp?ID=1104",
  "verdict": "Barely a Jew",
  "description": "Our sleep schedule is regulated by a chemical called melatonin. Melatonin levels change as we age, which then affects how much sleep we need, when we feel tired, when we feel awake, and all that jazz.\n\nFor instance, those of us with young children know that a baby can sleep for seven hours straight, wake up, and then need a nap two hours later. Meanwhile, our aging parents are eating dinner at 4, going to bed at 8, and waking up at 5 (much to our very sleepy chagrins we might add). \n\nBut for those of you in your late teens, early twenties, your melatonin probably has you keeping some interesting hours: the kinds that make watching a show like Saturday Night Live seem like less of a chore and more of a necessity. After all, what else is there to do at 11:30 at night? \n\nWhat does this have to do with anything? Well, every time a new cast comes on board the ol' SNL, some 30-something comes along to say that the show just isn't funny anymore. The Hartman/Farley cast passed on (literally, sadly) and the Ferrell/Fey group grabbed the reins? Not funny anymore. Now that Ferrell and Fey are making mediocre movies Samberg and Meyers (lots of hearsay about his potential Jewishness; he's a quarter) stepped in? Not funny anymore.\n\nReally?\n\nOr could it be that our melatonin levels have changed, and staying up till 11:30 is no longer something we can do without six cups of coffee, two cans of Red Bull, and a defibrillator on stand-by? And rather than admit that we've gotten too old to not be ready for primetime, it's easier on the ego just to say the show isn't worth watching?\n\nOr does that hit a little too close to home?",
  "pros": null,
  "cons": null,
  "score": 1104,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/s/seth_meyers.jpg",
  "created_at": "2025-03-29T13:16:50+02:00",
  "updated_at": "2025-03-29T13:16:50+02:00"
}