{
  "name": "Sid Hartman",
  "url": "http://jewornotjew.com/profile.jsp?ID=2851",
  "verdict": "Jew",
  "description": "The Los Angeles Lakers are one of the most valuable sports franchises in the world, estimated at $4.4 billion. Back in 1947, they were purchased for $15,000... and moved from Detroit to Minneapolis.\n\nThe Lakers started as the Detroit Gems in the long-defunct NBL. After one losing season, they were sold to two Minneapolis Jews, Morris Chalfen and Ben Berger. The man behind the sale was another Jew, Sid Hartman, who saw an opportunity to bring the first professional sports team to his hometown.\n\nHartman, who was just 27 at the time, became the Lakers' de facto general manager, while still holding a full-time job. In 1949, he signed George Mikan, who ended up leading the Lakers to four straight championships. In 1956, proving that he was way ahead of his time, he tried to tank the Lakers season to get the top draft pick to select Bill Russell. That didn't work out, and four years later the Lakers left for the sunnier pastures of LA. Hartman went back to his full-time job: sports journalism.\n\nYes, the architect of basketball's first professional dynasty was a sports journalist DURING his reign as the Lakers GM. Hartman said that the conflict of interest \"wasn't important then\". Besides, he never wrote about the Lakers, so what's the big deal?\n\nIn fact, Hartman, who penned his first column back in 1945, continues to write for the Minneapolis Tribune to this day. He also hosts a radio show and is active on Twitter... and he just turned 100! Minnesotans revere Hartman so much that a statue of him was built in front of its basketball arena.\n\nThe arena hosts the Minnesota Timberwolves, still a long way to match the success of Hartman's Lakers...",
  "pros": null,
  "cons": null,
  "score": 2851,
  "category": "Art",
  "image_url": "http://jewornotjew.com/img/people/s/sid_hartman.jpg",
  "created_at": "2025-03-29T13:17:35+02:00",
  "updated_at": "2025-03-29T13:17:35+02:00"
}