{
  "name": "Sinan Reis",
  "url": "http://jewornotjew.com/profile.jsp?ID=1585",
  "verdict": "Jew",
  "description": "Esmeralda Maria Maimon de Castro was woken up by Juanita, her hefty duenna.\n\n\"Pirates!\", the old woman shrieked.\n\nEsmeralda looked out of the porthole. The distance between their caravel and the black-sailed ship was decreasing by the second.\n\nEsmeralda pinched her lips, took out charcoal from the nightstand, and, squinting into a tiny mirror, arched her eyebrows. One always had to look her best... even for pirates.\n\nBy the time the morning ritual was done and Esmeralda emerged from the cabin, the pirates have boarded. Esmeralda stepped over the body of Juanita (fainted or dead, she couldn't tell), and surveyed the situation.\n\nWhat she saw was not exactly encouraging. A number of sailors were tied to masts. Even more were lying on the deck, blood pouring from their wounds. Those weren't fainted, that's for sure.\n\nThe pirate captain was standing over one body. His beard, white from the winds, obscured the crooked nose. The captain bent over, untied a coin purse from the body's belt, and tossed it to his mates. It was then that his eyes met Esmeralda's. All of her built-up bravado dissipated immediately.\n\nEsmeralda dropped her gaze. Her dress did its best to hide her buckling knees. Somewhere on the starboard side, someone expired with a final scream.\n\nThe captain made his way to Esmeralda and drew out his hand. His pointed, dreggy, mossy nails scratched the bottom of her chin.\n\n\"Looked at me, child,\" he grunted.\n\nHe spoke without an accent. Weren't the Barbary pirates all Ottomans, Esmeralda pondered for the fleeting second.\n\n\"What is your name, child?\", the captain asked.\n\n\"Esmeralda Maria Maimon de Castro,\" she replied, barely hearing her own voice.\n\n\"Maimon de Castro?\", he echoed.\n\nEsmeralda silently nodded. He took a step back.\n\n\"Was your grandfather Abraham de Castro, the pawnbroker from Seville?\"\n\nAnother nod followed.\n\n\"And your other grandfather, Moises Maimon, the jeweler from Granada?\"\n\nEsmeralda looked up. The captain's face was shredded with criss-crossing crevices.\n\n\"Yes,\" she whispered.\n\nThe captain sighed.\n\n\"Well, Esmeralda Maria Maimon de Castro, consider this your lucky day. You will be my personal guest on my ship. I will deliver you safely to Seville. None of these men,\" he pointed with an outstretched arm, \"will touch a hair on your Hebrew head.\"\n\nAs Esmeralda wanted to correct the captain, telling him that her family has been Christian for generations, she glanced at the flag that flew on the pirate ship's tallest mast. It was adorned by a six-pointed star.",
  "pros": null,
  "cons": null,
  "score": 1585,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/s/sinan_reis.jpg",
  "created_at": "2025-03-29T13:17:03+02:00",
  "updated_at": "2025-03-29T13:17:03+02:00"
}