{
  "name": "Snooki",
  "url": "http://jewornotjew.com/profile.jsp?ID=1998",
  "verdict": "Not a Jew",
  "description": "Somewhere, under a bridge in Staten Island...\n\nPapa Troll: I'm home, wife!\n\nMama Troll: How was your day, dear?\n\nPapa: Just the pits! Where's that beer?\n\nMama: I scrounged four bottles today. Here, I mixed them for you.\n\nPapa: (gulps down) You ask how my day was? My day was crap! Some of these people tried to cross the bridge...\n\nMama: What people?\n\nPapa: You know WHAT people!\n\nMama: Oh...\n\nPapa: They try to cross the bridge, and I say to them, I say pay the toll, and they try to jew me down!\n\nMama: Dear, you know they are like that...\n\nPapa: Is there more beer?\n\nSnooki enters.\n\nSnooki: Hi, daddy! Hi, mommy! I got some exciting news!\n\nPapa: You know what would be exciting news? Another fucking beer.\n\nSnooki: Oh, daddy! The beer can wait! The test results finally came!\n\nPapa: Let me guess. Chlamydia.\n\nMama: Dear...\n\nSnooki: (laughs) No, daddy, those results are not for another week! This was my DNA test!\n\nPapa: D-N-what? What kind of a disease is that?\n\nSnooki: It's not a disease, daddy! You know I'm having a baby...\n\nPapa: (mumbles) The spawn of Satan...\n\nSnooki: And I wanted to find out what my heritance was! Here, read!\n\nPapa Troll puts on reading glasses.\n\nPapa: I can't make it out.\n\nSnooki: I'll help you! See, it says I'm part Romani?\n\nPapa: We call it I-talian.\n\nSnooki: No, papa. Romani! I asked on the street corner. That means gypsy!\n\nPapa: I'll be damned!\n\nSnooki: And that's not all! Look here! I got some Asian in me!\n\nPapa: (mumbles) You had some Asian in you last week...\n\nSnooki: And here, look, I'm part Jew!\n\nPapa: Let me see that! (grabs paper) Ashken-Nazi? What the fuck is Ashken-Nazi?\n\nSnooki: I dunno, it's some Jew thing!\n\nPapa: Some Jew thing? SOME JEW THING! I'm no fucking Jew! It must come from your side of the family, wife! No wonder you always defend them!\n\nMama: Snookums is adopted, dear.\n\nPapa: Oh, right, I forgot. Now where the fuck is that beer?",
  "pros": null,
  "cons": null,
  "score": 1998,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/s/snooki.jpg",
  "created_at": "2025-03-29T13:17:13+02:00",
  "updated_at": "2025-03-29T13:17:13+02:00"
}