{
  "name": "Soleil Moon Frye",
  "url": "http://jewornotjew.com/profile.jsp?ID=750",
  "verdict": "Jew",
  "description": "Legacies are a funny thing.\n\nAll of us are going to die eventually. And barring the worlds of science fiction and extreme religious belief (which you could argue are much the same thing in the abstract), no one is immortal. No, not even you. Sorry.\n\nThe good news is, we have routes to a kind of immortality in the things we leave behind. Leonardo da Vinci has been worm food for quite a while, yet the work he left behind has kept him alive for centuries. Therefore, much of what every human does is about finding something to be known and, eventually, remembered for.\n\nSoleil Moon Frye (half Jewish by birth, dabbled in Scientology, but now back to Judaism) will be remembered for two things (well, three if you count questionable naming, but we will stick with two): for starring in the short lived, tweenage girl craze Punky Brewster and — unfortunately there's no way we can put this tactfully — having large breasts.\n\nWhile Punky was all neat-o awesome back in the 80s it's doubtful there are many formerly young girls clutching desperately to their rainbow pigtails in the forlorn hope of a comeback. And frankly, those that are, well... you wouldn't want to meet them. \n\nAnd unless Soleil wants to be remembered for the size of her chest, (and even if she did, it's too late for that — she had reduction surgery over a decade ago) that's pretty much what she's left with. She could cure world hunger and her obit will still begin and end with \"Punky Brewster.\" So what's worse — remembered for something embarrassing or not remembered at all? \n\nLike we said. Legacies are a funny thing.\n\nfunction loadPic(x) {\nv = 'frye'+x;\nif (x == 0) v = 's/soleil_moon_frye';\nsetImage(v);\n}",
  "pros": null,
  "cons": null,
  "score": 750,
  "category": "Religion",
  "image_url": "http://jewornotjew.com/img/people/s/soleil_moon_frye.jpg",
  "created_at": "2025-03-29T12:53:00+02:00",
  "updated_at": "2025-03-29T12:53:00+02:00"
}