{
  "name": "Sonya Golden Hand",
  "url": "http://jewornotjew.com/profile.jsp?ID=1950",
  "verdict": "Borderline Jew.",
  "description": "Karl von Mel reached into his vest and pulled out his pocket watch. He snapped open the cap and tried to focus his eyes on the minute hand. It stayed motionless. Von Mel sighed. Once again, he forgot to wind it.\n\nIt must be close to closing, von Mel thought. That afternoon tea came at least three hours ago. Yes, it must be time to go. Not the most successful day in the trade, but what can you do. They can't all be winners. He sighed again.\n\nVon Mel took out his ring of keys. He found the right one, opened the display case and, one by one, started to put the boxes inside. His eyes paused on a spectacular sapphire. Its day will come, just not today.\n\nThe ringing of the doorbell startled von Mel. He dropped the keys, bent down to pick them up, emerging from the floor to see a woman wrapped in lithe silk.\n\n\"Mr. von Mel,\" the woman said. \"I hope you're not closing for the day.\"\n\nWith the gentle move of her hand, the woman lifted her veil, unveiling two large black eyes. Von Mel thought of Mrs. von Mel, at home with six children. The thought quickly passed.\n\n\"I wouldn't dream of closing, miss...\", started von Mel, doing his best to keep his eyes from the woman's decolletage.\n\n\"Madam Lieberman. My husband...\"\n\n\"Well, yes, Dr. Lieberman! The brilliant psychiatrist!\"\n\n\"You know him?\"\n\n\"I don't have the pleasure to be acquainted, but the whole town speaks of his work...\"\n\n\"Very well,\" the woman interrupted. \"Your shop comes highly recommended. I am looking for some pieces to add to my collection. There is a reception tomorrow night, and I want to look my best.\"\n\n\"Of course, of course,\" von Mel was trying to hide the eagerness in his voice. \"What exactly is madam looking for?\"\n\n\"Diamonds, Mr. von Mel. Diamonds!\"\n\n\"You've come to the right place, then! I also have this exquisite sapphire...\"\n\n\"Diamonds.\"\n\n\"But of course,\" von Mel fidgeted while finding the right key. He opened the display case and took out a box. \"I believe these lovely earrings would suit madam well...\"\n\nThe woman took a quick glance.\n\n\"Anything else?\", she firmly inquired.\n\n\"This diamond necklace is very similar to the one once worn by Marie Antoinette,\" von Mel replied, opening another box.\n\n\"What else?\", the woman said impatiently.\n\n\"If madam could tell me what she is looking for...\"\n\n\"Diamonds!\"\n\n\"Well, yes, diamonds. I believe this diadem will bring out madam's eyes...\"\n\nThe woman gazed down on the display case.\n\n\"Yes... I believe that will do. I will take it.\"\n\n\"The diadem?\"\n\n\"The whole lot. Add those over there as well,\" she pointed to the adjoining case. \"Also, those rings.\"\n\nVon Mel could not believe his luck.\n\n\"Madam, you've made a wonderful choice. Such exquisite taste! Dr. Lieberman is one lucky man!\"\n\n\"You might say so.\"\n\n\"Would you like for me to wrap these up for you?\"\n\n\"Mr. von Mel,\" the woman said. \"I know you haven't washed your windows in days, but even with the dirt, you can see that I did not come in a carriage.\"\n\nVon Mel squinted to look into the street.\n\n\"And how exactly do you expect me to bring all these boxes home?\", the woman continued.\n\n\"My apologies, madam!\", von Mel explained. \"Perhaps I can deliver them to your house? Tomorrow, say three o'clock?\"\n\n\"That will do,\" the woman nodded. \"Do not be late.\"\n\nShe turned around, effortlessly pushed out the heavy front door and walked onto the street.\n\nThat night, von Mel tossed and turned through the wee hours of the morning. His wife slept like a log. \n\nThe next day welcomed von Mel with toasty sunshine and chirping birds. He quickly downed his morning coffee and rushed to the shop. There, he took out Madam Lieberman's order and carefully wrapped each box into the most frilliest of papers, tying each with an elaborate bow. He then took a large box, placed the smaller ones in it, and wrapped that up as well. Three o'clock couldn't come fast enough. Von Mel cursed himself for once again forgetting to wind his watch.\n\nWhen the afternoon rolled around, von Mel was ready to go. The rented carriage was ready at two o'clock. He did not want to keep Madam Lieberman waiting.\n\nThe Lieberman house was located at the fanciest on the far end of a quiet elm-lined street. Two stone lions gravely guarded the pathway, staring at von Mel with their unblinking eyes. At precisely 2:55, von Mel knocked. \n\n\"Why, it's Mr. von Mel!\"\n\nMadam Lieberman was wearing the most delightful of smiles as she walked von Mel into her boudoir. She extended her gloved hand for a kiss. Von Mel tapped the fine leather with his lips.\n\nThe woman pointed to the chaise lounge in the corner of the room. Von Mel sat, resting the large box next to him.\n\n\"What a lovely selection of furniture you have, Madam Lieberman!\", he complimented. \"Those chairs come from the Master Gambs collection, I believe.\"\n\n\"Yes, I think they do,\" the woman responded. \"But we are not here to talk about furniture...\"\n\n\"No, not at all!\", von Mel exclaimed. \"I believe everything is in order, madam,\" he continued, handing her the box.\n\n\"Everything is in there?\", she asked.\n\n\"Everything! You could open it now, if you'd like!\"\n\n\"There is no need,\" she dismissed. \"Oh! Would you look at the time!\", she suddenly shrieked. \"Will you excuse me, Mr. von Mel? I need to freshen up for the party. Dr. Lieberman will be here within an hour to settle up.\"\n\n\"Why, of course, madam. It will be my pleasure. Do have a pleasant evening.\"\n\nVon Mel stood up from the chaise lounge, sending a last glace to Madam Lieberman's slender figure. He then sat back down, rested one foot on top of the other, and started to wait.\n\nWhen the hour hand on the wall clock hit four, von Mel had not yet started to worry. An hour later, strange thoughts began to creep through his mind. Those dissipated by six o'clock, when a man who could only be Dr. Lieberman walked into the room. A gray pointy beard adorned the wrinkled face of the elderly physician.\n\n\"Dr. Lieberman,\" von Mel shot up from his seat, shaking the old man's arm.\n\n\"That I am. And you are?\", the physician replied, glaring at von Mel through the thick lens of his pince-nez.\n\n\"I am Karl von Mel, the jeweler! You wife has sent for me. She sure has an exquisite taste!\"\n\n\"My wife?\"\n\n\"Yes, your wife. Madam Lieberman...\"\n\n\"Mr. von Mel, if that's your real name... My wife has been dead for twenty-four years.\"\n\n\"That cannot be! She was just here a couple of hours ago! She ordered all this jewelry from me! A young, rather beautiful woman, if I can say so myself...\"\n\n\"Mr. von Mel, I am starting to lose patience,\" said the doctor. \"Here is my wife shortly before her death,\" he pointed to a picture on the wall. \"You can clearly see that she was neither young nor beautiful.\"\n\nVon Mel looked at the wall, then at the physician, then back at the wall.\n\n\"But... but... Dr. Lieberman... Madam Lieberman... But...\"\n\nThe doctor grabbed von Mel by his sleeve.\n\n\"It's time to go, Mr. von Mel.\"\n\nVon Mel broke free.\n\n\"No, no, no,\" he chanted. \"She was there. Madam Lieberman. Diamonds! My diamonds! Madam Lieberman! My diamonds!\"\n\nDr. Lieberman shook his head and pressed a button on the wall. Two orderlies walked into the room, grabbed von Mel and dragged him out. The doctor sat down on the Master Gambs chair, took out a handkerchief from his breast pocket, and wiped his forehead. Von Mel cried all the way to the sanitarium. The woman was never seen again.\n\n\nSofia (Sheyndla-Sara) Blyuvshtein (also Solomniak, also Shtendel), known as Sonya Golden Hand, was a legendary 19th century Russian thief, known for her elaborate schemes. The details of the above story are fictional, but the events are true. We weep for you, Karl von Mel.",
  "pros": null,
  "cons": null,
  "score": 1950,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/s/sonya_golden_hand.jpg",
  "created_at": "2025-03-29T13:17:12+02:00",
  "updated_at": "2025-03-29T13:17:12+02:00"
}