{
  "name": "Sophie Okonedo",
  "url": "http://jewornotjew.com/profile.jsp?ID=984",
  "verdict": "Jew",
  "description": "At some point, we stopped treating the Jew Score as just a fun way to rate Jews, but started to get serious about it. With almost a thousand profiles under our belt, we have precedents and formulas that help us arrive at the score without arguments. (Alright, with some arguments. We're Jews after all.)\n\nBut with the precedents and formulas, there are some things about the Jew Score that bother us. One of those we will call the Sophie Okonedo Exception. (Technically, it should be called the Taylor Mays Exception, since it came to our attention while re-visiting the Taylor Mays profile.) Let's call it the Mays/Okonedo Exception.\n\nSophie Okonedo is a black British actress. She is half Nigerian, half Jewish ethically, and says \"I feel as proud to be Jewish as I feel to be black\". Terrific. So what score will Sophie get?\n\nHalf Jewish by birth, which the formulas give an I Score of 3. She's not exactly stereotypically Jewish, so that's an O Score of 2. And for the K, we can't go higher than 3. (She's Oscar-nominated for \"Hotel Rwanda\", but most of her work is on British TV. She was also in the terrible \"Ace Ventura 2\".) So that gives us a Jew Score of 8, a very low score for a proud Jew.\n\nBasically, the way our system is designed, it double-punishes Jews from \"non-traditional\" backgrounds (be they black, Hispanic, etc). Since most of them have half of Jewish ethnicity, they lose out on the I. Since most of them don't \"appear\" Jewish, they lose out on the O. And the K is not always enough to make up for the losses. So we have some people with the verdict of Jew with lower Jew Score than some Borderline Jews. Which was not our intention in the first place.\n\nSo we gave it some thought, everything from revamping our formulas, to awarding bonus points, to adding a fourth rating. But we're gonna let it be, the Mays/Okonedo Exception be damned.\n\nFor at the end, the Jew Score should be a fun way to rate Jews. Why on earth did we get so serious about it?",
  "pros": null,
  "cons": null,
  "score": 984,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/s/sophie_okonedo.jpg",
  "created_at": "2025-03-29T12:53:06+02:00",
  "updated_at": "2025-03-29T12:53:06+02:00"
}