{
  "name": "Stella McCartney",
  "url": "http://jewornotjew.com/profile.jsp?ID=1050",
  "verdict": "Jew",
  "description": "A couple of years ago, we were interviewing for a job in a company that shall remain nameless for reasons that will be made clear below. We arrived for the interview on time and ended up waiting an hour in the lobby for the hiring manager to show up. We wish we were exaggerating.\n\nSo what did we do? Read magazines. Cover to cover. And since we have no interest in \"Good Housekeeping\" or \"Vogue\" (well, maybe the latter for the photos of models, but those can only sustain one for so long), we reached for \"Time\", which, as luck would have it, was the previous year's \"Time 100\" issue.\n\n\"Time 100\" is the revered magazine's list of the 100 most influential people in the world. Presidents, billionaires, luminaries. Angelina Jolie. Etc. So we leafed through. And seeing how our wait lasted an hour, we pretty much read the issue cover to cover.\n\nOne name jumped out. Stella McCartney. Yes, Paul's daughter, and yes, Jewish — her mother Linda was, and Stella self-identifies, but does not practice. And what does she do to make the esteemed list? Does Stella fight hunger, or attempt to find a cure for cancer, or...\n\nShe is a fashion designer. As the magazine put it, she \"created a definitive, sought-after style that spearheads trends\". Which somehow makes her suited for the \"Time 100\" and not \"Vogue\". Meh.\n\nIn any case, our wait was eventually over, and we ended up taking the job, which led to a month in the most obtuse, clusterfuck of a company (oh, how we wish we could tell you the name, for you have definitely heard of it!), before we quit and moved on to better things.\n\nAnd Stella? We'd rather have Paul.",
  "pros": null,
  "cons": null,
  "score": 1050,
  "category": "Art",
  "image_url": "http://jewornotjew.com/img/people/s/stella_mccartney.jpg",
  "created_at": "2025-03-29T13:16:49+02:00",
  "updated_at": "2025-03-29T13:16:49+02:00"
}