{
  "name": "Stephen Jay Gould",
  "url": "http://jewornotjew.com/profile.jsp?ID=613",
  "verdict": "Jew",
  "description": "Respected and even venerated by his peers. Recipient of multiple awards. Hosted his own TV special. Had a well-publicized beef with a competitor. Even appeared as himself on the Simpsons.\n\nStephen Jay Gould sounds like a real celebrity, huh?\n\nBut then you realize the TV show was on PBS. The awards were things like the Darwin-Wallace medal. And the beef was with a biologist.\n\nWe've been led to believe that it's different in other countries. That other places tend to value intelligence as a desirable feature (they have artists on their money in Europe, donchaknow). We'll have to take people's word for it. We only know here. \n\nAnd in this country you get more accolades for stepping out of the backseat of a limo with no underwear than you do for completely revolutionizing our understanding of evolutionary theory.\n\nSo maybe Steven Jay Gould wasn't a celebrity, but why couldn't he be? Why not a half-hour knowledge-obsessed show that chases salacious rumors about scientists (Access Laboratory)? Or \"Quantum Beat\", a magazine featuring hot, young physicists for tweenage girls? Or a reality show on VH1 called \"I Love the Dadaists\"? \n\nNo? Oh well. But it's something we feel we ought to be shooting for. Of course, we're not exactly part of the solution, either. We're the site that has 500 words on Corey Feldman, after all.\n\nBut that doesn't mean we still can't hope, right?\n\nP.S. Despite the ample opportunity, please note that neither we nor this profile at any time refer to said profilee — a famous paleontologist — as a 'rock star' in accordance with the WFWI (Writers For Word Integrity) Accord of 1997. Thank You.",
  "pros": null,
  "cons": null,
  "score": 613,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/s/stephen_jay_gould.jpg",
  "created_at": "2025-03-29T12:52:57+02:00",
  "updated_at": "2025-03-29T12:52:57+02:00"
}