{
  "name": "Stephen Ross",
  "url": "http://jewornotjew.com/profile.jsp?ID=3130",
  "verdict": "Sadly, a Jew.",
  "description": "YOU PLAY TO WIN THE GAME!\n\nSports fans are well aware of the viral (Is it alright to call something from 2002 viral? Let's just go with it.) clip of then-New York Jets coach Herman Edwards blowing up at reporters. YOU PLAY TO WIN THE GAME!\n\nSometimes you don't.\n\nAmerican sports are positioned in such a way that often incentivizes losing. Worse teams get better draft picks for a chance to pick up a game-changing player. Trading your best assets now can reap benefits down the line. Theoretically, at least.\n\nWell, not just theoretically, as teams in every league do it pretty blatantly. In basketball, the 76ers endured a multi-season losing effort known as \"The Process\". At the end, it got them to the elite echelon of NBA teams. Did the 76ers win the championship? No, but they got close. Was years of losing worth it? Hard to say.\n\nOf course, the 76ers, and other similar teams do not lose \"on purpose\". They just put out a rather bad team, which, in theory, will lose more often than not. In practice as well.\n\nWhich brings us to back to the NFL and the Miami Dolphins. Former coach Brian Flores is suing the team — and the league — for discriminatory hiring practices. (He is absolutely correct about that.) The lawsuit also mentions that Dolphins owner Stephen Ross (Jew? Say it ain't so! Yes, Jew...) offered to pay Flores $100,000 for each game he lost.\n\nIf that is true (and we have little doubt that it is true), it puts a huge question mark on the validity of sporting results. Fine, Flores didn't take the bribe, but there is no way Ross was alone in offering it, right? How many other owners and coaches are trying to lose on purpose by undermining their own players?\n\nThe sad thing is, even if Ross is found to be at fault, the NFL will just slap him on the wrist, or — heaven forbid — force him to sell the team for a tidy multi-billion profit.\n\nRoss has won that game, regardless of the outcome. And he didn't even need to play...",
  "pros": null,
  "cons": null,
  "score": 3130,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/s/stephen_ross.jpg",
  "created_at": "2025-03-29T13:17:43+02:00",
  "updated_at": "2025-03-29T13:17:43+02:00"
}