{
  "name": "Ted Danson",
  "url": "http://jewornotjew.com/profile.jsp?ID=1295",
  "verdict": "Not a Jew",
  "description": "We want to thank our Hebrew hosts for turning over this profile (Not a Jew, natch) to our humble website, BaldOrNotBald.com.\n\n1993 was a great year for the follicly challenged. Michael Jordan was leading the Chicago Bulls to their third straight title. Albert II became the King of Belgium. Patrick Stewart was (dare we say it? yes!) baldly going where no man has gone before. George Costanza was at his misanthropic peak. And, most important of all, Ted Danson revealed his bald spot on \"Cheers\".\n\nIt was an iconic moment for the bald brotherhood. Here he was, the nation's heartthrob, so vain about his hair, revealing that he is one of us. Oh, sure, he covered it up, something we usually would frown at, but... who are we to judge? Ted Danson! Bald! Tears of joy ran down our faces.\n\nAnd then something happened. \"Cheers\" ended its run, and so did Danson's bald spot. As time went on, his hair seemed to thicken, to a point now where he sports what looks like dense white coiffure. Tears of joy? We now shake our heads in disappointment. Our bald, bald, bewildered heads.\n\nIt's not too late, Ted. Oh, do come back! Show yourself for who you truly are! For you might try to hide it, but we know the one clear, simple truth:\n\nfunction flip() {\n rating.innerHTML = '8';\n rat1.innerHTML = '3';\n rat2.innerHTML = '1';\n rat3.innerHTML = '4';\n ratTitle.innerHTML = 'Bald Score:';\n banner.src = 'img/other/bald/bald-title.gif';\n ratPic1.src = 'img/other/bald/bald-3.jpg';\n ratPic2.src = 'img/other/bald/bald-1.jpg';\n ratPic3.src = 'img/other/bald/bald-4.jpg';\n setVerdict('Bald');\n a = document.getElementsByTagName(\"a\");\n for (i=0;i\u003ca.length;i++) {\n  a[i].style.color = '#b29e73';\n }\n b = document.getElementsByClassName(\"border\");\n for (i=0;i\u003cb.length;i++) {\n  b[i].style.backgroundColor = '#f2deb3';\n }\n}",
  "pros": null,
  "cons": null,
  "score": 1295,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/t/ted_danson.jpg",
  "created_at": "2025-03-29T13:16:55+02:00",
  "updated_at": "2025-03-29T13:16:55+02:00"
}