{
  "name": "The Romanovs",
  "url": "http://jewornotjew.com/profile.jsp?ID=2850",
  "verdict": "Not a Jew",
  "description": "Did you know that the Romanovs (the doomed Russian dynasty, not Matthew Weiner's ill-conceived anthology series) are not really the Romanovs? They are... the Holsteins.\n\nIn 1741, Elizabeth became the Empress of Russia. She was the daughter of Peter I, and therefore a Romanov. She never married (at least officially), and had no children. Still, an heir had to be selected, so Elizabeth chose her nephew, the son of her sister Anne... Peter Holstein. No, despite the -stein, he obviously wasn't Jewish. Peter's full name was Charles Peter Ulrich of Schleswig-Holstein-Gottorp.\n\nPeter hailed from the Duchy of Holstein, the northernmost region of Germany, which, for some reason, was fertile ground for Russian nobility. After Elizabeth's death, he became Peter III, before he was usurped by his wife Sophie of Anhalt-Zerbst, also originally from Germany. (You might have heard of that one... she changed her name to Catherine.) She was succeeded by her son Paul, who was succeeded by his son Alexander, yadda yadda yadda, Nicholas II, end of the Romanovs... Really, of the Holsteins!\n\nNot wanting a German surname placed on their ruling dynasty (which is rather ironic, considering the czars were much more German than Russian due to all the marriages), Russians decided to grandfather the Romanov onto Peter and his descendants, creating a rather cumbersome moniker. Officially, the Romanovs are... the Holstein-Gottorp-Romanovs.\n\nOr perhaps not. It has been widely speculated (and insinuated by Catherine herself) that Paul's father was not really Peter (Holstein), but rather her lover, Sergei Saltykov, which would make the Romanovs... the Saltykovs.\n\nTake your pick.",
  "pros": null,
  "cons": [
    "idering the czars were much more German than Russian due to all the marriages), Russians decided to grandfather the Romanov onto Peter and his descendants, creating a rather cumbersome moniker. Officially, the Romanovs are... the Holstein"
  ],
  "score": 2850,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/t/the_romanovs.jpg",
  "created_at": "2025-03-29T13:17:35+02:00",
  "updated_at": "2025-03-29T13:17:35+02:00"
}