{
  "name": "The Wandering Jew",
  "url": "http://jewornotjew.com/profile.jsp?ID=837",
  "verdict": "Jew",
  "description": "Dear Jew or Not Jew,\n\nFirst things first — terrific website. Have you ever thought of doing it in book form? Not sure if this \"internet\" fad will last — and books have been there for centuries. Back when me and Gutenberg (Johannes — not Steve) were printing those first Bibles, little did we know how books will catch on. (Speaking of Steve — in my 2000 years on this planet, I never laughed as hard as when I saw \"Police Academy\" for the first time. How he was never even nominated for an Oscar is beyond me. Antisemitism, probably.)\n\nI'm writing to you to set some things straight. (No, not about that girl in Thailand — she swore she was 18. And a girl. Besides, I was cleared of all charges.) It's about that whole mess between me and Jesus.\n\nI used to hang with Jesus and the gang back in the day. You'll never see me mentioned among the apostles, however. (Antisemitism, definitely. While all those traitors jumped ship and started the whole Christianity thingamajig, I stayed true to Judaism. And paid the price. Or did I? More on that later.)\n\nSo here we were, having supper, and then Jesus comes in and says that he will die tomorrow. A bit dramatic, right? Magdalene choked on a fish bone when she heard that; I had to give her mouth-to-mouth. Not the first time that happened, if you get my drift. You should have seen the look Jesus gave me.\n\nSo after supper, everyone goes to bed, and I'm washing the dishes. (Even though it was Bartholomew's turn! But he and Simon the Zealot were getting a bit zealous, if you get my drift.) So Jesus comes up to me and says, is there anything between you and Magdalene? And I say, what are you, mental? And he says, you kissed her in front of everyone! And I say, she choked on a fishbone! And he said, you gotta do the Heimlich then, not mouth to mouth! (Wait, he might not have said that. Don't think the Heimlich was invented yet. But he said something in that vein.) And I say, I saved your girlfriend's life, and this is the thanks I get! And he says, I see the way you two look at each other! And I say, oh yeah? What if we do? Why haven't you made an honest woman of her yet? And he says...\n\nSorry, got carried away there for a second. 2000 years, and the blood still gets boiling. Magdalene, she had that effect on people. Best I ever had, other than that Indian chick on Columbus' second voyage. Wowzers, could that girl move! (By the way — you're right, Columbus was definitely not a Jew. A bit of a dope, too. But where was I?)\n\nLong story short, next day Jesus gets taken away and hung on the cross. (Hung? Hanged? Could never figure that one out.) And where are his apostles? Hiding, the little wimps, afraid they'll get taken in with their leader. Pussies. Magdalene, I gotta give her credit, she was with Jesus until his last sigh. Good woman. Loose, but good.\n\nSo I come out to the cross to see Jesus, and you know what the bastard does? Spits at me! I know about you and Magdalene, he says! Now get this, here's this dude, dying on the cross, and all he can think of is whether his girlfriend and I did the monkey dance together. Well we did, I say! So he spits again. Curse you, he says! May you walk this Earth until I return! What a tool.\n\nSo here I am, walking the Earth since then. Not a bad deal, if you ask me. Jesus has been dead for two millennia, while I've been banging chicks of every shape and shade. Good trade-off, if you ask me. Second coming! Like that will ever happen.\n\nAnyhoo, I gotta wrap up. The wireless connection at the Bunny Ranch keeps going in and out, and I got more important things to attend to at the moment.\n\nKeep up the good work,\n\nAhasverus\nThe Wandering Jew",
  "pros": null,
  "cons": null,
  "score": 837,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/t/the_wandering_jew.jpg",
  "created_at": "2025-03-29T12:53:03+02:00",
  "updated_at": "2025-03-29T12:53:03+02:00"
}