{
  "name": "The Jewish Bride",
  "url": "http://jewornotjew.com/profile.jsp?ID=3276",
  "verdict": "Borderline Jew.",
  "description": "The Jewish Bride is neither Jewish nor a bride. Discuss.\n\nNo, not just some Jewish bride. \"The Jewish Bride\", only one of the most famous paintings by Rembrandt himself. No, not THAT Jewish Bride. We'll get to that one.\n\n(As an aside, don't profiles like this make JONJ terrific? In the midst of pithy remarks about comic book actors and athletes of questionable quality, a short detour into art history?! But we digress.)\n\nYes, \"The Jewish Bride\", or \"Het Joodse bruidje\", if you will, a Rembrandt masterpiece, painted towards the end of the master's life. It depicts a Jewish woman and her father, presenting her a gift of jewelry upon her marriage... It's right there in the title.\n\n\n\n\n\nOr, you know, not. Apparently, the painting did not have a title, until, in the 1800s, 200 years after its creation, a collector thought it showed a Jew seeing off his daughter before her big day. So he called it \"The Jewish Bride\", and the name stuck... for a long time, until scholars started to question it. Does anything in the painting even suggest that the people depicted are Jewish? Or that the woman is, you know, a bride?\n\nApparently, not. The identity of the couple will forever remain a mystery (unless someone discovers a lost Rembrandt diary that claims the woman is Shelly from West Amsterdam or something), and theories are a plenty. They could be Rembrandt's son Titus and his wife. They could be poet Miguel de Barrios and his wife. They could be a Biblical couple, such as Isaac and Rebecca. (The most accepted version today. Not to criticize freaking Rembrandt here, but that would mean he got the period costumes way wrong! That dress would not survive the Negev heat.)\n\n\nNote that in all three of these explanations eschew the father-and-daughter route for the husband-and-wife version. So... \"The Jewish Bride\" is PROBABLY not a bride and PROBABLY not Jewish (unless you want to go that Biblical route?)\n\nNow, Rembrandt's other painting, \"The Jewish Bride\"... err, the one also known as \"The Girl in a Picture Frame\" and \"The Girl in a Hat\"? She is Jewish. Probably.",
  "pros": null,
  "cons": null,
  "score": 3276,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/t/the_jewish_bride.jpg",
  "created_at": "2025-03-29T13:17:46+02:00",
  "updated_at": "2025-03-29T13:17:46+02:00"
}