{
  "name": "The Khazars",
  "url": "http://jewornotjew.com/profile.jsp?ID=843",
  "verdict": "Jew",
  "description": "We've mentioned this before: we're big fans of the game Civilization here at JONJ.\n\nThere have been four iterations of the game (not including about 800 expansion packs, several poorly made console versions, the original board game, and the game we play in our minds when we're bored at work, y'know, theoretically). Which was our favorite?\n\nProbably 4. Not because of the graphics or the gameplay. No, the best part about Civ 4 is we could make our Civilizations discover and convert to certain religions and that meant — you guessed it — Jewish World Empire!!!\n\nG-d DAMN that's one heck of a satisfying gameplay mechanism.\n\nWhat would the Jewish world conquerors be like? Well, we'd imagine (because, frankly, we're a little delusional) that our little computer generated Jewish Kingdoms would probably be a lot like the Khazars — a mysterious group of Eastern European nomads that came, saw, conquered and then, in one of the stranger moves in history, mass-converted to Judaism (vini, vidi, vici, oy vey?).\n\nThe actual reasons for the conversion are lost to history (had to be one busy mohel season, that much is certain). And even the numbers of converts are up for dispute. But the Khazars collapsed, leaving many questions never to be answered. Too bad.\n\nPerhaps it was the sign of something bigger. An unknown entity playing Civilization on the larger scale. Doing what we would do. Start with a village, create a force to be reckoned with, convert to Judaism (it HAD to be Judaism), and start the long process of taking over the world. And then they lost the game. Heck, it happens to the best of us. \n\nAt least they didn't try to win by building a spaceship. That was always the wussy way out.",
  "pros": null,
  "cons": null,
  "score": 843,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/t/the_khazars.jpg",
  "created_at": "2025-03-29T12:53:03+02:00",
  "updated_at": "2025-03-29T12:53:03+02:00"
}