{
  "name": "The Cherokee",
  "url": "http://jewornotjew.com/profile.jsp?ID=1258",
  "verdict": "Not a Jew",
  "description": "\"At what time do they [the Indians] rise? What about baths? Murder? Suicide? Are any animal sacrifices in their religion? What affinity between their religious ceremonies and those of the Jews?\" — Dr. Benjamin Rush, to Captains Lewis and Clark before their expedition west.\n\nThe \"Lost\" Tribes of Israel: The Jews who \"disappeared\" (\"were slaughtered\" most like) a long, long time ago. Every non-White civilization that Europeans have \"discovered\" has at one time or another been identified as, potentially, the descendants of one of these \"lost\" tribes.\n\nThe consequence of this (beyond the overuse of \"quote marks\"), is that we have to  explain why every random nation out there might or might not be Jewish. \n\nToday's subject: The Cherokee. Well, all Native American tribes, really. But what makes the Cherokee worth discussing is, unlike everyone else, they're actually the ones claiming to be Jews rather than having it assigned to them. Their evidence? Some long lost tribal stories involving the word Masada, a few vaguely hebraic sounding words in their language, and a handful of (proven fake) relics with Jewish writings on them.\n\nSo, probably not. But then why make it up? Well, look at it from afar. Jews have their own country, one that was hand delivered to them by the global community. In the US, Jews are disproportionately represented in both the government and in culture. And that's before getting into the usual, stereotypical rigamaroles of all Jews are rich, all Jews are smart, et al. Would these things not be attractive to an itinerant people such as the Cherokee?\n\nStill it's a pretty sad commentary. When things have gotten so bad you're coveting one of the most oppressed, persecuted, terrorized peoples in history, well, does it get much worse?",
  "pros": null,
  "cons": null,
  "score": 1258,
  "category": "Religion",
  "image_url": "http://jewornotjew.com/img/people/t/the_cherokee.jpg",
  "created_at": "2025-03-29T13:16:54+02:00",
  "updated_at": "2025-03-29T13:16:54+02:00"
}