{
  "name": "The Penguin",
  "url": "http://jewornotjew.com/profile.jsp?ID=280",
  "verdict": "Not a Jew",
  "description": "Scene: We are inside the Batcave. Batman is seated at his desk in front of a large viewscreen. Alfred, his loyal butler, stands at his side.\n\nBatman: \"Computer, show me the locations of every Jewish temple in Gotham.\"\n\nAlfred: \"Temples, sir?\"\n\nBatman: \"The Penguin's back in town.\"\n\nAlfred: \"I see, sir. I assume, then, that his crime spree must be involved with something Jewish in nature.\"\n\nBatman: \"Alfred, the Penguin is Jewish. It's Friday night. He'll be well on his way to shul by now.\"\n\nAlfred: \"The Penguin? Jewish? I had no idea.\"\n\nBatman: \"Of course. For instance, his origin is an obvious Jewish archetype. He was abandoned as a baby and put in a basket in a river. Just like Moses.\"\n\nAlfred: \"Are you sure that story is still in the current continuity, sir?\"\n\nBatman: \"You know, I'm not sure. With all these reboots, it's hard to keep things straight. But even so, look at him! His big nose. His obsession with wealth. His love of herring...\"\n\nAlfred: \"I believe, Master Bruce, that you are merely propagating a negative Jewish stereotype.\"\n\nBatman: \"Really? \n\nAlfred: \"I am afraid so, sir.\"\n\nBatman: \"Wow. I guess I should tell Robin to stop searching all of Gotham's Chinese restaurants.\"\n\nAlfred: \"Very good, sir.\"\n\nNext week on Batman: The caped crusader discovers, to his horror, that Black Canary is, in fact, not black.\n\n[Editor's Update: In 2019, an episode of the Harley Quinn animated series depicts The Penguin attending his nephew's bar mitzvah. Consider us intrigued, but not convinced. Still, that should teach us to doubt the Batman. He is the world's greatest detective, after all.]",
  "pros": null,
  "cons": null,
  "score": 280,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/t/the_penguin.jpg",
  "created_at": "2025-03-29T12:52:49+02:00",
  "updated_at": "2025-03-29T12:52:49+02:00"
}