{
  "name": "The Japanese",
  "url": "http://jewornotjew.com/profile.jsp?ID=801",
  "verdict": "Not a Jew",
  "description": "According to the bible (ver 1.0), Jacob — the original Israel — had 12 sons, all of whom migrated to Egypt when their brother Joseph was the big macher there. Joseph died, the descendants of the brothers were enslaved, yadda yadda yadda, Moses led them to the promised land.\n\nWhile meandering around the sands of Sinai, Moses broke the Israelites into tribes based on which brother they had descended from. So, Levi's descendants became Levites, etc. Thus, the 12 tribes of Israel. Each of these tribes was given a separate job (priest, farmer, accountant...) and a specific area to settle in when they reached the promised land.\n\nWell, the Israelites eventually split, with ten of the tribes living in the land of Israel and the other two living in Judea (thus, Jews). But it was still all good. Or at least it was until 993 BC, Thursday at 1:13pm (it was sunny, with a slight breeze coming from the northwest) when a group of  Assyrians (who undoubtedly put the Ass in Assyria), attacked the northern land of Israel and destroyed anyone and anything in their path.\n\nAnd that's where things get hazy. These \"10 Lost Tribes\" joined other such mythical stories as the lost cities of gold and the lost meaningful plot on \"Lost\". All we know is, they gone. \n\nWhere to? There are some crazy theories out there. Ethiopians? Maybe. Native Americans? Sure (as part of his original instructions to Lewis and Clark, President Jefferson instructed them to find the lost tribes of Israel. Good luck boys!). Japanese? We guess... Wait, seriously? The Japanese?\n\nYup. Apparently Japanese culture is filled with all sorts of stuff that if you squint really hard kinda sorta looks maybe Jew-like. After about five rounds of sake no doubt. Hey, not that we're complaining. The Japanese want to be Jews and share all their wonderful electronic devices with us? Welcome to the team!\n\nOf course, the most likely answer is the Israelites that didn't die when the Assyrians went all aggro on them moved on and assimilated wherever they could — melting into the pages of history. But that hasn't stopped people from saying the Chinese, the Japanese, the Eskimos and anyone else on two legs who the Europeans \"discovered\" at one point are really transplanted Jews.\n\nOh yeah. Cause that just makes a ton more sense.",
  "pros": null,
  "cons": null,
  "score": 801,
  "category": "Religion",
  "image_url": "http://jewornotjew.com/img/people/t/the_japanese.jpg",
  "created_at": "2025-03-29T12:53:02+02:00",
  "updated_at": "2025-03-29T12:53:02+02:00"
}