{
  "name": "The Jew Among Thorns",
  "url": "http://jewornotjew.com/profile.jsp?ID=2392",
  "verdict": "Sadly, a Jew.",
  "description": "Today, dear reader, we're gonna tell a story. Not one we made up ourselves; rather, this a tale by the famed Brothers Grimm. It's called \"The Jew Among Thorns\" (also known as \"The Jew in the Brambles\"). Pull up a comfortable seat, this one is gonna be a doozy!\n\nThere was a rich man, who had a loyal servant. The servant was hardworking and always happy. When a year passed, the rich man thought, why pay the servant?\n\nWe know what you're thinking: the rich man is the Jew in the title. Don't get ahead of yourselves.\n\nSo the rich man doesn't pay the servant, and doesn't pay him the second year either. When the third year ends, the servant asks the rich man for payment so he can go see the world. The rich man gives him three hellers.\n\nA heller was valued at half a pfenning, so this is basically of very little value.\n\nThe servant thinks that this is a lot of money, so he goes on his way. In his travels, he meets a little man.\n\nThat's not the Jew either.\n\nThe little man asks why the servant is happy, and the servant says that he has a lot of money, a whole three hellers! The little man says that he is poor and weak; the servant is young and strong; could he spare some change? The servant gives him the entire three hellers. The little man says, for your kind heart, I will grant you three wishes. Fine, the servant says. I want a rifle that will never miss, a fiddle that will make everyone dance, and, if I ever ask anyone for anything, I want that request granted.\n\nIf you ask us, that third wish is a giant cheat, kinda like wishing for infinite wishes, which is usually prevented in other fairy tales.\n\nThe little man gives the servant the rifle and the fiddle, and tells him that all his requests will be granted. Hooray, says the servant. He leaves the little man and then meets a Jew with a goat's beard.\n\nWe are NOT making this up. A Jew with a goat's beard. Trust us, it gets worse.\n\nThe Jew is listening to a bird's song. He is enchanted. He wants the bird for himself. No problem, says the servant. He shoots the bird and it falls in the thorns. Come on, you swindler, says the servant. Go get your bird.\n\nThe insults continue. Note that so far the Jew has done NOTHING to the idiot servant. He was just enjoying a beautiful song.\n\nSo the Jew goes into the thorns to pick up the bird. The servant starts playing the fiddle, and the Jew starts dancing! And the thorns start prickling him! Stop!, yells the Jew. It hurts! I don't want to dance! The servant says, you've been fooling people for so long, let the thorns prick you.\n\nWhat a piece of shit this servant is.\n\nOy vey, says the Jew. Stop, and I'll give you a sack of gold!\n\nHe actually says \"oy vey\". We're not making this up. Also, of course a Jew would have a sack of gold on him. That's what we Jews do, we walk around the woods carrying gold in sacks. Jesus fucking Christ.\n\nIf you're so generous, fine, says the servant. He stops playing, the Jew gives him a sack of gold, and goes on his way.\n\nIt's not over. It gets much, much worse.\n\nSo the Jew is understandably pissed off and goes to the judge. Judge, he says, oy vey, I was robbed! Look at my tattered clothes and my bloody body! My sack of gold was also stolen! Put the thief in jail! The judge asks, can you tell who did this to you? The Jew says, he has a rifle and a fiddle. The judge sends his men, they find the servant, and bring him to court. I didn't touch the Jew, says the servant. He gave me his money voluntarily. He lies!, screams the Jew. The judge doesn't believe the servant and sentences him to hang.\n\nHere we must question the medieval German justice system. Clearly, a case of he said / he said. We guess the servant was in possession of the Jew's sack. Still, very iffy here.\n\nThe servant calmly climbs on the gallows, and asks for a final wish: to play his fiddle. No way!, screams the Jew. Why not?, says the judge. Oy vey, oy vey!, screams the Jew. Tie me down! Tie me down! Oy vey!\n\nJesus fucking Christ.\n\nNo one ties the Jew down, the servant starts playing, everyone starts dancing: the judge, the Jew, the executioner. Soon the whole town starts dancing, even the dogs. The more they dance, the crazier it gets, people start bumping heads and hurting each other. Finally, the judge screams, I'll pardon you, just stop playing!\n\nWe're almost there.\n\nThe servant puts down his fiddle, steps down from the gallows, and comes to the Jew. Bastard!, he says. Now tell the truth, where you got the money from, or I'll play the fiddle again. I stole the money!, cries the Jew.\n\nUn-fucking-believable.\n\nThe judge sentences the Jew to hang.\n\nThe end. Motherfucking shit.",
  "pros": null,
  "cons": null,
  "score": 2392,
  "category": "Music",
  "image_url": "http://jewornotjew.com/img/people/t/the_jew_among_thorns.jpg",
  "created_at": "2025-03-29T13:17:24+02:00",
  "updated_at": "2025-03-29T13:17:24+02:00"
}