{
  "name": "Theda Bara",
  "url": "http://jewornotjew.com/profile.jsp?ID=925",
  "verdict": "Jew",
  "description": "Sarah Greenbaum couldn't sleep all night. The new vampire movie was here, and she was going to be the first to see it.\n\nIn the morning, Sarah's mother couldn't help but notice the eagerness with which Sarah shoveled down her oatmeal. \"Can't wait for school, dear?\", asked Mrs. Greenbaum, to which Sarah responded with a wordless slurp.\n\nHer mother didn't approve of the vampire obsession. After the last film, which resulted in Sarah trying to dress like the leading lady, she ended up being grounded for a week.\n\nMrs. Greenbaum watched as Sarah walked down the block and turned the corner. As soon as she was out of her mother's sight, Sarah started walking into the opposite direction. There would be no school for her today.\n\n\"Exactly how old are you, miss?\" The usher's empty eyes glared Sarah up and down. She straightened her back. \"Nineteen,\" she said, trying to imitate the husky voice of her teacher, Miss Skupnik. All the male teachers were wild over Miss Skupnik.\n\nBefore the usher could give her another look, she slipped the money onto the counter and thrust the ticket from his hand. There! She made it!\n\nThe movie theater was eerily empty on a weekday afternoon. Two men were sitting in the back, chatting about stocks. An elderly gentleman was overtly snoring at the end of aisle. That was it. What a difference from those summer matinees that Sarah used to frequent with her friends!\n\nHer friends! She smiled. Rose and Judith! Boy, will they be jealous tomorrow! The new vampire movie, and they are stuck in school, and here she is, all by herself, to watch the goth goddess —\n\nThe lights dimmed. The projector started humming. Soon, the title card came.\n\n\"THEDA BARA in\"\n\n\"A FOOL THERE WAS\"\n\n1915 was a memorable year for Sarah Greenbaum.",
  "pros": null,
  "cons": null,
  "score": 925,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/t/theda_bara.jpg",
  "created_at": "2025-03-29T12:53:05+02:00",
  "updated_at": "2025-03-29T12:53:05+02:00"
}