{
  "name": "Theodore Maiman",
  "url": "http://jewornotjew.com/profile.jsp?ID=1603",
  "verdict": "Jew",
  "description": "\"In 1917, when Albert Einstein established the theoretic foundation for the laser in his paper \"Zur Quantentheorie der Strahlung\", his fondest hope was that the resultant device be bitchin'.\" — Sheldon Cooper, \"The Big Bang Theory\"\n\nHow do you know lasers are awesome, you ask? Well, we reply, Just look at any action/scifi movie. Whaddaya got? Lasers! Star Trek, Star Wars, Avengers, heck even the recent Captain America movie had laser guns and that (nominally) took place during World War II.\n\nAt this point, you might point out the weapons we're talking about are actually masers, or phasers, or double-breasted herringbone blazers. To which we would reply, shut up dorkalinger, we all know what we're talking about here.  \n\nAnd so you would say,  since lasers so great, wouldn't you want Jews to be involved? Darn straight, we say, but opinions diverge on who invented them. You might hear the combination of Gordon Gould, Charles Hard Townes, and Arthur Leonard Schawlow (Not a Jew. Not a Jew, with a great middle name. Barely a Jew.). Darn.\n\nBut, we continue, you know who actually created the first working laser? Theodore Maiman. J.E.W.! While the others above had some theories, he actually made it happen! (So shouldn't he get the credit, really?) That's all well and good, you say, but then if lasers are all invented and working and stuff, how come I don't have a big ol' laser gun in my holster for vaporizing deer?\n\nTo which we say, well, look, for one thing the whole gun ownership debate is complicated enough without you atomizing forest wildlife. But more importantly, lasers are everywhere. We just don't see them. The blu-ray player? The corrective eye surgery? The high-quality printer? All lasers. \n\nAnd, yes, right now, they're working on laser guns. Which, while they won't work like we see in the movies,  will still be a heck of a lot cooler than inventing conversations with ourselves just to talk about them.",
  "pros": null,
  "cons": null,
  "score": 1603,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/t/theodore_maiman.jpg",
  "created_at": "2025-03-29T13:17:03+02:00",
  "updated_at": "2025-03-29T13:17:03+02:00"
}