{
  "name": "Three Wise Men",
  "url": "http://jewornotjew.com/profile.jsp?ID=2334",
  "verdict": "Not a Jew",
  "description": "Caspar: Well, I just talked to the night manager. They are out of rooms.\n\nBalthazar: Out of rooms?\n\nCaspar: The insurance sales convention is in town.\n\nMelchior: Did you tell him how wise and important we were?\n\nCaspar: He said it didn't matter, we had to book in advance.\n\nBalthazar: What do you mean, in advance?\n\nMelchior: He probably just wanted to haggle. You know how these Jews like to haggle!\n\nBalthazar: You didn't have to go there!\n\nMelchior: Go where?\n\nCaspar: Balthazar, Melchior, enough arguing. Let's face the facts. We don't have a place to stay.\n\nMelchior: Did you try to slip him a 20?\n\nCaspar: 20 what?\n\nMelchior: You know, a 20.\n\nCaspar: No, I don't know.\n\nMelchior: 20 shekels!\n\nCaspar: Why don't YOU try to slip him 20 shekels? Oh, I know, you don't have any money! Who goes on a long trip with just a bag of frankincense?\n\nMelchior: A frankincense salesman!\n\nCaspar: Then slip him a bag of frankincense!\n\nMelchior: Oh come on, no one is gonna trade us a room for that...\n\nBalthazar: Unless...\n\nMelchior: Unless what?\n\nBalthazar: We might not be able to stay in a hotel, but there is a manger nearby...\n\nCaspar: A manger?\n\nBalthazar: Yeah, a manger. You know, camels, sheep, and the like. Cows.\n\nCaspar: You expect us to stay in the manger with... cows? I'm not a young man like you, Balthazar!\n\nBalthazar: What, you have a better idea?\n\nMelchior: Can't do the manger, I checked already. There is a young couple staying there. The woman is pregnant.\n\nBalthazar: So what? It's a pretty big manger. We'll just push the cows out.\n\nCaspar: And camels? And sheep?\n\nBalthazar: We'll tie them outside. They'll be OK for one night.\n\nMelchior: Are you not listening? The manger is already rented out!\n\nBalthazar: Hear me out. We just need to pool our resources. Caspar, you have that bag of gold...\n\nCaspar: I come all this way to see a nice Jewish dentist, and you want me to give up my gold?\n\nBalthazar: Not the whole bag, damn it! And Melchior, you have that frankinstein...\n\nMelchior: Frankincense.\n\nBalthazar: Whatever. They make perfumes out of that, right? Women love perfumes!\n\nCaspar: And what are you gonna pool with my gold and his... frankincense?\n\nBalthazar: Myrrh.\n\nCaspar: Come again?\n\nBalthazar: Myrrh. It's like gum.\n\nCaspar: You chew it?\n\nBalthazar: Chew it, boil it, put it in medicine. Good stuff.\n\nCaspar: Is that an African thing?\n\nBalthazar: Did you have to go there?\n\nCaspar: I'm just saying...\n\nBalthazar: Who cares if it's an African thing! That will make it exotic. So, with my myrrh, your gold, and his... frankinbeans...\n\nMelchior: Frankincense!\n\nCaspar: Whatever!\n\nBalthazar: We'll make them an offer they can't refuse.\n\nMelchior: I doubt they'll take any offer. I told you, the woman is pregnant!\n\nBalthazar: So what? It's not like she is gonna give birth tonight...\n\nMelchior: What if she does?\n\nBalthazar: Sheesh! We'll just deal with it! Oh, I know! We'll tell them the gifts are for the newborn! They must let us in then!\n\nCaspar: This is crazy enough to work...\n\nBalthazar: Of course, it's gonna work! Melchior, are you in?\n\nMelchior: Fine, I'm in. What choice do I have?\n\nBalthazar: Come on, Caspar!\n\nCaspar: I'm coming, I'm coming. You know, I just love babies...\n\nBalthazar: You love babies, he loves babies, we all love babies! Let's go!\n\nCaspar: You know what would be a good name? Larry...\n\nBalthazar: Fine, we'll tell them to name the baby Larry! Now hurry up! It's getting dark!",
  "pros": null,
  "cons": null,
  "score": 2334,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/t/three_wise_men.jpg",
  "created_at": "2025-03-29T13:17:22+02:00",
  "updated_at": "2025-03-29T13:17:22+02:00"
}