{
  "name": "Timberland",
  "url": "http://jewornotjew.com/profile.jsp?ID=1310",
  "verdict": "Jew",
  "description": "According to the Bible — incontrovertible fact for some, book of neato stories for others — our ancestors schlepped across the sands of the Sinai desert for 40 years.\n\nThought 1: What was up with Moses' sense of direction? And shouldn't someone at some point maybe suggested they do the navigating for a while, considering? No? Ok then...\n\nThought 2: How bad were the Israelites' feet after all that hoofing? After all, it's not like they had good hiking boots. How could we know such a thing?\n\nWell, our historical Hebrews fled for the Promised Land in a bit of hurry (they didn't even have time to finish baking their bread, dontcha' know). So it's not like they would have taken the time to pick out the proper footwear for their journey.\n\nBut even if they had, let's be clear, they were slaves. And one of the big downers about being in bondage — beyond the labor, the hours, the constant whippings — is you just don't have a lot of nice things. Note to future despots, when planning to outfit your slave workforce, a stop by the local Stride Rite will not be necessary.\n\nBut even if the Jews did have nice shoes and did have the time to go grab them, they were walking in the desert for 40 years. FORTY! Even the nicest leather sandal becomes the nicest leather shred after that kind of punishment.\n\nSo with that kind of history, well, it's no stretch to say that we are a people that understand the need for a pair of quality clogs. And thus you would think that it would make sense for the creators and current owners of Timberland — makers of rugged, well-constructed, quality hiking shoes (a pair of which we may or may not be wearing right now) — to be Jewish.\n\nAnd thus you would be correct.",
  "pros": null,
  "cons": null,
  "score": 1310,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/t/timberland.jpg",
  "created_at": "2025-03-29T13:16:56+02:00",
  "updated_at": "2025-03-29T13:16:56+02:00"
}