{
  "name": "Timothy Simons",
  "url": "http://jewornotjew.com/profile.jsp?ID=3550",
  "verdict": "Not a Jew",
  "description": "We watched Netflix's \"Nobody Wants This\" (of course, we had to!), enjoyed it (as much as we can enjoy a romcom sitcom), were trying to figure out who from the cast to profile (Adam Brody was done a long time ago, and as much as we love Kristen Bell, she is incredibly and obviously goyishe), when the headlines started to come out:\n\nIs \"Nobody Wants This\" Good For The Jews?\n\nIs \"Nobody Wants This\" Antisemitic?\n\nThat's just the two we saw. Oh boy. Ohhhh boy.\n\nSo, \"Nobody Wants This\" is the story of a shiksa (Bell) who falls for a rabbi (Brody). Don't worry if you don't know what a shiksa is, viewer (we know OUR readers know what a shiksa is), it's properly explained. Can these two crazy kids find love despite their differences? Yes, the premise of every romcom ever. But, you know, a shiksa and a rabbi.\n\nAs we said, we liked it! It's cute! Bell is adorable as always, and Brody is an absolute mensch who tries his darnedest to explain the supposed intricacies of Judaism to her: basics like not eating pork and lighting candles on Shabbat. They even spend time at Jewish summer camp!\n\nWe thought, sure, there are many broad strokes here, but the show does paint Judaism in a very good light. Brody is a pillar of strength; it's the shiksa who is the clueless klutz. So what's antisemitic about that?\n\nSome don't like the stereotypes, such as Brody's overly protective Jewish mother or the supposed importance of money. Some don't like how clueless Bell's character is about Judaism: she doesn't know the meanings of \"shalom\" and \"Shabbat\"! Some don't like that not all Jewish characters are played by Jews. (Here we go again with this! The one exception is Timothy Simons, Jonah from \"Veep\", who plays Brody's brother. And Simons is perfectly fine playing a Jew; he doesn't do any racial shtick that would make some frown. Here, he gets this profile.) Some don't like... ENOUGH!\n\nNo, a romcom whose central character is a smart, clever, good-looking rabbi is not antisemitic. You know what's antisemitic? A bunch of our country's top politicians. Worry about that, not some silly sitcom...",
  "pros": null,
  "cons": null,
  "score": 3550,
  "category": "Politics",
  "image_url": "http://jewornotjew.com/img/people/t/timothy_simons.jpg",
  "created_at": "2025-03-29T13:17:54+02:00",
  "updated_at": "2025-03-29T13:17:54+02:00"
}