{
  "name": "Tomato",
  "url": "http://jewornotjew.com/profile.jsp?ID=2358",
  "verdict": "Sadly, a Fruit.",
  "description": "We like to have our fun here at FruitOrNotFruit.com. After thousands of produce productions, it's clear that we provide an incredibly valuable service to the public.\n\nBut we've never covered anything so important that it needed to be decided by the US Supreme Court, itself. Until now...\n\nYou see, in the 1890s there was a tariff on all vegetables crossing state lines. But there was no charge for fruits. We at FONF decry such horrible double standards, of course, but that's the way it was.\n\nIn any case, a farmer challenged the taxes that had been levied on his humble tomatoes because, as we all know, the tomato is a fruit. (Please see our 2000 page treatise on fruit definitions, available at book stores everywhere for the low low price of $299.99. Or just remember that a fruit is defined as the seed-bearing structure growing from the flowering part of a plant.)\n\nSo, since tomatoes were clearly fruits, the SCOTUS immediately and unanimously decided that the tomato WAS...\n\nA vegetable. \n\nBecause... it's not clear why. At one point they say that dictionaries don't count as evidence which, if true, we have a bone to pick with some of our elementary school teachers.\n\nSo, yeah, the tomato is a fruit by reality and a vegetable by law.\n\nThank goodness our government has become far less irrational in present times.\n\nrating.innerHTML = '9';\nrat1.innerHTML = '5';\nrat2.innerHTML = '1';\nrat3.innerHTML = '3';\nratTitle.innerHTML = 'Fruit Score:';\nbanner.src = 'img/other/fruit/fruit-title.gif';\nratPic1.src = 'img/other/fruit/fruit-5.jpg';\nratPic2.src = 'img/other/fruit/fruit-1.jpg';\nratPic3.src = 'img/other/fruit/fruit-3.jpg';\n\n\na { color:#008000; }\n.border { background-color: #FF8000; }",
  "pros": null,
  "cons": null,
  "score": 2358,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/t/tomato.jpg",
  "created_at": "2025-03-29T13:17:23+02:00",
  "updated_at": "2025-03-29T13:17:23+02:00"
}