{
  "name": "Tottenham Hotspur",
  "url": "http://jewornotjew.com/profile.jsp?ID=733",
  "verdict": "Borderline Jew.",
  "description": "Here in the US, sports teams get scary, intimidating names like the San Francisco Giants, the Carolina Panthers, and ummmm, the Utah Jazz? OK, so sometimes they're not all that explicable. \n\nThen again, even the most bizarre don't match up to some of the team names that exist outside these United States. For instance, Tottenham Hotspur, which is named for — no joke — a Shakespeare character. Go figure.\n\nAnd while that certainly seems silly to us (likelihood of a US team going by the name Kilgores? 2 Gababillion to 1), we wouldn't spend too much time on it except for the fact that the team has another nickname, one used informally by its fans and opponents — The Yids.\n\nYes, really. Though the stories differ as to why, apparently Spurs (as their fans call them) has always had a large Jewish following and in a response to the antisemitism common in English soccer, they decided to fight back by adopting the ugly slur as their own.\n\nSpurs fans, therefore, call themselves Yids, Jewish or no. Spurs players are considered honorary Jews. The visiting crowds make Holocaust jokes about beating the team. Oh yes, they do. \n\nYeah, see, suddenly this stopped being fun. We're all for convention bending as a way of rooting out bigotry, but (in the words of George Carlin) you really can go too fucking far. And clearly that's what's happened here.\n\nIt's a cute custom and it makes about as much sense as naming your team after a Shakespeare character so it works in that sense, we guess. But unlike leprechauns or Mormon Jazz players, Jews are real people with real feelings. And if that makes us bad mascots, we'll just have to live with that.",
  "pros": null,
  "cons": null,
  "score": 733,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/t/tottenham_hotspur.jpg",
  "created_at": "2025-03-29T12:53:00+02:00",
  "updated_at": "2025-03-29T12:53:00+02:00"
}