{
  "name": "Uriah Levy",
  "url": "http://jewornotjew.com/profile.jsp?ID=1451",
  "verdict": "Jew",
  "description": "It seems that what the American people really would have liked was for us to have lost the War of 1812.\n\nOK, actually the US did lose that war. The British sacked and burned Washington, DC for Hashem's sake. If it weren't for the more pressing Napoleonic problems distracting our tea-luvin' cousins we'd all be back under a Union Jack right now.\n\nBut we guess what the American people wanted is that we lose that war worse? Dump more ships and trade goods into the sea, perhaps? Maybe let the bloody lobsters burn Boston and New York as well?\n\nAlso, it appears that our countrymen would prefer it if we had continued to allow flogging in our Navy. Y'know, the act of whipping another human being bloody as punishment for various perceived slights and disapproved actions? Oh sure it didn't teach the sailors anything more than how to clean vicious, pus-filled wounds in a time when bacteria were fiction and gnomes were real, but hey! Those hard-fighting, dedicated sailors needed corporal punishment every now and again. Apparently.\n\nFinally, it seems that We the People would have preferred that Monticello — historic home of Founding Father and third President Thomas Jefferson — simply fall into disrepair, and be transformed into a Chuck E. Cheese/Bennigan's on the side of some highway rather than be preserved. In fact, Americans would seem to have liked that we forget the writer of the Declaration altogether. Or at least have as few monuments to the man as possible. So what if he doubled the size of the nation and fought for religious freedom? Screw him!\n\nAnd why do we think all of this? Well these are all things that Commodore (the 18th century US equivalent of Admiral) Uriah P. Levy accomplished. Levy's ship sank over 20 British ships in the war of 1812. As head of the Navy he banned flogging. And it was his work (along with his son's) that turned Monticello from burgeoning trash heap into the preserve it is today.\n\nBut since Levy was Jewish, he  was constantly being courtmartialed on specious charges (only to be reinstated later) and his contributions to the preservation of Monticello and the legacy of Jefferson were conveniently \"forgotten\" for 80 years.\n\nAnd so it seems that the American people would rather live crappy lives than open minded ones. We may not be the first to have figured this out...",
  "pros": null,
  "cons": [
    "And so it seems that the American people would rather live crappy lives than open minded ones. We may not be the first to have figured this out..."
  ],
  "score": 1451,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/u/uriah_levy.jpg",
  "created_at": "2025-03-29T13:16:59+02:00",
  "updated_at": "2025-03-29T13:16:59+02:00"
}