{
  "name": "Velma Dinkley",
  "url": "http://jewornotjew.com/profile.jsp?ID=574",
  "verdict": "Not a Jew",
  "description": "Over the years (years? years!), we have developed four laws (corollaries? commandments?) here at JONJ that help us discover heretofore unknown Jews.\n\nLaw #1 — If thou hast an ensemble cast of characters, one of them MUST be Jewish (the James Wilson Law): So, according to that law, someone on Scooby-Doo must be Jewish. A quick glance immediately eliminates Fred and Daphne (Jews do not wear neckerchiefs. Not even swinging 60s hipster Jews), leaving us with Velma, Shaggy and Scooby as distinct possibilities.\n\nLaw #2 — Any animal that is not kosher, thou canst consider at least possibly Jewish, since Jews do not consume other Jews (The Law of the Berenstain Bears): That's good news for Scooby, since dogs are definitely not kosher (something about licking their own butts, no doubt). \n\nLaw #3 — Thou canst assume a character played by a Jew is also Jewish, if thou so desires (the Captain Kirk Law): Shaggy is voiced by Casey Kasem, the Israel-hating, Top-40 playing, f-bomb dropping radio personality. So, yeah, Shaggy is out (even without that, Shaggy's real first name is Norville. It just wasn't meant to be). Scooby was voiced primarily by the late great Don Messick, who was completely awesome but also completely not Jewish. 0-for-2. That leaves us with (shiver) Velma, who was voiced by Nicole Jaffe (no), Pat Stevens (nope), and Mindy Cohn (dingdingding!)\n\nLaw #4 — If thou canst not determine the Judaism of a character, thou art permitted to choose based on thine own personal preference (the Gargamel Law): Well, on the one hand, Velma is clearly the smartest of the group. And she does seem popular with the lesbians. On the other hand... ugh, it's Velma! Glasses-losing, geeky-beyond-belief Velma. So no. Just... no. No.\n\nAnd thus the holy, unassailable Laws of JONJ have helped us confirm an important truth: there were no Jews on Scooby-Doo.\n\nWhat's that? We've just broken the first law?  Well, they're really more guidelines than rules...",
  "pros": null,
  "cons": null,
  "score": 574,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/v/velma_dinkley.jpg",
  "created_at": "2025-03-29T12:52:56+02:00",
  "updated_at": "2025-03-29T12:52:56+02:00"
}