{
  "name": "Victor Noir",
  "url": "http://jewornotjew.com/profile.jsp?ID=2680",
  "verdict": "Barely a Jew",
  "description": "The Pere Lachaise Cemetery in Paris is well known for its famous graves. Millions of visitors every year come to see the resting places of Honore de Balzac, Edit Piaf, Marcel Proust, Jim Morrison, Oscar Wilde, Frederic Chopin, Sarah Bernhardt, Marcel Marceau, Amedeo Modigliani, Gertrude Stein... Yet the grave of a man named Victor Noir is one of the most popular.\n\nWho was Noir? Born Yvan Salmon, a son of a Jew who converted to Catholicism, Noir was a journalist in 19th century France. The country was divided between monarchists and republicans, and Noir was placed smack in the middle of a feud between Prince Pierre Bonaparte (Napoleon's great-nephew) and newspaper editor Henri Rochefort. (Any relation to d'Artagnan's archenemy? But we digress.)\n\nLong story short, Noir tried to set up a duel, and the prince shot him dead. (You read that right. Noir didn't die in a duel; he died in a pre-duel.) The prince was put on trial and aquitted. (The rich tend to get away with crime, regardless of time and place.) This led to public demonstrations, and then eventually the monarchy was toppled for good. Noir was long dead by then.\n\nWhich brings us to his grave. For whatever reason, sculptor Jules Dalou decided to depict Noir the way he was shot: dead on the street, with one rather visible... Here, just take a look.\n\n\n [X]\n\n\nYep, in death Noir sprouts an erection. Note how its color is different from the rest of the sculpture? Legends say that rubbing it enhances women's fertility or sex life (pick the one that works best for you). The authorities tried to put a fence around his tomb, but women protested and it was quickly taken down.\n\nOh, those French!",
  "pros": null,
  "cons": null,
  "score": 2680,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/v/victor_noir.jpg",
  "created_at": "2025-03-29T13:17:31+02:00",
  "updated_at": "2025-03-29T13:17:31+02:00"
}