{
  "name": "Vin Diesel",
  "url": "http://jewornotjew.com/profile.jsp?ID=632",
  "verdict": "Not a Jew",
  "description": "Can you tell someone is Jewish just by looking at them?\n\nJews DO have a common ancestry, after all (Jewish genes, not Jewish jeans. That's a different profile). And while we'd be the last people to recommend judging a Torah by its cover, we have to admit there are some common characteristics to look for when separating potential Jew from out-and-out goy.\n\nThe nose is probably the most expected. Oh sure, the Poles have long been famed for a schnoz among schnozes. And a certain Long Island set will have had their prominent proboscises assimilated down to a more acceptable, Protestant shape. But for the most part, an exclamation point in the middle of the face is a good sign of one's Hebraic history.\n\nHeight, or lack thereof, is also a fairly reliable tell. Red hair, while most associated with the Irish, can actually reveal some Jewish roots as well, especially if it's in the beard. Curly hair, dark eyes, olive skin, all can contribute to a nice, Jew-y pallor.\n\nAnother feature to look for? No tattoos. After all, we Jews are prohibited from any desecration of the body, including the suddenly popular tats (and not including earrings for some reason which probably has more to do with fashion than commandment, but we digress). \n\nSo, for instance, if someone such as Vin Diesel doesn't have tattoos, could that mean he might be Jewish? Eh, color us unimpressed. For one thing, we're not even clear if he does or doesn't have them (the Internet conflicts. Shocker). But even if he doesn't, we know for a fact that Vin is Italian and Black. And, more importantly, he hasn't made a good movie since Pitch Black in 2000. So what do we care, anyway?\n\nSo, to sum up, you can't tell someone is Jewish just by looking at their tattoos. In fact, you can't tell what anyone is just by looking at them. But it doesn't take more than a glance at Vin Diesel to realize the following:",
  "pros": null,
  "cons": null,
  "score": 632,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/v/vin_diesel.jpg",
  "created_at": "2025-03-29T12:52:58+02:00",
  "updated_at": "2025-03-29T12:52:58+02:00"
}