{
  "name": "Vladimir Putin",
  "url": "http://jewornotjew.com/profile.jsp?ID=1438",
  "verdict": "Not a Jew",
  "description": "We woke up on what could only be the backseat of a car. Tinted windows cloaked the outside streets.\n\n\"Good, you awake.\"\n\nThe man sitting in the passenger seat turned around. His Slavic features were topped by a completely barren scalp.\n\n\"What is the meaning of this...\", we started to ask, but the man placed a raised finger by his lips.\n\n\"In moment, you find out. We almost there.\"\n\nThe car made a stop. The man got out and opened the door from the outside, letting us out. We were on an nondescript street in New York City; the car, a black sedan, was sporting diplomatic plates. It was double parked.\n\n\"Follow me,\" the man said, grabbing us by the forearm. As if we had any choice.\n\nWe made our way up the short flight into a townhouse, where the man placed us on a chair next to closed double doors. He swiftly departed.\n\nBefore we had a chance to look around, the doors opened, and another man appeared. He was wearing a tailored suit and the most welcoming smile.\n\n\"So glad you can join us,\" he said, leading us inside with the extended arm.\n\n\"Drink?\", he asked, pointing to a chair.\n\n\"Could you please explain...\"\n\nThe man leaned over his desk and pressed a button on the intercom. Mere seconds after, a pair of impeccably long legs walked in and placed a tray with two glasses and two pickles on the desk.\n\n\"Thank you, Natalia,\" said the man, as the legs exited, followed by his extended glance.\n\nThe man took one glass, downed it in one gulp, and loudly crunched on the pickle. His gold tooth sparked with every bite.\n\nWith the pickle demolished, the man took the chair from the back of his desk and placed it next to ours. He unbuttoned his jacket and sat down, turning to us.\n\n\"So, Mr... You are the one who runs that Jew or Not Jew site, no?\"\n\nSo this is what this is about?\n\n\"My apologies for your trip here,\" the man continued. \"We will just have quick discussion, and you will be on your way. I promise.\"\n\nHis lips twisted themselves into the most cheshiric of grins.\n\n\"Your website, you profile famous people, correct? Not only the Jews, correct?\"\n\nHe reached into his breast pocket for a pair of glasses and picked up a piece of paper from the desk.\n\n\"Bill Clinton,\" he started reading. \"Zinedine Zidane, Sandra Bullock, Christopher Columbus... Even great Russian poet Alexander Pushkin! He is not Jew, is he?\"\n\n\"No, he is not...\"\n\n\"But right here is your profile of him!\"\n\n\"We clearly state he is not a Jew...\"\n\n\"Yet you wrote profile!\"\n\n\"Look, sir,\" we attempted to respond. \"You really need to make yourself more clear here.\"\n\n\"Vladimir Vladimirovich Putin,\" the man said, pointing to a portrait hanging on the wall. \"Why no profile of him?\"\n\n\"Well...\"\n\n\"Well what? You profile Kevin Costner! You cannot say that Vladimir Vladimirovich is lesser man than Kevin Costner!\"\n\n\"You see, with Costner, there is an Internet rumor that he is Jewish...\"\n\n\"And there are no such rumors about Vladimir Vladimirovich? There are plenty! Look at this one,\" he showed us a printout. \"His real last name is Putzman! Look at this one,\" he showed another. \"His mother is Jewess!\"\n\n\"These are not true, are they?\"\n\n\"Of course, they not true. But they justify profile, no?\"\n\n\"You see, sir, if we wrote a profile for every baseless rumor out there...\"\n\n\"We are not asking about EVERY baseless rumor. We are asking you to write profile of Vladimir Vladimirovich Putin.\"\n\n\"But why?\"\n\n\"You Jews with your constant questions!\"\n\nThe man's lips once again repositioned themselves into a smile.\n\n\"You do that for us, okay? And if not, our next discussion will not be so benign.\"\n\n\"Okay...\"\n\n\"Now that's a good boy. And go easy on that K Score!\"",
  "pros": null,
  "cons": null,
  "score": 1438,
  "category": "Religion",
  "image_url": "http://jewornotjew.com/img/people/v/vladimir_putin.jpg",
  "created_at": "2025-03-29T13:16:59+02:00",
  "updated_at": "2025-03-29T13:16:59+02:00"
}