{
  "name": "Wade Boggs",
  "url": "http://jewornotjew.com/profile.jsp?ID=546",
  "verdict": "Not a Jew",
  "description": "Superstition is a funny thing.\n\nAll of us have little things we do — little quirks really. Avoiding cracks on the sidewalk. Always tying your right shoe first. Never saying the word (cancer). These things probably won't have any effect on our lives, but we still do them and feel good about doing them and really there's nothing wrong with doing that.\n\nUnless, of course, you go too far. And you really can go too far — to that place where superstition transforms to obsession. Case in point, hit/mustache king Wade Boggs of the Red Sox, Yankees and Tampa Bay Stink Fish.\n\nBoggs didn't just border on the obsessive: he moved in with it, married it and it raised its children. His little pre-game rituals included such gems as: A bucket of fried chicken before every game. Specific exercises at specific times of day (7:17, time for wind sprints!) Drawing a Chai in the ground with his bat before every at bat.\n\nWe don't know why he did these things, but we can guarantee none of them helped. Fried chicken is no better for athletes than little chocolate donuts. Exercises are just as valuable at 7:18 as they are at 7:17. And drawing Hebrew symbols certainly have never helped the Jews, so it's unlikely they did much for such a super-goy as Boggs. Maybe if he ate a beef brisket before every game. But we digress.\n\nBoggs wasn't making himself a better hitter or controlling the inherent randomness of the quantum universe, or currying favor with G-d in order to gain a steadier diet of meatballs from the opposing pitcher. \n\nHe was just a man, overwhelmed by the constant pressure and stress that is endemic to his chosen career and looking for some way, however bizarre, to control it all. \n\nAnd that's something all of us can understand.",
  "pros": null,
  "cons": [
    "tant pressure and stress that is endemic to his chosen career and looking for some way, however bizarre, to control it all."
  ],
  "score": 546,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/w/wade_boggs.jpg",
  "created_at": "2025-03-29T12:52:56+02:00",
  "updated_at": "2025-03-29T12:52:56+02:00"
}