{
  "name": "Watto",
  "url": "http://jewornotjew.com/profile.jsp?ID=122",
  "verdict": "Not a Jew",
  "description": "For those who don't remember (or are trying to forget), Watto is the gambling, slave owning blue imp from \"Star Wars: Episode 1: Good G-d What Were We Thinking?\"\n\nAnd if you don't remember him, you've probably also forgotten there was quite a to do about our flying friend at the time. You see, all the usual suspects were suddenly up in arms about the fact that since he had a big nose and loved money, Watto must be intended to be a Jew. So everyone's pissed about the negative Jewish stereotype in Star Wars. George Lucas is an anti-semite. Blah blah blah.\n\nWhat a load of bullshit. \n\nIf a character is designated as Jewish and is portrayed as loving money, having a big nose, being henpecked by women, whatever, that's a negative Jewish stereotype and the creator should be called to task.\n\nBut if a character has a big nose and loves money and the anti-defamation league or whoever says that makes him/her Jewish, well, that's not the creator of the character spreading negative stereotypes. That's the Jews themselves.\n\nWatto doesn't wear a yarmulke or attend shul. He isn't studious, intelligent, or well-spoken. He neither gives to his community, nor adds anything to the society at large. THESE are the stereotypes of Jews we're happy to have and THESE are the stereotypes of Jews we should do everything we can to reinforce. The more we attach the negatives to ourselves, the more we spread them. Like the anti-semites don't make it hard enough.\n\nThe next time you see some super-schnozzed, coin obsessed momma's boy character floating around the fictional universe you can form whatever opinion of him you want. But let's be clear.\n\nHe's not a Jew.",
  "pros": null,
  "cons": null,
  "score": 122,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/w/watto.jpg",
  "created_at": "2025-03-29T12:52:45+02:00",
  "updated_at": "2025-03-29T12:52:45+02:00"
}