{
  "name": "Wilhelm Steinitz",
  "url": "http://jewornotjew.com/profile.jsp?ID=895",
  "verdict": "Jew",
  "description": "The first chess championship of the world was a titillating affair (yes, that's right, we used \"chess\" and \"titillating\" in the same sentence).\n\nOn one side, there was Wilhelm Steinitz. The Austrian-born Jew was the dominant player of his time, creating the defensive positional style of chess still largely at use today. Oh, how did his opponents scoff at that! Why defend when you can attack, attack, attack! Well, Steinitz showed them all, beating all comers... and then took himself out of the game, playing but one match in a nine-year span, instead concentrating on his job as a... chess journalist.\n\nSteinitz's absence from the competitive game led to the rise of Johannes Zukertort. He also had Jewish roots, but those were dispatched. His Jewish father became a Christian missionary, leading to the family getting kicked out of Poland. (If there's one thing we Jews don't like, it's missionaries. Formerly Jewish missionaries? Don't get us started.) Zukertort ended up in England, where he claimed to be a speaker of nine languages, a master swordsman, a medical doctor, a war hero, and a... chess journalist. That last part was true.\n\nSo in 1886, a world championship was arranged. There was much debate about the location; Zukertort preferred England; Steinitz insisted on his new homeland of America. Steinitz prevailed, as Zukertort was persuaded by a nice monetary bonus. And that was the beginning of his downfall.\n\nWhen the tournament started in New York, the tensions were through the roof. The two competitors plain didn't like each other; huge amounts of money were wagered; fans packed the auditorium; women shrieked at the mere sight of the competitors (well, perhaps not that last part).\n\nZukertort had the upper hand in New York, but Steinitz evened the series when it moved to St. Louis. Then the tournament shifted to New Orleans, where Zukertort, fatigued and distraught, could do nothing to match Steinitz's mastery. Making one brash move after another, he was methodically dispatched, with Steinitz winning the series ten games to five (there were five draws), and with it, the first title of World Chess Champion.\n\nWho knew chess could be so exciting?",
  "pros": null,
  "cons": null,
  "score": 895,
  "category": "Sports",
  "image_url": "http://jewornotjew.com/img/people/w/wilhelm_steinitz.jpg",
  "created_at": "2025-03-29T12:53:04+02:00",
  "updated_at": "2025-03-29T12:53:04+02:00"
}