{
  "name": "Wilhelm Reich",
  "url": "http://jewornotjew.com/profile.jsp?ID=1076",
  "verdict": "Borderline Jew.",
  "description": "For those readers who don't know who Wilhelm Reich was, let's see if they can figure out his profession from the following clues. Born to a Jewish family that rejected Judaism, he grew up on a cattle farm. His father was cold and domineering. His mother committed suicide after an affair was discovered. Wilhelm supposedly lost his virginity at the age of 11.\n\nWell, psychiatrist, of course! And one of the most brilliant and forward-thinking ones, who advocated sexual freedom and found followers among such minds as Saul Bellow, William Burroughs, and Norman Mailer.\n\nReich did not consider himself Jewish, but the Nazis for sure did. So he got out of Austria in the 1930s, after he was derided as a womanizing, communist, free-love-advocating Jew. After some time in Scandinavia which he spent studying the orgasm, he made his way to the US in 1939. And this is when the proverbial feces hit the fan.\n\nReich became obsessed with something he called an \"orgone\", a primordial cosmic energy he claimed to have discovered. The orgone was supposedly all around us, so Reich built accumulators trying to harness it, making his patients sit in \"orgone boxes\" (J.D. Salinger was a fan, which says it all right there), which, he claimed, gave them better health. Oh, and during therapy sessions, he started to touch his patients, as well as making them strip down to their underwear.\n\nThere is much more to it if one chooses to explore, with more insane manifestations that we'd ever want to discuss. Reich did not end well, dying in prison.\n\nSo if you guessed psychiatrist, you're not entirely right... He also grew up to be a crackpot.",
  "pros": null,
  "cons": null,
  "score": 1076,
  "category": "",
  "image_url": "http://jewornotjew.com/img/people/w/wilhelm_reich.jpg",
  "created_at": "2025-03-29T13:16:50+02:00",
  "updated_at": "2025-03-29T13:16:50+02:00"
}