{
  "name": "Zero Mostel",
  "url": "http://jewornotjew.com/profile.jsp?ID=1557",
  "verdict": "Jew",
  "description": "In modern America, certain minority groups carry generalized, undeserved slurs. \n\nFor example,  a small (but very vocal) group has decided that all gays are pedophiles. SO not true. Similarly, another group (actually, it may be the same exact people) has decided that all Arabs/Muslims are terrorists. Which is ludicrous. \n\nThe big smear of the 1950s? All Jews are communists. (If you're under the age of say... 30, you probably don't realize this but being called a communist was just as bad as being called a terrorist or a pedophile or any other despicable, amoral, inhuman piece of crap.) \n\nSince Zero Mostel, comedian extraordinaire, was Jewish and had once appeared in a communist magazine, he was called before the House Committee on Un-American Activities to defend his actions. There, Mostel was asked to \"name names.\" If he did, he was guilty of being a pinko, Lenin-loving, scumbag. If he did not he was in contempt and thus, guilty of being a pinko, Lenin-loving, scumbag.\n\nZero had nothing to say and plead the 5th. Which meant he was guilty of being a pinko... well, you get the point. From 1951 (a year in which he had appeared in five films) till 1959, Mr. Mostel was blacklisted — no longer welcome to appear on film or television.\n\nWas Mostel really a communist? Maybe. Did anyone ever prove it? Or prove that if he was it was having a deleterious effect on society, the nation, anyone at all? Nope. \n\nWe still got Fiddler and The Producers and A Funny Thing Happened on the Way to the Forum, but you have to wonder how much we lost during Mostel's eight years in exile for... well, apparently for being Jewish.\n\nWe just thank Hashem our country learned from the experience and no longer allows bigoted stereotypes to set government policy.",
  "pros": null,
  "cons": null,
  "score": 1557,
  "category": "Comedy",
  "image_url": "http://jewornotjew.com/img/people/z/zero_mostel.jpg",
  "created_at": "2025-03-29T13:17:02+02:00",
  "updated_at": "2025-03-29T13:17:02+02:00"
}