{
  "name": "Zhao Yingcheng",
  "url": "http://jewornotjew.com/profile.jsp?ID=1014",
  "verdict": "Jew",
  "description": "In his Books of the Marvels of the World, Marco Polo claims to have met Jews in Mongol-controlled China during the latter part of the 13th century. He mentions this casually, like the way you'd say you saw some Lubavitch on your last visit to Brooklyn or picked up a dozen bagels on your way out of West Orange, NJ (Bagel Box right off of Eagle Rock. You will not regret).\n\nBut the modern reader (aka, us) does a bit of a double take. Like saying you picked up a dozen bagels on your way out of Mars. Wait what? It just induces complete brain lock. Once you get the ol' wheels churning though, you start doing a little digging and find...\n\nActually, not much. Jews in China? There's really only two possibilities here:\n\n1. Polo was an idiot: It's actually a distinct possibility. There are many issues with his accounts, not the least of which is he never mentions the Great Wall — kinda like going to the Grand Canyon and missing the great big hole in the ground. Maybe he saw some people with thick beards and called them Jews. Hashem knows. For their part, the modern Chinese government denies the existence of any large Jewish communities in China... ever. Of course, this is a government that still denies Taiwan is it's own country, so speaking of delusional....\n\n2. Polo was correct and the community was lost to history: so there does appear to have been a Jewish-Chinese community in the town of Kaifeng (to be clear, the Chinese government says no way, Xiuxe). And wouldn't you know, there appears to even have been a Jewish mandarin (Zhao Yingcheng! He even rebuilt Kaifeng's temple after it's destruction in the 1600's. L'Chaim!). Of course all traces sank into the Yangtze sometime before anyone outside of China could record anything (some would point out it was right before which sure seems super convenient, yah?). \n\nSo in the end it seems there may definitely have been some Jews in China somewhere. Probably. At least one mandarin whose own country is almost 100% sure didn't exist and a town that everyone agrees was Jewish except the people who live there.\n\nHope that clears everything up for you.",
  "pros": null,
  "cons": null,
  "score": 1014,
  "category": "Literature",
  "image_url": "http://jewornotjew.com/img/people/z/zhao_yingcheng.jpg",
  "created_at": "2025-03-29T13:16:48+02:00",
  "updated_at": "2025-03-29T13:16:48+02:00"
}