{
  "name": "Zoey Deutch",
  "url": "http://jewornotjew.com/profile.jsp?ID=2760",
  "verdict": "Jew",
  "description": "Hi Jew or Not Jew readers! My name is Adam, and I'm this website's new recapper. Did you miss a recent profile? Not to worry, I'm hear not only to summarize, but also to grade and add comments (you bet they'll be witty!). Let's get started!\n\nToday, I'm recapping \"Jew or Not Jew: Ben Platt.\" I was really excited when his profile popped up. As a fan of musical theater, I saw Platt perform on Broadway numerous times. I also knew him from the film \"Pitch Perfect\" and it sequel. Truly a talented man, and a talented Jew. An excellent choice to profile, Jew or Not Jew creators! (I will call them \"creators\" for short.)\n\nHowever, once I started reading, I was a little disappointed. Platt's musical theater talents were only mentioned in passing, and his success in the movies was not even mentioned! Hey \"creators\", how would you like if someone profiled you and didn't even mention your website?\n\nThe crux of the profile deals with the new Netflix show \"The Politician.\" The \"creators\" make a point that they are not gonna watch it. Like we can believe them! We know from their recent fare that they are neck deep in Netflix dreck. I bet they devoured \"The Politician\" in one sitting. And, \"creators,\" if you are going to talk about \"The Politician,\" how can you not mention Zoey Deutch? She is on the show and she is Jewish! Her mom is the one and only Lea Thompson... or as you might know her (because your knowledge of movies clearly peaked in 1985), Lorainne McFly! Zoey's dad is a Jew, Howard Deutch.\n\nI did not hate everything about the profile. The joke comparing \"The Politician\" (which, again, the \"creators\" claimed they DID NOT WATCH) to the real world was repetitive, but on the point. And the potential of the latent Jewishness of Platt's character not only piqued my interest, but also introduced a tantalizing subcontext to the show (which, once again, THEY DID NOT WATCH!).\n\nIn summary, good intentions, but a less than solid offering. Grade: C-.\n\nTo Comment or Not To Comment:\n At least they mentioned Gwyneth Paltrow and Bob Balaban...\n For some reason, the \"see also\" section used to include Noah Baumbach, but doesn't any more. Make up your mind!\n Periods and commas go inside quotations!\n Why hasn't Bob Balaban been profiled yet?",
  "pros": null,
  "cons": null,
  "score": 2760,
  "category": "Entertainment",
  "image_url": "http://jewornotjew.com/img/people/z/zoey_deutch.jpg",
  "created_at": "2025-03-29T13:17:33+02:00",
  "updated_at": "2025-03-29T13:17:33+02:00"
}